{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/felix/KTH/AppliedEconometrics/Project/replication_logfile_tables.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}16 Dec 2024, 14:52:43
{txt}
{com}. 
. *CONTROLS FOR BASELINE VARIABLES
. global area_controls "area_pop_base area_debt_total_base area_business_total_base area_exp_pc_mean_base area_literate_head_base area_literate_base"
{txt}
{com}. 
. cd "$outputdir"
{res}/Users/felix/KTH/AppliedEconometrics/Project/Replication
{txt}
{com}. 
. ***Table 1A: Baseline summary statistics***
. *******************************************
. use "$datadir/2013-0533_data_baseline.dta", clear
{txt}(Baseline data for "The miracle of microfinance?" (Banerjee et al.), AEJ 2014)

{com}. 
. local hh_composition "hh_size adult children male_head head_age head_noeduc"
{txt}
{com}. local credit_access "spandana othermfi bank informal anyloan"
{txt}
{com}. local loan_amt "spandana_amt othermfi_amt bank_amt informal_amt anyloan_amt"
{txt}
{com}. local self_emp_activ "total_biz female_biz female_biz_pct"
{txt}
{com}. local businesses "bizrev bizexpense bizinvestment bizemployees hours_weekbiz"
{txt}
{com}. local businesses_allHH "bizrev_allHH bizexpense_allHH bizinvestment_allHH bizemployees_allHH hours_weekbiz_allHH"
{txt}
{com}. local consumption "total_exp_mo nondurable_exp_mo durables_exp_mo home_durable_index"
{txt}
{com}. 
. local allvars "`hh_composition' `credit_access' `loan_amt' `self_emp_activ' `businesses' `businesses_allHH' `consumption'"
{txt}
{com}. 
. *Correct dataset for households without businesses --> put variables to 0 to make sure that they are also taken into consideration when summarizing data about businesses for all households*
. 
. gen bizrev_allHH = bizrev
{txt}(2,156 missing values generated)

{com}. replace bizrev = 0 if total_biz == 0
{txt}(2,156 real changes made)

{com}. 
. gen bizexpense_allHH = bizexpense
{txt}(2,156 missing values generated)

{com}. replace bizexpense = 0 if total_biz == 0
{txt}(2,156 real changes made)

{com}. 
. gen bizinvestment_allHH = bizinvestment
{txt}(2,156 missing values generated)

{com}. replace bizinvestment = 0 if total_biz == 0
{txt}(2,156 real changes made)

{com}. 
. gen bizemployees_allHH = bizemployees
{txt}(2,157 missing values generated)

{com}. replace bizemployees = 0 if total_biz == 0
{txt}(2,156 real changes made)

{com}. 
. gen hours_weekbiz_allHH = hours_weekbiz
{txt}(2,157 missing values generated)

{com}. replace hours_weekbiz = 0 if total_biz == 0
{txt}(2,156 real changes made)

{com}. 
. * Summary statistics for control group (treatment == 0)
. 
. summarize hh_size adult children male_head head_age head_noeduc if treatment == 0

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}hh_size {c |}{res}      1,220    5.037705    1.666212          1         14
{txt}{space 6}adults {c |}{res}      1,220    3.438525    1.465599          1         10
{txt}{space 4}children {c |}{res}      1,220     1.59918    1.228256          0          7
{txt}{space 3}male_head {c |}{res}      1,216    .9070724    .2904504          0          1
{txt}{space 4}head_age {c |}{res}      1,216    41.14967    10.83945         21         82
{txt}{hline 13}{c +}{hline 57}
{space 1}head_noeduc {c |}{res}      1,216    .3700658    .4830207          0          1
{txt}
{com}. summarize spandana othermfi bank informal anyloan if treatment == 0

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}spandana {c |}{res}      1,213           0           0          0          0
{txt}{space 4}othermfi {c |}{res}      1,213    .0107172    .1030103          0          1
{txt}{space 8}bank {c |}{res}      1,213    .0362737    .1870475          0          1
{txt}{space 4}informal {c |}{res}      1,213    .6323166    .4823735          0          1
{txt}{space 5}anyloan {c |}{res}      1,213    .6801319    .4666176          0          1
{txt}
{com}. summarize spandana_amt othermfi_amt bank_amt informal_amt anyloan_amt if treatment == 0

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
spandana_amt {c |}{res}      1,213           0           0          0          0
{txt}othermfi_amt {c |}{res}      1,213    201.1542    2742.364          0      75000
{txt}{space 4}bank_amt {c |}{res}      1,213     7438.17    173268.3          0    6000000
{txt}informal_amt {c |}{res}      1,213    28460.02    65312.16          0     940000
{txt}{space 1}anyloan_amt {c |}{res}      1,213       37892    191291.6          0    6245000
{txt}
{com}. summarize total_biz female_biz female_biz_pct if treatment == 0

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 3}total_biz {c |}{res}      1,220    .3196721    .6822055          0          7
{txt}{space 2}female_biz {c |}{res}      1,220     .145082    .4002875          0          3
{txt}female_biz~t {c |}{res}        295    .4882809    .4823504          0          1
{txt}
{com}. summarize bizrev bizexpense bizinvestment bizemployees hours_weekbiz if treatment == 0          

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}bizrev {c |}{res}      1,220     3866.59    27146.79          0     753600
{txt}{space 2}bizexpense {c |}{res}      1,220    874.7031    12932.56          0   430571.4
{txt}bizinvestm~t {c |}{res}      1,220    93.02459    1559.052          0      48000
{txt}bizemployees {c |}{res}      1,220    .0409836     .413027          0          9
{txt}hours_week~z {c |}{res}      1,220    18.45328    46.05365          0        507
{txt}
{com}. summarize bizrev_allHH bizexpense_allHH bizinvestment_allHH bizemployees_allHH hours_weekbiz_allHH if treatment == 0

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
bizrev_allHH {c |}{res}        295    15990.64    53488.75          0     753600
{txt}bizexpense~H {c |}{res}        295    3617.416    26144.04          0   430571.4
{txt}bizinvestm~H {c |}{res}        295    384.7119    3156.815          0      48000
{txt}bizemploye~H {c |}{res}        295    .1694915    .8279255          0          9
{txt}hours_week~H {c |}{res}        295    76.31525    66.05444          0        507
{txt}
{com}. summarize total_exp_mo nondurable_exp_mo durables_exp_mo home_durable_index if treatment == 0

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
total_exp_mo {c |}{res}      1,220    4888.431    4074.372        800      50930
{txt}nondurable~o {c |}{res}      1,220    4734.685    3839.802        800      50930
{txt}durables_e~o {c |}{res}      1,220    153.7457    584.5941          0   7708.333
{txt}home_durab~x {c |}{res}      1,220    1.941369    .8290679   .2444602   4.681735
{txt}
{com}. 
. ***Table 1B: Endline summary statistics***
. ******************************************
. use "$datadir/2013-0533_data_endlines1and2.dta", clear
{txt}(Endline data for "The miracle of microfinance?" (Banerjee et al.), AEJ 2014)

{com}. 
. local hh_composition "hhsize_1 hhsize_2 adults_1 adults_2 children_1 children_2 male_head_1 male_head_2 head_age_1 head_age_2 head_noeduc_1 head_noeduc_2"
{txt}
{com}. display "`hh_composition'"
{res}hhsize_1 hhsize_2 adults_1 adults_2 children_1 children_2 male_head_1 male_head_2 head_age_1 head_age_2 head_noeduc_1 head_noeduc_2
{txt}
{com}. local credit_access "spandana_1 spandana_2 othermfi_1 othermfi_2 anybank_1 anybank_2 anyinformal_1 anyinformal_2 anyloan_1 anyloan_2"
{txt}
{com}. display "`credit_access'"
{res}spandana_1 spandana_2 othermfi_1 othermfi_2 anybank_1 anybank_2 anyinformal_1 anyinformal_2 anyloan_1 anyloan_2
{txt}
{com}. local loan_amt "spandana_amt_1 spandana_amt_2 othermfi_amt_1 othermfi_amt_2 bank_amt_1 bank_amt_2 informal_amt_1 informal_amt_2 anyloan_amt_1 anyloan_amt_2"
{txt}
{com}. display "`loan_amt'"
{res}spandana_amt_1 spandana_amt_2 othermfi_amt_1 othermfi_amt_2 bank_amt_1 bank_amt_2 informal_amt_1 informal_amt_2 anyloan_amt_1 anyloan_amt_2
{txt}
{com}. local self_emp_activ "total_biz_1 total_biz_2 female_biz_new_1 female_biz_new_2 female_biz_pct_1 female_biz_pct_2"
{txt}
{com}. display "`self_emp_activ'"
{res}total_biz_1 total_biz_2 female_biz_new_1 female_biz_new_2 female_biz_pct_1 female_biz_pct_2
{txt}
{com}. local businesses "bizrev_1 bizrev_2 bizexpense_1 bizexpense_2 bizinvestment_1 bizinvestment_2 bizemployees_1 bizemployees_2 hours_week_biz_1 hours_week_biz_2"
{txt}
{com}. display "`businesses'"
{res}bizrev_1 bizrev_2 bizexpense_1 bizexpense_2 bizinvestment_1 bizinvestment_2 bizemployees_1 bizemployees_2 hours_week_biz_1 hours_week_biz_2
{txt}
{com}. local businesses_allHH "bizrev_allHH_1 bizrev_allHH_2 bizexpense_allHH_1 bizexpense_allHH_2 bizinvestment_allHH_1 bizinvestment_allHH_2 bizemployees_allHH_1 bizemployees_allHH_2 hours_week_biz_allHH_1 hours_week_biz_allHH_2"
{txt}
{com}. display "`businesses_allHH'"
{res}bizrev_allHH_1 bizrev_allHH_2 bizexpense_allHH_1 bizexpense_allHH_2 bizinvestment_allHH_1 bizinvestment_allHH_2 bizemployees_allHH_1 bizemployees_allHH_2 hours_week_biz_allHH_1 hours_week_biz_allHH_2
{txt}
{com}. local consumption "total_exp_mo_1 total_exp_mo_2 nondurable_exp_mo_1 nondurable_exp_mo_2 durables_exp_mo_1 durables_exp_mo_2 home_durable_index_1 home_durable_index_2"
{txt}
{com}. display "`consumption'"
{res}total_exp_mo_1 total_exp_mo_2 nondurable_exp_mo_1 nondurable_exp_mo_2 durables_exp_mo_1 durables_exp_mo_2 home_durable_index_1 home_durable_index_2
{txt}
{com}. 
. * local allvars "`hh_composition' `credit_access' `loan_amt' `self_emp_activ' `businesses' `businesses_allHH' `consumption'"
. 
. local allvars "`bizrev_allHH_' `bizexpense_allHH_' `bizinvestment_allHH_' `bizemployees_allHH_' `hours_week_biz_allHH_'"
{txt}
{com}. 
. display "`allvars'"
{res}    
{txt}
{com}. 
. 
. *1) Generate business variables for all households --> put variables to . (missing) for households without a business
. forval i = 1/2 {c -(}
{txt}  2{com}.                 gen bizrev_allHH_`i'= bizrev_`i'
{txt}  3{com}.                 replace bizrev_`i'=. if total_biz_`i'==0
{txt}  4{com}.                         {c )-}
{txt}(255 missing values generated)
(4,395 real changes made, 4,395 to missing)
(747 missing values generated)
(3,498 real changes made, 3,498 to missing)

{com}. forval i = 1/2 {c -(}
{txt}  2{com}.                 gen bizexpense_allHH_`i'= bizexpense_`i'
{txt}  3{com}.                 replace bizexpense_`i'=. if total_biz_`i'==0
{txt}  4{com}.                         {c )-}
{txt}(178 missing values generated)
(4,395 real changes made, 4,395 to missing)
(747 missing values generated)
(3,498 real changes made, 3,498 to missing)

{com}.                         
. forval i = 1/2 {c -(}
{txt}  2{com}.                 gen bizinvestment_allHH_`i'= bizinvestment_`i'
{txt}  3{com}.                 replace bizinvestment_`i'=. if total_biz_`i'==0
{txt}  4{com}.                         {c )-}
{txt}(63 missing values generated)
(4,391 real changes made, 4,391 to missing)
(721 missing values generated)
(3,498 real changes made, 3,498 to missing)

{com}. 
. forval i = 1/2 {c -(}
{txt}  2{com}.                 gen bizemployees_allHH_`i'= bizemployees_`i'
{txt}  3{com}.                 replace bizemployees_`i'=. if total_biz_`i'==0
{txt}  4{com}.                         {c )-}
{txt}(101 missing values generated)
(4,395 real changes made, 4,395 to missing)
(721 missing values generated)
(3,498 real changes made, 3,498 to missing)

{com}.                         
. forval i = 1/2 {c -(}
{txt}  2{com}.                 gen hours_week_biz_allHH_`i'= hours_week_biz_`i'
{txt}  3{com}.                 replace hours_week_biz_`i'=. if total_biz_`i'==0
{txt}  4{com}.                         {c )-}
{txt}(101 missing values generated)
(4,395 real changes made, 4,395 to missing)
(721 missing values generated)
(3,498 real changes made, 3,498 to missing)

{com}.                         
. *2) Reshape to one observation per household per endline:
. 
. *Rename*
. 
. reshape long `allvars', i(hhid) j(endline)
{err}invalid syntax
{txt}{search r(198), local:r(198);}

end of do-file

{search r(198), local:r(198);}

{com}. do "/Users/felix/KTH/AppliedEconometrics/Project/2013-0533_do_tables.do"
{txt}
{com}. /*******************************************************************************      
> Program Name:   2013-0533_do_tables  
> Contact:                Cynthia Kinnan (c-kinnan@northwestern.edu)
> Last Modified:  5 May 2014
> Purpose:                Replicates all tables from "The miracle of microfinance? Evidence
>                                 from a randomized evaluation" (Banerjee et al.), AEJ, 2014
> Files Used:     2013-0533_data_baseline.dta
>                                 2013-0533_data_endlines1and2.dta
>                                 2013-0533_data_census.dta
>                                 2013-0533_data_endline1businesstype.dta
> Files Created:  table1a.txt
>                                 table1b.txt
>                                 table2.txt
>                                 table3.txt
>                                 table3b.txt
>                                 table3c.txt
>                                 table4.txt
>                                 table5.txt
>                                 table6.txt
>                                 table7.txt
>                                 table_index_pvals.txt
>                                 tableA1.txt
>                                 tableA2.txt
>                                 tableA3.txt
>                                 tableA4.txt
>                                 tableA5.txt
> *******************************************************************************/
. cap log close
{smcl}
{com}{sf}{ul off}