{smcl}
{txt}{sf}{ul off}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/felix/KTH/AppliedEconometrics/Project/replication_logfile_tables.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}30 Dec 2024, 17:57:24
{txt}
{com}. 
. *CONTROLS FOR BASELINE VARIABLES
. global area_controls "area_pop_base area_debt_total_base area_business_total_base area_exp_pc_mean_base area_literate_head_base area_literate_base"
{txt}
{com}. 
. cd "$outputdir"
{res}/Users/felix/KTH/AppliedEconometrics/Project/Replication
{txt}
{com}. 
. ***Table 1A: Baseline summary statistics***
. *******************************************
. use "$datadir/2013-0533_data_baseline.dta", clear
{txt}(Baseline data for "The miracle of microfinance?" (Banerjee et al.), AEJ 2014)

{com}. 
. local hh_composition "hh_size adult children male_head head_age head_noeduc"
{txt}
{com}. local credit_access "spandana othermfi bank informal anyloan"
{txt}
{com}. local loan_amt "spandana_amt othermfi_amt bank_amt informal_amt anyloan_amt"
{txt}
{com}. local self_emp_activ "total_biz female_biz female_biz_pct"
{txt}
{com}. local businesses "bizrev bizexpense bizinvestment bizemployees hours_weekbiz"
{txt}
{com}. local businesses_allHH "bizrev_allHH bizexpense_allHH bizinvestment_allHH bizemployees_allHH hours_weekbiz_allHH"
{txt}
{com}. local consumption "total_exp_mo nondurable_exp_mo durables_exp_mo home_durable_index"
{txt}
{com}. 
. local allvars "`hh_composition' `credit_access' `loan_amt' `self_emp_activ' `businesses' `businesses_allHH' `consumption'"
{txt}
{com}. 
. *Correct dataset for households without businesses --> put variables to 0 to make sure that they are also taken into consideration when summarizing data about businesses for all households*
. 
. gen bizrev_allHH = bizrev
{txt}(2,156 missing values generated)

{com}. replace bizrev = 0 if total_biz == 0
{txt}(2,156 real changes made)

{com}. 
. gen bizexpense_allHH = bizexpense
{txt}(2,156 missing values generated)

{com}. replace bizexpense = 0 if total_biz == 0
{txt}(2,156 real changes made)

{com}. 
. gen bizinvestment_allHH = bizinvestment
{txt}(2,156 missing values generated)

{com}. replace bizinvestment = 0 if total_biz == 0
{txt}(2,156 real changes made)

{com}. 
. gen bizemployees_allHH = bizemployees
{txt}(2,157 missing values generated)

{com}. replace bizemployees = 0 if total_biz == 0
{txt}(2,156 real changes made)

{com}. 
. gen hours_weekbiz_allHH = hours_weekbiz
{txt}(2,157 missing values generated)

{com}. replace hours_weekbiz = 0 if total_biz == 0
{txt}(2,156 real changes made)

{com}. 
. * Summary statistics for control group (treatment == 0)
. 
. summarize hh_size adult children male_head head_age head_noeduc if treatment == 0

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}hh_size {c |}{res}      1,220    5.037705    1.666212          1         14
{txt}{space 6}adults {c |}{res}      1,220    3.438525    1.465599          1         10
{txt}{space 4}children {c |}{res}      1,220     1.59918    1.228256          0          7
{txt}{space 3}male_head {c |}{res}      1,216    .9070724    .2904504          0          1
{txt}{space 4}head_age {c |}{res}      1,216    41.14967    10.83945         21         82
{txt}{hline 13}{c +}{hline 57}
{space 1}head_noeduc {c |}{res}      1,216    .3700658    .4830207          0          1
{txt}
{com}. summarize spandana othermfi bank informal anyloan if treatment == 0

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}spandana {c |}{res}      1,213           0           0          0          0
{txt}{space 4}othermfi {c |}{res}      1,213    .0107172    .1030103          0          1
{txt}{space 8}bank {c |}{res}      1,213    .0362737    .1870475          0          1
{txt}{space 4}informal {c |}{res}      1,213    .6323166    .4823735          0          1
{txt}{space 5}anyloan {c |}{res}      1,213    .6801319    .4666176          0          1
{txt}
{com}. summarize spandana_amt othermfi_amt bank_amt informal_amt anyloan_amt if treatment == 0

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
spandana_amt {c |}{res}      1,213           0           0          0          0
{txt}othermfi_amt {c |}{res}      1,213    201.1542    2742.364          0      75000
{txt}{space 4}bank_amt {c |}{res}      1,213     7438.17    173268.3          0    6000000
{txt}informal_amt {c |}{res}      1,213    28460.02    65312.16          0     940000
{txt}{space 1}anyloan_amt {c |}{res}      1,213       37892    191291.6          0    6245000
{txt}
{com}. summarize total_biz female_biz female_biz_pct if treatment == 0

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 3}total_biz {c |}{res}      1,220    .3196721    .6822055          0          7
{txt}{space 2}female_biz {c |}{res}      1,220     .145082    .4002875          0          3
{txt}female_biz~t {c |}{res}        295    .4882809    .4823504          0          1
{txt}
{com}. summarize bizrev bizexpense bizinvestment bizemployees hours_weekbiz if treatment == 0          

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}bizrev {c |}{res}      1,220     3866.59    27146.79          0     753600
{txt}{space 2}bizexpense {c |}{res}      1,220    874.7031    12932.56          0   430571.4
{txt}bizinvestm~t {c |}{res}      1,220    93.02459    1559.052          0      48000
{txt}bizemployees {c |}{res}      1,220    .0409836     .413027          0          9
{txt}hours_week~z {c |}{res}      1,220    18.45328    46.05365          0        507
{txt}
{com}. summarize bizrev_allHH bizexpense_allHH bizinvestment_allHH bizemployees_allHH hours_weekbiz_allHH if treatment == 0

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
bizrev_allHH {c |}{res}        295    15990.64    53488.75          0     753600
{txt}bizexpense~H {c |}{res}        295    3617.416    26144.04          0   430571.4
{txt}bizinvestm~H {c |}{res}        295    384.7119    3156.815          0      48000
{txt}bizemploye~H {c |}{res}        295    .1694915    .8279255          0          9
{txt}hours_week~H {c |}{res}        295    76.31525    66.05444          0        507
{txt}
{com}. summarize total_exp_mo nondurable_exp_mo durables_exp_mo home_durable_index if treatment == 0

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
total_exp_mo {c |}{res}      1,220    4888.431    4074.372        800      50930
{txt}nondurable~o {c |}{res}      1,220    4734.685    3839.802        800      50930
{txt}durables_e~o {c |}{res}      1,220    153.7457    584.5941          0   7708.333
{txt}home_durab~x {c |}{res}      1,220    1.941369    .8290679   .2444602   4.681735
{txt}
{com}. 
. ***Table 1B: Endline summary statistics***
. ******************************************
. use "$datadir/2013-0533_data_endlines1and2.dta", clear
{txt}(Endline data for "The miracle of microfinance?" (Banerjee et al.), AEJ 2014)

{com}. 
. local hh_composition "hhsize adults children male_head head_age head_noeduc"
{txt}
{com}. local credit_access "spandana othermfi anybank anyinformal anyloan"
{txt}
{com}. local loan_amt "spandana_amt othermfi_amt bank_amt informal_amt anyloan_amt"
{txt}
{com}. local self_emp_activ "total_biz female_biz_allHH female_biz_pct"
{txt}
{com}. local businesses "bizrev bizexpense bizinvestment bizemployees hours_week_biz"
{txt}
{com}. local businesses_allHH "bizrev_allHH bizexpense_allHH bizinvestment_allHH bizemployees_allHH hours_week_biz_allHH"
{txt}
{com}. local consumption "total_exp_mo nondurable_exp_mo durables_exp_mo home_durable_index"
{txt}
{com}. 
. local allvars "`hh_composition' `credit_access' `loan_amt' `self_emp_activ' `businesses' `businesses_allHH' `consumption'"
{txt}
{com}. 
. 
. *1) Generate variables for business outcomes for all households (replacing each
. *       variable with missing for households without a business):
. forval i = 1/2 {c -(}
{txt}  2{com}.         foreach var in `businesses' female_biz {c -(}
{txt}  3{com}.                         gen `var'_allHH_`i'=`var'_`i'
{txt}  4{com}.                         replace `var'_`i'=. if total_biz_`i'==0
{txt}  5{com}.                         {c )-}
{txt}  6{com}.         {c )-}
{txt}(255 missing values generated)
(4,395 real changes made, 4,395 to missing)
(178 missing values generated)
(4,395 real changes made, 4,395 to missing)
(63 missing values generated)
(4,391 real changes made, 4,391 to missing)
(101 missing values generated)
(4,395 real changes made, 4,395 to missing)
(101 missing values generated)
(4,395 real changes made, 4,395 to missing)
(101 missing values generated)
(4,395 real changes made, 4,395 to missing)
(747 missing values generated)
(3,498 real changes made, 3,498 to missing)
(747 missing values generated)
(3,498 real changes made, 3,498 to missing)
(721 missing values generated)
(3,498 real changes made, 3,498 to missing)
(721 missing values generated)
(3,498 real changes made, 3,498 to missing)
(721 missing values generated)
(3,498 real changes made, 3,498 to missing)
(721 missing values generated)
(3,498 real changes made, 3,498 to missing)

{com}. 
. *2) Reshape to one observation per household per endline:
. foreach var in `allvars' {c -(}
{txt}  2{com}.         rename `var'_1 `var'1
{txt}  3{com}.         rename `var'_2 `var'2
{txt}  4{com}.         {c )-}
{res}{txt}
{com}. 
. reshape long `allvars', i(hhid) j(endline)
{txt}(j = 1 2)

Data{col 36}Wide{col 43}->{col 48}Long
{hline 77}
Number of observations     {res}       6,863   {txt}->   {res}13,726      
{txt}Number of variables        {res}         199   {txt}->   {res}167         
{txt}j variable (2 values)                     ->   {res}endline
{txt}xij variables:
                        {res}hhsize1 hhsize2   {txt}->   {res}hhsize
                        adults1 adults2   {txt}->   {res}adults
                    children1 children2   {txt}->   {res}children
                  male_head1 male_head2   {txt}->   {res}male_head
                    head_age1 head_age2   {txt}->   {res}head_age
              head_noeduc1 head_noeduc2   {txt}->   {res}head_noeduc
                    spandana1 spandana2   {txt}->   {res}spandana
                    othermfi1 othermfi2   {txt}->   {res}othermfi
                      anybank1 anybank2   {txt}->   {res}anybank
              anyinformal1 anyinformal2   {txt}->   {res}anyinformal
                      anyloan1 anyloan2   {txt}->   {res}anyloan
            spandana_amt1 spandana_amt2   {txt}->   {res}spandana_amt
            othermfi_amt1 othermfi_amt2   {txt}->   {res}othermfi_amt
                    bank_amt1 bank_amt2   {txt}->   {res}bank_amt
            informal_amt1 informal_amt2   {txt}->   {res}informal_amt
              anyloan_amt1 anyloan_amt2   {txt}->   {res}anyloan_amt
                  total_biz1 total_biz2   {txt}->   {res}total_biz
    female_biz_allHH1 female_biz_allHH2   {txt}->   {res}female_biz_allHH
        female_biz_pct1 female_biz_pct2   {txt}->   {res}female_biz_pct
                        bizrev1 bizrev2   {txt}->   {res}bizrev
                bizexpense1 bizexpense2   {txt}->   {res}bizexpense
          bizinvestment1 bizinvestment2   {txt}->   {res}bizinvestment
            bizemployees1 bizemployees2   {txt}->   {res}bizemployees
        hours_week_biz1 hours_week_biz2   {txt}->   {res}hours_week_biz
            bizrev_allHH1 bizrev_allHH2   {txt}->   {res}bizrev_allHH
    bizexpense_allHH1 bizexpense_allHH2   {txt}->   {res}bizexpense_allHH
bizinvestment_allHH1 bizinvestment_allHH2 {txt}->   {res}bizinvestment_allHH
bizemployees_allHH1 bizemployees_allHH2   {txt}->   {res}bizemployees_allHH
hours_week_biz_allHH1 hours_week_biz_allHH2{txt}->  {res}hours_week_biz_allHH
            total_exp_mo1 total_exp_mo2   {txt}->   {res}total_exp_mo
  nondurable_exp_mo1 nondurable_exp_mo2   {txt}->   {res}nondurable_exp_mo
      durables_exp_mo1 durables_exp_mo2   {txt}->   {res}durables_exp_mo
home_durable_index1 home_durable_index2   {txt}->   {res}home_durable_index
{txt}{hline 77}

{com}. keep hhid areaid endline treatment `allvars'
{txt}
{com}. tab endline, gen(endline)

    {txt}VarName {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}      6,863       50.00       50.00
{txt}          2 {c |}{res}      6,863       50.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     13,726      100.00
{txt}
{com}. 
. * Summary statistics for control group at EL1 and EL2
. 
. summarize hhsize adults children male_head head_age head_noeduc if treatment == 0 & endline ==1

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}hhsize {c |}{res}      3,264    5.645221    2.151706          1         22
{txt}{space 6}adults {c |}{res}      3,264    3.886642    1.754296          0         14
{txt}{space 4}children {c |}{res}      3,264    1.737745    1.309517          0         10
{txt}{space 3}male_head {c |}{res}      3,261    .8945109    .3072297          0          1
{txt}{space 4}head_age {c |}{res}      3,257    41.14891    10.22196          1         80
{txt}{hline 13}{c +}{hline 57}
{space 1}head_noeduc {c |}{res}      3,256    .3114251    .4631472          0          1
{txt}
{com}. summarize spandana othermfi anybank anyinformal anyloan if treatment == 0 & endline ==1

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}spandana {c |}{res}      3,247    .0505082    .2190248          0          1
{txt}{space 4}othermfi {c |}{res}      3,183    .1486019    .3557516          0          1
{txt}{space 5}anybank {c |}{res}      3,247      .07915    .2700143          0          1
{txt}{space 1}anyinformal {c |}{res}      3,247    .7610102    .4265322          0          1
{txt}{space 5}anyloan {c |}{res}      3,264    .8673407    .3392581          0          1
{txt}
{com}. summarize spandana_amt othermfi_amt bank_amt informal_amt anyloan_amt if treatment == 0 & endline ==1

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
spandana_amt {c |}{res}      3,247    597.4407    2907.486          0      40000
{txt}othermfi_amt {c |}{res}      3,200    1806.026    5917.835          0     180000
{txt}{space 4}bank_amt {c |}{res}      3,247    8422.431    101952.8          0    5000000
{txt}informal_amt {c |}{res}      3,247    41044.62    78032.52          0    1650000
{txt}{space 1}anyloan_amt {c |}{res}      3,264    59836.27    133692.6          0    5000000
{txt}
{com}. summarize total_biz female_biz_allHH female_biz_pct if treatment == 0 & endline ==1

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 3}total_biz {c |}{res}      3,236    .5027812    .8542963          0          9
{txt}female_biz~H {c |}{res}      3,209     .185416    .4869486          0          6
{txt}female_biz~t {c |}{res}      1,104    .3748699    .4517247          0          1
{txt}
{com}. summarize bizrev bizexpense bizinvestment bizemployees hours_week_biz if treatment == 0 & endline ==1

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}bizrev {c |}{res}      1,039    14700.01     56350.1          0    1100000
{txt}{space 2}bizexpense {c |}{res}      1,071    12030.02    51530.88          0    1202150
{txt}bizinvestm~t {c |}{res}      1,127    785.4942    6805.929          0     150000
{txt}bizemployees {c |}{res}      1,103    .3798731    1.643839          0         21
{txt}hours_week~z {c |}{res}      1,103    100.0281    69.86922          0        710
{txt}
{com}. summarize bizrev_allHH bizexpense_allHH bizinvestment_allHH bizemployees_allHH hours_week_biz_allHH if treatment == 0 & endline ==1

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
bizrev_allHH {c |}{res}      3,145     4856.38    33108.37          0    1100000
{txt}bizexpense~H {c |}{res}      3,177    4055.446    30446.18          0    1202150
{txt}bizinvestm~H {c |}{res}      3,231    280.0687     4038.04          0     150000
{txt}bizemploye~H {c |}{res}      3,209    .1305703    .9802112          0         21
{txt}hours_week~H {c |}{res}      3,209    34.38174    62.72707          0        710
{txt}
{com}. summarize total_exp_mo nondurable_exp_mo durables_exp_mo home_durable_index if treatment == 0 & endline ==1

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
total_exp_mo {c |}{res}      3,248    6375.239     4906.49          0    70997.5
{txt}nondurable~o {c |}{res}      3,230    5831.308    4212.457          0   70760.01
{txt}durables_e~o {c |}{res}      3,230    550.7856    1623.457          0      39250
{txt}home_durab~x {c |}{res}      3,254    2.371234    .8612298   .0961227   4.853008
{txt}
{com}. 
. summarize hhsize adults children male_head head_age head_noeduc if treatment == 0 & endline ==2

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}hhsize {c |}{res}      2,943    6.269113      2.5479          1         27
{txt}{space 6}adults {c |}{res}      2,943    4.038736    1.848216          1         14
{txt}{space 4}children {c |}{res}      2,943    1.763846    1.321124          0         14
{txt}{space 3}male_head {c |}{res}      2,938     .811096     .391499          0          1
{txt}{space 4}head_age {c |}{res}      2,940    42.25782    10.15364         20         89
{txt}{hline 13}{c +}{hline 57}
{space 1}head_noeduc {c |}{res}      2,940    .2918367    .4546849          0          1
{txt}
{com}. summarize spandana othermfi anybank anyinformal anyloan if treatment == 0 & endline ==2

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}spandana {c |}{res}      2,943    .1114509    .3147432          0          1
{txt}{space 4}othermfi {c |}{res}      2,943    .2684336    .4432197          0          1
{txt}{space 5}anybank {c |}{res}      2,943    .0730547    .2602705          0          1
{txt}{space 1}anyinformal {c |}{res}      2,943    .6034659    .4892608          0          1
{txt}{space 5}anyloan {c |}{res}      2,943    .9041794    .2943951          0          1
{txt}
{com}. summarize spandana_amt othermfi_amt bank_amt informal_amt anyloan_amt if treatment == 0 & endline ==2

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
spandana_amt {c |}{res}      2,943     1566.64    5618.335          0   133276.6
{txt}othermfi_amt {c |}{res}      2,943    4775.059     10735.6          0     164000
{txt}{space 4}bank_amt {c |}{res}      2,943    6126.523    40307.63          0   832978.9
{txt}informal_amt {c |}{res}      2,943    32355.99    76704.16          0    1266128
{txt}{space 1}anyloan_amt {c |}{res}      2,943    88631.46    144634.3          0    2520000
{txt}
{com}. summarize total_biz female_biz_allHH female_biz_pct if treatment == 0 & endline ==2

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 3}total_biz {c |}{res}      2,943    .5609922    .7871335          0          7
{txt}female_biz~H {c |}{res}      2,943    .2344546    .5195781          0          5
{txt}female_biz~t {c |}{res}      1,231    .4027233    .4540111          0          1
{txt}
{com}. summarize bizrev bizexpense bizinvestment bizemployees hours_week_biz if treatment == 0 & endline ==2

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}bizrev {c |}{res}      1,218    14065.57    23712.69          0   170094.3
{txt}{space 2}bizexpense {c |}{res}      1,218    12568.39    30483.26          0   299372.6
{txt}bizinvestm~t {c |}{res}      1,231    2331.052    14645.24          0   366510.7
{txt}bizemployees {c |}{res}      1,231    .5645816    2.937647          0         44
{txt}hours_week~z {c |}{res}      1,231    88.46791    60.15515          0        368
{txt}
{com}. summarize bizrev_allHH bizexpense_allHH bizinvestment_allHH bizemployees_allHH hours_week_biz_allHH if treatment == 0 & endline ==2

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
bizrev_allHH {c |}{res}      2,930    5847.052       16784          0   170094.3
{txt}bizexpense~H {c |}{res}      2,930    5224.676    20602.83          0   299372.6
{txt}bizinvestm~H {c |}{res}      2,943    1007.315    9622.571          0   366510.7
{txt}bizemploye~H {c |}{res}      2,943    .2361536    1.919777          0         44
{txt}hours_week~H {c |}{res}      2,943    37.00442    58.46295          0        368
{txt}
{com}. summarize total_exp_mo nondurable_exp_mo durables_exp_mo home_durable_index if treatment == 0 & endline ==2

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
total_exp_mo {c |}{res}      2,943    8787.071    6547.073          0   109455.9
{txt}nondurable~o {c |}{res}      2,943    8050.456    5779.852          0   83633.59
{txt}durables_e~o {c |}{res}      2,941    719.8915    1536.462          0   25822.35
{txt}home_durab~x {c |}{res}      2,943    2.662229    .8278294          0   4.665898
{txt}
{com}. 
. 
. 
. ***Table 2: Credit***
. *********************
. use "$datadir/2013-0533_data_endlines1and2.dta", clear
{txt}(Endline data for "The miracle of microfinance?" (Banerjee et al.), AEJ 2014)

{com}. 
. ***PANEL A: ENDLINE 1***
. est clear
{txt}
{com}. 
. *Loop through each variable, run regressions, and save key results
. foreach var in spandana_1 othermfi_1 anymfi_1 anybank_1 anyinformal_1  anyloan_1 everlate_1 mfi_loan_cycles_1 ///
>                            spandana_amt_1 othermfi_amt_1 anymfi_amt_1 bank_amt_1 informal_amt_1 anyloan_amt_1 credit_index_1 {c -(}
{txt}  2{com}.     * Run regression with treatment and area controls, weighted by w1
.     reg `var' treatment $area_controls [pweight=w1], cluster(areaid)
{txt}  3{com}.     
.     * p-value for treatment coefficients
.     scalar pval = 2 * ttail(e(df_r), abs(_b[treatment] / _se[treatment]))
{txt}  4{com}.     
.     * Summarize the variable for the control group at endline 1
.     sum `var' if treatment == 0 & e(sample)
{txt}  5{com}.     scalar mean_control = r(mean)
{txt}  6{com}.     scalar sd_control = r(sd)
{txt}  7{com}.     
.     est store `var'
{txt}  8{com}. {c )-}
{txt}(sum of wgt is 6,651.52161359787)

Linear regression                               Number of obs     = {res}     6,811
                                                {txt}F(7, 103)         =  {res}    10.05
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0520
                                                {txt}Root MSE          =    {res} .30636

{txt}{ralign 90:(Std. err. adjusted for {res:104} clusters in {res:areaid})}
{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}              spandana_1{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2} .1273842{col 38}{space 2} .0196742{col 49}{space 1}    6.47{col 58}{space 3}0.000{col 66}{space 4}  .088365{col 79}{space 3} .1664034
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2}-.0000527{col 38}{space 2} .0000675{col 49}{space 1}   -0.78{col 58}{space 3}0.436{col 66}{space 4}-.0001866{col 79}{space 3} .0000811
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} 1.20e-06{col 38}{space 2} 4.47e-07{col 49}{space 1}    2.68{col 58}{space 3}0.009{col 66}{space 4} 3.10e-07{col 79}{space 3} 2.08e-06
{txt}area_business_total_base {c |}{col 26}{res}{space 2}-.0018504{col 38}{space 2} .0018455{col 49}{space 1}   -1.00{col 58}{space 3}0.318{col 66}{space 4}-.0055105{col 79}{space 3} .0018098
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2}-1.06e-06{col 38}{space 2} .0000597{col 49}{space 1}   -0.02{col 58}{space 3}0.986{col 66}{space 4}-.0001194{col 79}{space 3} .0001173
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2}-.0798948{col 38}{space 2} .1303832{col 49}{space 1}   -0.61{col 58}{space 3}0.541{col 66}{space 4}-.3384791{col 79}{space 3} .1786895
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2} .0778548{col 38}{space 2} .1920314{col 49}{space 1}    0.41{col 58}{space 3}0.686{col 66}{space 4}-.3029942{col 79}{space 3} .4587038
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} .0319041{col 38}{space 2} .0811441{col 49}{space 1}    0.39{col 58}{space 3}0.695{col 66}{space 4}-.1290261{col 79}{space 3} .1928344
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 2}spandana_1 {c |}{res}      3,247    .0505082    .2190248          0          1
{txt}(sum of wgt is 6,497.52161359787)

Linear regression                               Number of obs     = {res}     6,657
                                                {txt}F(7, 103)         =  {res}     1.95
                                                {txt}Prob > F          = {res}    0.0689
                                                {txt}R-squared         = {res}    0.0135
                                                {txt}Root MSE          =    {res} .34328

{txt}{ralign 90:(Std. err. adjusted for {res:104} clusters in {res:areaid})}
{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}              othermfi_1{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2}-.0116026{col 38}{space 2}  .023774{col 49}{space 1}   -0.49{col 58}{space 3}0.627{col 66}{space 4}-.0587527{col 79}{space 3} .0355475
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2} .0001852{col 38}{space 2} .0000805{col 49}{space 1}    2.30{col 58}{space 3}0.023{col 66}{space 4} .0000257{col 79}{space 3} .0003448
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} 8.75e-08{col 38}{space 2} 2.54e-07{col 49}{space 1}    0.35{col 58}{space 3}0.731{col 66}{space 4}-4.15e-07{col 79}{space 3} 5.91e-07
{txt}area_business_total_base {c |}{col 26}{res}{space 2} .0003109{col 38}{space 2} .0027752{col 49}{space 1}    0.11{col 58}{space 3}0.911{col 66}{space 4} -.005193{col 79}{space 3} .0058148
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2}-.0001014{col 38}{space 2} .0000549{col 49}{space 1}   -1.85{col 58}{space 3}0.068{col 66}{space 4}-.0002103{col 79}{space 3} 7.52e-06
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2}-.1953897{col 38}{space 2} .1168968{col 49}{space 1}   -1.67{col 58}{space 3}0.098{col 66}{space 4} -.427227{col 79}{space 3} .0364476
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2} .3031144{col 38}{space 2} .1917433{col 49}{space 1}    1.58{col 58}{space 3}0.117{col 66}{space 4}-.0771633{col 79}{space 3} .6833922
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} .0968452{col 38}{space 2} .1107772{col 49}{space 1}    0.87{col 58}{space 3}0.384{col 66}{space 4}-.1228552{col 79}{space 3} .3165457
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 2}othermfi_1 {c |}{res}      3,183    .1486019    .3557516          0          1
{txt}(sum of wgt is 6,651.52161359787)

Linear regression                               Number of obs     = {res}     6,811
                                                {txt}F(7, 103)         =  {res}     3.79
                                                {txt}Prob > F          = {res}    0.0011
                                                {txt}R-squared         = {res}    0.0191
                                                {txt}Root MSE          =    {res} .40992

{txt}{ralign 90:(Std. err. adjusted for {res:104} clusters in {res:areaid})}
{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}                anymfi_1{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2} .0834639{col 38}{space 2} .0270493{col 49}{space 1}    3.09{col 58}{space 3}0.003{col 66}{space 4}  .029818{col 79}{space 3} .1371098
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2}  .000126{col 38}{space 2} .0000901{col 49}{space 1}    1.40{col 58}{space 3}0.165{col 66}{space 4}-.0000526{col 79}{space 3} .0003046
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} 9.82e-07{col 38}{space 2} 3.78e-07{col 49}{space 1}    2.60{col 58}{space 3}0.011{col 66}{space 4} 2.32e-07{col 79}{space 3} 1.73e-06
{txt}area_business_total_base {c |}{col 26}{res}{space 2}-.0015741{col 38}{space 2} .0030942{col 49}{space 1}   -0.51{col 58}{space 3}0.612{col 66}{space 4}-.0077107{col 79}{space 3} .0045624
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2}-.0000702{col 38}{space 2} .0000744{col 49}{space 1}   -0.94{col 58}{space 3}0.348{col 66}{space 4}-.0002178{col 79}{space 3} .0000775
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2}-.2628159{col 38}{space 2} .1610595{col 49}{space 1}   -1.63{col 58}{space 3}0.106{col 66}{space 4}-.5822395{col 79}{space 3} .0566077
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2} .3226162{col 38}{space 2} .2346023{col 49}{space 1}    1.38{col 58}{space 3}0.172{col 66}{space 4}-.1426621{col 79}{space 3} .7878946
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} .1272933{col 38}{space 2} .1231053{col 49}{space 1}    1.03{col 58}{space 3}0.304{col 66}{space 4}-.1168571{col 79}{space 3} .3714436
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}anymfi_1 {c |}{res}      3,247    .1832461    .3869277          0          1
{txt}(sum of wgt is 6,651.52161359787)

Linear regression                               Number of obs     = {res}     6,811
                                                {txt}F(7, 103)         =  {res}     0.94
                                                {txt}Prob > F          = {res}    0.4783
                                                {txt}R-squared         = {res}    0.0026
                                                {txt}Root MSE          =    {res} .27343

{txt}{ralign 90:(Std. err. adjusted for {res:104} clusters in {res:areaid})}
{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}               anybank_1{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2}  .002774{col 38}{space 2} .0116181{col 49}{space 1}    0.24{col 58}{space 3}0.812{col 66}{space 4}-.0202678{col 79}{space 3} .0258159
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2}-.0000259{col 38}{space 2} .0000335{col 49}{space 1}   -0.77{col 58}{space 3}0.440{col 66}{space 4}-.0000923{col 79}{space 3} .0000405
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} 1.23e-08{col 38}{space 2} 1.07e-07{col 49}{space 1}    0.12{col 58}{space 3}0.908{col 66}{space 4}-1.99e-07{col 79}{space 3} 2.24e-07
{txt}area_business_total_base {c |}{col 26}{res}{space 2}-.0014119{col 38}{space 2} .0013544{col 49}{space 1}   -1.04{col 58}{space 3}0.300{col 66}{space 4}-.0040981{col 79}{space 3} .0012743
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2} .0000198{col 38}{space 2} .0000358{col 49}{space 1}    0.55{col 58}{space 3}0.582{col 66}{space 4}-.0000512{col 79}{space 3} .0000907
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2}-.0171095{col 38}{space 2} .0458477{col 49}{space 1}   -0.37{col 58}{space 3}0.710{col 66}{space 4}-.1080375{col 79}{space 3} .0738185
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2} .1565103{col 38}{space 2} .0908084{col 49}{space 1}    1.72{col 58}{space 3}0.088{col 66}{space 4}-.0235867{col 79}{space 3} .3366074
{txt}{space 19}_cons {c |}{col 26}{res}{space 2}-.0179807{col 38}{space 2} .0639831{col 49}{space 1}   -0.28{col 58}{space 3}0.779{col 66}{space 4}-.1448761{col 79}{space 3} .1089147
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 3}anybank_1 {c |}{res}      3,247      .07915    .2700143          0          1
{txt}(sum of wgt is 6,651.52161359787)

Linear regression                               Number of obs     = {res}     6,811
                                                {txt}F(7, 103)         =  {res}     3.96
                                                {txt}Prob > F          = {res}    0.0007
                                                {txt}R-squared         = {res}    0.0104
                                                {txt}Root MSE          =    {res} .43992

{txt}{ralign 90:(Std. err. adjusted for {res:104} clusters in {res:areaid})}
{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}           anyinformal_1{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2}-.0516701{col 38}{space 2} .0212397{col 49}{space 1}   -2.43{col 58}{space 3}0.017{col 66}{space 4}-.0937941{col 79}{space 3} -.009546
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2}-.0000405{col 38}{space 2} .0000657{col 49}{space 1}   -0.62{col 58}{space 3}0.539{col 66}{space 4}-.0001709{col 79}{space 3} .0000899
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} 1.06e-07{col 38}{space 2} 3.27e-07{col 49}{space 1}    0.32{col 58}{space 3}0.747{col 66}{space 4}-5.43e-07{col 79}{space 3} 7.55e-07
{txt}area_business_total_base {c |}{col 26}{res}{space 2}-.0031273{col 38}{space 2} .0023593{col 49}{space 1}   -1.33{col 58}{space 3}0.188{col 66}{space 4}-.0078065{col 79}{space 3} .0015518
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2}-.0000934{col 38}{space 2} .0000636{col 49}{space 1}   -1.47{col 58}{space 3}0.145{col 66}{space 4}-.0002195{col 79}{space 3} .0000327
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2}-.0639339{col 38}{space 2} .1143143{col 49}{space 1}   -0.56{col 58}{space 3}0.577{col 66}{space 4}-.2906494{col 79}{space 3} .1627815
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2}-.1800813{col 38}{space 2} .1936961{col 49}{space 1}   -0.93{col 58}{space 3}0.355{col 66}{space 4}-.5642319{col 79}{space 3} .2040693
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} 1.046398{col 38}{space 2} .1058667{col 49}{space 1}    9.88{col 58}{space 3}0.000{col 66}{space 4} .8364361{col 79}{space 3} 1.256359
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
anyinforma~1 {c |}{res}      3,247    .7610102    .4265322          0          1
{txt}(sum of wgt is 6,702.52161359787)

Linear regression                               Number of obs     = {res}     6,862
                                                {txt}F(7, 103)         =  {res}     4.22
                                                {txt}Prob > F          = {res}    0.0004
                                                {txt}R-squared         = {res}    0.0074
                                                {txt}Root MSE          =    {res} .35167

{txt}{ralign 90:(Std. err. adjusted for {res:104} clusters in {res:areaid})}
{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}               anyloan_1{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2}-.0224983{col 38}{space 2} .0137725{col 49}{space 1}   -1.63{col 58}{space 3}0.105{col 66}{space 4}-.0498128{col 79}{space 3} .0048162
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2}-.0000123{col 38}{space 2} .0000463{col 49}{space 1}   -0.27{col 58}{space 3}0.791{col 66}{space 4}-.0001041{col 79}{space 3} .0000795
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} 1.63e-07{col 38}{space 2} 1.67e-07{col 49}{space 1}    0.97{col 58}{space 3}0.333{col 66}{space 4}-1.69e-07{col 79}{space 3} 4.94e-07
{txt}area_business_total_base {c |}{col 26}{res}{space 2}-.0020494{col 38}{space 2} .0015271{col 49}{space 1}   -1.34{col 58}{space 3}0.183{col 66}{space 4} -.005078{col 79}{space 3} .0009792
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2}-.0000648{col 38}{space 2} .0000469{col 49}{space 1}   -1.38{col 58}{space 3}0.170{col 66}{space 4}-.0001578{col 79}{space 3} .0000282
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2}-.1272992{col 38}{space 2} .0592794{col 49}{space 1}   -2.15{col 58}{space 3}0.034{col 66}{space 4}-.2448658{col 79}{space 3}-.0097326
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2}-.0116331{col 38}{space 2} .1115618{col 49}{space 1}   -0.10{col 58}{space 3}0.917{col 66}{space 4}-.2328895{col 79}{space 3} .2096233
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} 1.029561{col 38}{space 2} .0760056{col 49}{space 1}   13.55{col 58}{space 3}0.000{col 66}{space 4} .8788214{col 79}{space 3}   1.1803
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 3}anyloan_1 {c |}{res}      3,264    .8673407    .3392581          0          1
{txt}(sum of wgt is 6,317.21992182732)

Linear regression                               Number of obs     = {res}     6,475
                                                {txt}F(7, 103)         =  {res}     3.05
                                                {txt}Prob > F          = {res}    0.0059
                                                {txt}R-squared         = {res}    0.0147
                                                {txt}Root MSE          =    {res}  .4894

{txt}{ralign 90:(Std. err. adjusted for {res:104} clusters in {res:areaid})}
{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}              everlate_1{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2}-.0595832{col 38}{space 2} .0263874{col 49}{space 1}   -2.26{col 58}{space 3}0.026{col 66}{space 4}-.1119164{col 79}{space 3}  -.00725
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2} 1.35e-06{col 38}{space 2} .0000867{col 49}{space 1}    0.02{col 58}{space 3}0.988{col 66}{space 4}-.0001706{col 79}{space 3} .0001733
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2}-4.37e-07{col 38}{space 2} 4.92e-07{col 49}{space 1}   -0.89{col 58}{space 3}0.376{col 66}{space 4}-1.41e-06{col 79}{space 3} 5.38e-07
{txt}area_business_total_base {c |}{col 26}{res}{space 2}-.0026021{col 38}{space 2} .0026353{col 49}{space 1}   -0.99{col 58}{space 3}0.326{col 66}{space 4}-.0078285{col 79}{space 3} .0026244
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2}-.0000777{col 38}{space 2} .0000741{col 49}{space 1}   -1.05{col 58}{space 3}0.297{col 66}{space 4}-.0002248{col 79}{space 3} .0000693
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2}-.3281581{col 38}{space 2} .1532018{col 49}{space 1}   -2.14{col 58}{space 3}0.035{col 66}{space 4}-.6319977{col 79}{space 3}-.0243184
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2} .0691651{col 38}{space 2} .2457151{col 49}{space 1}    0.28{col 58}{space 3}0.779{col 66}{space 4}-.4181528{col 79}{space 3}  .556483
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} .8804347{col 38}{space 2} .1365228{col 49}{space 1}    6.45{col 58}{space 3}0.000{col 66}{space 4} .6096739{col 79}{space 3} 1.151196
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 2}everlate_1 {c |}{res}      3,108    .6158301    .4864766          0          1
{txt}(sum of wgt is 6,656.52161359787)

Linear regression                               Number of obs     = {res}     6,816
                                                {txt}F(7, 103)         =  {res}     2.50
                                                {txt}Prob > F          = {res}    0.0206
                                                {txt}R-squared         = {res}    0.0107
                                                {txt}Root MSE          =    {res} .66533

{txt}{ralign 90:(Std. err. adjusted for {res:104} clusters in {res:areaid})}
{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}       mfi_loan_cycles_1{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2} .0839298{col 38}{space 2}  .041089{col 49}{space 1}    2.04{col 58}{space 3}0.044{col 66}{space 4} .0024395{col 79}{space 3} .1654201
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2} .0001495{col 38}{space 2} .0001358{col 49}{space 1}    1.10{col 58}{space 3}0.274{col 66}{space 4}-.0001199{col 79}{space 3} .0004188
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} 1.23e-06{col 38}{space 2} 5.45e-07{col 49}{space 1}    2.25{col 58}{space 3}0.026{col 66}{space 4} 1.48e-07{col 79}{space 3} 2.31e-06
{txt}area_business_total_base {c |}{col 26}{res}{space 2} -.007362{col 38}{space 2} .0039787{col 49}{space 1}   -1.85{col 58}{space 3}0.067{col 66}{space 4}-.0152528{col 79}{space 3} .0005287
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2} -.000011{col 38}{space 2} .0001131{col 49}{space 1}   -0.10{col 58}{space 3}0.922{col 66}{space 4}-.0002353{col 79}{space 3} .0002132
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2}-.1820663{col 38}{space 2} .2340629{col 49}{space 1}   -0.78{col 58}{space 3}0.438{col 66}{space 4}-.6462748{col 79}{space 3} .2821423
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2} .1651509{col 38}{space 2} .3568251{col 49}{space 1}    0.46{col 58}{space 3}0.644{col 66}{space 4}-.5425275{col 79}{space 3} .8728293
{txt}{space 19}_cons {c |}{col 26}{res}{space 2}  .300197{col 38}{space 2} .2067829{col 49}{space 1}    1.45{col 58}{space 3}0.150{col 66}{space 4}-.1099081{col 79}{space 3} .7103021
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
mfi_loan_c~1 {c |}{res}      3,250    .3298462    .6930169          0          8
{txt}(sum of wgt is 6,651.52161359787)

Linear regression                               Number of obs     = {res}     6,811
                                                {txt}F(7, 103)         =  {res}    10.20
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0363
                                                {txt}Root MSE          =    {res} 4061.9

{txt}{ralign 90:(Std. err. adjusted for {res:104} clusters in {res:areaid})}
{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}          spandana_amt_1{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2} 1333.772{col 38}{space 2} 229.6813{col 49}{space 1}    5.81{col 58}{space 3}0.000{col 66}{space 4} 878.2533{col 79}{space 3} 1789.291
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2}-.3167799{col 38}{space 2} .8443271{col 49}{space 1}   -0.38{col 58}{space 3}0.708{col 66}{space 4}-1.991304{col 79}{space 3} 1.357744
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} .0150007{col 38}{space 2} .0052381{col 49}{space 1}    2.86{col 58}{space 3}0.005{col 66}{space 4} .0046121{col 79}{space 3} .0253892
{txt}area_business_total_base {c |}{col 26}{res}{space 2}-24.36998{col 38}{space 2} 21.43286{col 49}{space 1}   -1.14{col 58}{space 3}0.258{col 66}{space 4}-66.87701{col 79}{space 3} 18.13704
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2} .3092694{col 38}{space 2} .6532867{col 49}{space 1}    0.47{col 58}{space 3}0.637{col 66}{space 4}-.9863707{col 79}{space 3} 1.604909
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2}-459.6969{col 38}{space 2} 1410.211{col 49}{space 1}   -0.33{col 58}{space 3}0.745{col 66}{space 4}-3256.518{col 79}{space 3} 2337.124
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2} -176.225{col 38}{space 2} 2037.792{col 49}{space 1}   -0.09{col 58}{space 3}0.931{col 66}{space 4}-4217.706{col 79}{space 3} 3865.256
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} 401.1612{col 38}{space 2} 853.5648{col 49}{space 1}    0.47{col 58}{space 3}0.639{col 66}{space 4}-1291.683{col 79}{space 3} 2094.006
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
spandana_a~1 {c |}{res}      3,247    597.4407    2907.486          0      40000
{txt}(sum of wgt is 6,548.52161359787)

Linear regression                               Number of obs     = {res}     6,708
                                                {txt}F(7, 103)         =  {res}     2.02
                                                {txt}Prob > F          = {res}    0.0591
                                                {txt}R-squared         = {res}    0.0116
                                                {txt}Root MSE          =    {res} 5468.6

{txt}{ralign 90:(Std. err. adjusted for {res:104} clusters in {res:areaid})}
{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}          othermfi_amt_1{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2}-93.66762{col 38}{space 2} 336.2978{col 49}{space 1}   -0.28{col 58}{space 3}0.781{col 66}{space 4}-760.6349{col 79}{space 3} 573.2997
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2} 2.861135{col 38}{space 2} 1.117562{col 49}{space 1}    2.56{col 58}{space 3}0.012{col 66}{space 4} .6447146{col 79}{space 3} 5.077556
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} .0015188{col 38}{space 2}  .003489{col 49}{space 1}    0.44{col 58}{space 3}0.664{col 66}{space 4}-.0054007{col 79}{space 3} .0084383
{txt}area_business_total_base {c |}{col 26}{res}{space 2}-7.112855{col 38}{space 2} 34.67878{col 49}{space 1}   -0.21{col 58}{space 3}0.838{col 66}{space 4}-75.89003{col 79}{space 3} 61.66432
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2}-1.429049{col 38}{space 2} .6982864{col 49}{space 1}   -2.05{col 58}{space 3}0.043{col 66}{space 4}-2.813935{col 79}{space 3}-.0441621
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2}-2721.199{col 38}{space 2}  1641.14{col 49}{space 1}   -1.66{col 58}{space 3}0.100{col 66}{space 4}-5976.013{col 79}{space 3}  533.615
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2} 4450.352{col 38}{space 2} 2591.525{col 49}{space 1}    1.72{col 58}{space 3}0.089{col 66}{space 4}-689.3259{col 79}{space 3} 9590.031
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} 931.8013{col 38}{space 2} 1420.035{col 49}{space 1}    0.66{col 58}{space 3}0.513{col 66}{space 4}-1884.503{col 79}{space 3} 3748.105
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
othermfi_a~1 {c |}{res}      3,200    1806.026    5917.835          0     180000
{txt}(sum of wgt is 6,651.52161359787)

Linear regression                               Number of obs     = {res}     6,811
                                                {txt}F(7, 103)         =  {res}     3.86
                                                {txt}Prob > F          = {res}    0.0009
                                                {txt}R-squared         = {res}    0.0148
                                                {txt}Root MSE          =    {res} 7074.7

{txt}{ralign 90:(Std. err. adjusted for {res:104} clusters in {res:areaid})}
{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}            anymfi_amt_1{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2} 1285.694{col 38}{space 2} 439.4331{col 49}{space 1}    2.93{col 58}{space 3}0.004{col 66}{space 4} 414.1822{col 79}{space 3} 2157.206
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2} 2.625806{col 38}{space 2} 1.408829{col 49}{space 1}    1.86{col 58}{space 3}0.065{col 66}{space 4} -.168275{col 79}{space 3} 5.419886
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} .0158783{col 38}{space 2} .0058157{col 49}{space 1}    2.73{col 58}{space 3}0.007{col 66}{space 4} .0043442{col 79}{space 3} .0274125
{txt}area_business_total_base {c |}{col 26}{res}{space 2} -24.2327{col 38}{space 2} 46.49611{col 49}{space 1}   -0.52{col 58}{space 3}0.603{col 66}{space 4}-116.4468{col 79}{space 3} 67.98137
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2}-1.097347{col 38}{space 2} 1.105728{col 49}{space 1}   -0.99{col 58}{space 3}0.323{col 66}{space 4}-3.290298{col 79}{space 3} 1.095604
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2}-2687.242{col 38}{space 2} 2302.225{col 49}{space 1}   -1.17{col 58}{space 3}0.246{col 66}{space 4}-7253.163{col 79}{space 3} 1878.679
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2} 4059.763{col 38}{space 2} 3465.587{col 49}{space 1}    1.17{col 58}{space 3}0.244{col 66}{space 4}-2813.411{col 79}{space 3} 10932.94
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} 1070.767{col 38}{space 2} 1770.097{col 49}{space 1}    0.60{col 58}{space 3}0.547{col 66}{space 4}-2439.802{col 79}{space 3} 4581.336
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
anymfi_amt_1 {c |}{res}      3,247    2373.776    6651.525          0     185000
{txt}(sum of wgt is 6,651.52161359787)

Linear regression                               Number of obs     = {res}     6,811
                                                {txt}F(7, 103)         =  {res}     2.40
                                                {txt}Prob > F          = {res}    0.0256
                                                {txt}R-squared         = {res}    0.0024
                                                {txt}Root MSE          =    {res}  83949

{txt}{ralign 90:(Std. err. adjusted for {res:104} clusters in {res:areaid})}
{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}              bank_amt_1{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2} 74.95723{col 38}{space 2} 2163.016{col 49}{space 1}    0.03{col 58}{space 3}0.972{col 66}{space 4}-4214.874{col 79}{space 3} 4364.789
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2}-11.35806{col 38}{space 2} 6.082803{col 49}{space 1}   -1.87{col 58}{space 3}0.065{col 66}{space 4}-23.42186{col 79}{space 3}  .705746
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2}-.0312921{col 38}{space 2} .0270697{col 49}{space 1}   -1.16{col 58}{space 3}0.250{col 66}{space 4}-.0849785{col 79}{space 3} .0223943
{txt}area_business_total_base {c |}{col 26}{res}{space 2} -51.1939{col 38}{space 2} 451.7188{col 49}{space 1}   -0.11{col 58}{space 3}0.910{col 66}{space 4}-947.0717{col 79}{space 3} 844.6839
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2}  14.0207{col 38}{space 2} 4.658155{col 49}{space 1}    3.01{col 58}{space 3}0.003{col 66}{space 4} 4.782351{col 79}{space 3} 23.25905
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2}-6207.828{col 38}{space 2} 6973.723{col 49}{space 1}   -0.89{col 58}{space 3}0.375{col 66}{space 4}-20038.56{col 79}{space 3} 7622.907
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2} 35656.94{col 38}{space 2} 15677.52{col 49}{space 1}    2.27{col 58}{space 3}0.025{col 66}{space 4}  4564.27{col 79}{space 3}  66749.6
{txt}{space 19}_cons {c |}{col 26}{res}{space 2}-20667.03{col 38}{space 2} 9373.889{col 49}{space 1}   -2.20{col 58}{space 3}0.030{col 66}{space 4}-39257.93{col 79}{space 3}-2076.132
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 2}bank_amt_1 {c |}{res}      3,247    8422.431    101952.8          0    5000000
{txt}(sum of wgt is 6,651.52161359787)

Linear regression                               Number of obs     = {res}     6,811
                                                {txt}F(7, 103)         =  {res}     2.56
                                                {txt}Prob > F          = {res}    0.0180
                                                {txt}R-squared         = {res}    0.0047
                                                {txt}Root MSE          =    {res}  86803

{txt}{ralign 90:(Std. err. adjusted for {res:104} clusters in {res:areaid})}
{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}          informal_amt_1{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2}-1068.984{col 38}{space 2} 2519.661{col 49}{space 1}   -0.42{col 58}{space 3}0.672{col 66}{space 4}-6066.137{col 79}{space 3} 3928.169
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2}-7.218501{col 38}{space 2} 8.614639{col 49}{space 1}   -0.84{col 58}{space 3}0.404{col 66}{space 4}-24.30361{col 79}{space 3} 9.866604
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} .0997099{col 38}{space 2} .0425982{col 49}{space 1}    2.34{col 58}{space 3}0.021{col 66}{space 4} .0152263{col 79}{space 3} .1841934
{txt}area_business_total_base {c |}{col 26}{res}{space 2}-782.0146{col 38}{space 2} 298.2712{col 49}{space 1}   -2.62{col 58}{space 3}0.010{col 66}{space 4}-1373.565{col 79}{space 3}-190.4641
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2} 20.80953{col 38}{space 2} 11.53355{col 49}{space 1}    1.80{col 58}{space 3}0.074{col 66}{space 4}-2.064556{col 79}{space 3} 43.68361
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2}-15584.54{col 38}{space 2} 13462.71{col 49}{space 1}   -1.16{col 58}{space 3}0.250{col 66}{space 4}-42284.64{col 79}{space 3} 11115.57
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2} 7713.198{col 38}{space 2} 20568.85{col 49}{space 1}    0.37{col 58}{space 3}0.708{col 66}{space 4}-33080.27{col 79}{space 3} 48506.67
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} 29371.25{col 38}{space 2} 14122.57{col 49}{space 1}    2.08{col 58}{space 3}0.040{col 66}{space 4} 1362.464{col 79}{space 3} 57380.03
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
informal_a~1 {c |}{res}      3,247    41044.62    78032.52          0    1650000
{txt}(sum of wgt is 6,702.52161359787)

Linear regression                               Number of obs     = {res}     6,862
                                                {txt}F(7, 103)         =  {res}     2.91
                                                {txt}Prob > F          = {res}    0.0081
                                                {txt}R-squared         = {res}    0.0034
                                                {txt}Root MSE          =    {res} 1.7e+05

{txt}{ralign 90:(Std. err. adjusted for {res:104} clusters in {res:areaid})}
{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}           anyloan_amt_1{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2} 2856.236{col 38}{space 2} 4548.265{col 49}{space 1}    0.63{col 58}{space 3}0.531{col 66}{space 4}-6164.174{col 79}{space 3} 11876.65
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2}-22.75524{col 38}{space 2} 12.01458{col 49}{space 1}   -1.89{col 58}{space 3}0.061{col 66}{space 4}-46.58332{col 79}{space 3} 1.072849
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} .1295937{col 38}{space 2} .0791755{col 49}{space 1}    1.64{col 58}{space 3}0.105{col 66}{space 4}-.0274322{col 79}{space 3} .2866196
{txt}area_business_total_base {c |}{col 26}{res}{space 2}-1148.216{col 38}{space 2} 543.7366{col 49}{space 1}   -2.11{col 58}{space 3}0.037{col 66}{space 4}-2226.589{col 79}{space 3}-69.84305
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2} 39.91257{col 38}{space 2} 17.48976{col 49}{space 1}    2.28{col 58}{space 3}0.025{col 66}{space 4} 5.225748{col 79}{space 3} 74.59938
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2}-21983.32{col 38}{space 2} 21806.08{col 49}{space 1}   -1.01{col 58}{space 3}0.316{col 66}{space 4}-65230.55{col 79}{space 3}  21263.9
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2} 33871.93{col 38}{space 2} 38728.21{col 49}{space 1}    0.87{col 58}{space 3}0.384{col 66}{space 4}-42936.33{col 79}{space 3} 110680.2
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} 22063.04{col 38}{space 2} 19791.41{col 49}{space 1}    1.11{col 58}{space 3}0.268{col 66}{space 4}-17188.55{col 79}{space 3} 61314.63
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
anyloan_am~1 {c |}{res}      3,264    59836.27    133692.6          0    5000000
{txt}(sum of wgt is 6,702.52161359787)

Linear regression                               Number of obs     = {res}     6,862
                                                {txt}F(7, 103)         =  {res}     5.54
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0203
                                                {txt}Root MSE          =    {res} .50385

{txt}{ralign 90:(Std. err. adjusted for {res:104} clusters in {res:areaid})}
{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}          credit_index_1{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2} .1057547{col 38}{space 2} .0291229{col 49}{space 1}    3.63{col 58}{space 3}0.000{col 66}{space 4} .0479963{col 79}{space 3} .1635131
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2} .0000683{col 38}{space 2} .0000971{col 49}{space 1}    0.70{col 58}{space 3}0.483{col 66}{space 4}-.0001243{col 79}{space 3}  .000261
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} 1.53e-06{col 38}{space 2} 4.43e-07{col 49}{space 1}    3.45{col 58}{space 3}0.001{col 66}{space 4} 6.48e-07{col 79}{space 3} 2.41e-06
{txt}area_business_total_base {c |}{col 26}{res}{space 2}-.0048383{col 38}{space 2} .0030574{col 49}{space 1}   -1.58{col 58}{space 3}0.117{col 66}{space 4}-.0109019{col 79}{space 3} .0012253
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2}-.0000184{col 38}{space 2} .0000768{col 49}{space 1}   -0.24{col 58}{space 3}0.811{col 66}{space 4}-.0001708{col 79}{space 3}  .000134
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2}-.2285552{col 38}{space 2} .1573096{col 49}{space 1}   -1.45{col 58}{space 3}0.149{col 66}{space 4}-.5405416{col 79}{space 3} .0834313
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2} .3009112{col 38}{space 2} .2329388{col 49}{space 1}    1.29{col 58}{space 3}0.199{col 66}{space 4} -.161068{col 79}{space 3} .7628903
{txt}{space 19}_cons {c |}{col 26}{res}{space 2}-.0907979{col 38}{space 2} .1219379{col 49}{space 1}   -0.74{col 58}{space 3}0.458{col 66}{space 4} -.332633{col 79}{space 3} .1510372
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
credit_ind~1 {c |}{res}      3,264    5.08e-09    .4595561  -.6389409   6.248938
{txt}
{com}. * Export all stored results to a table
. 
.         
. ***PANEL B: ENDLINE 2***
. est clear
{res}{txt}
{com}. *Loop through each variable, run regressions, and store results
. foreach var in spandana_2 othermfi_2 anymfi_2 anybank_2 anyinformal_2 anyloan_2 everlate_2 mfi_loan_cycles_2 ///
>            spandana_amt_2 othermfi_amt_2 anymfi_amt_2 bank_amt_2 informal_amt_2 anyloan_amt_2 credit_index_2 {c -(}
{txt}  2{com}.     * Step 3a: Run regression with treatment and area controls, weighted by w2
.     reg `var' treatment $area_controls [pweight=w2], cluster(areaid)
{txt}  3{com}. 
.     * Step 3b: Calculate p-value for the treatment coefficient
.     scalar pval = 2 * ttail(e(df_r), abs(_b[treatment] / _se[treatment]))
{txt}  4{com}. 
.     * Step 3c: Summarize the variable for the control group at endline 2
.     sum `var' if treatment == 0 & e(sample)
{txt}  5{com}.     scalar mean_control = r(mean)
{txt}  6{com}.     scalar sd_control = r(sd)
{txt}  7{com}. 
.     * Step 3d: Store the regression results for this variable
.     est store `var'
{txt}  8{com}. {c )-}
{txt}(sum of wgt is 5,957.90570878983)

Linear regression                               Number of obs     = {res}     6,142
                                                {txt}F(7, 103)         =  {res}     2.85
                                                {txt}Prob > F          = {res}    0.0093
                                                {txt}R-squared         = {res}    0.0119
                                                {txt}Root MSE          =    {res} .33879

{txt}{ralign 90:(Std. err. adjusted for {res:104} clusters in {res:areaid})}
{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}              spandana_2{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2} .0625908{col 38}{space 2} .0184513{col 49}{space 1}    3.39{col 58}{space 3}0.001{col 66}{space 4}  .025997{col 79}{space 3} .0991847
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2}-.0000637{col 38}{space 2} .0000644{col 49}{space 1}   -0.99{col 58}{space 3}0.325{col 66}{space 4}-.0001914{col 79}{space 3} .0000639
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} 4.53e-07{col 38}{space 2} 3.01e-07{col 49}{space 1}    1.51{col 58}{space 3}0.135{col 66}{space 4}-1.44e-07{col 79}{space 3} 1.05e-06
{txt}area_business_total_base {c |}{col 26}{res}{space 2}-.0018853{col 38}{space 2} .0016841{col 49}{space 1}   -1.12{col 58}{space 3}0.266{col 66}{space 4}-.0052254{col 79}{space 3} .0014547
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2}-.0000477{col 38}{space 2} .0000567{col 49}{space 1}   -0.84{col 58}{space 3}0.402{col 66}{space 4}-.0001601{col 79}{space 3} .0000647
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2}-.0667348{col 38}{space 2}  .104646{col 49}{space 1}   -0.64{col 58}{space 3}0.525{col 66}{space 4}-.2742754{col 79}{space 3} .1408058
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2} .0940757{col 38}{space 2} .1691222{col 49}{space 1}    0.56{col 58}{space 3}0.579{col 66}{space 4}-.2413383{col 79}{space 3} .4294897
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} .1439002{col 38}{space 2} .0883318{col 49}{space 1}    1.63{col 58}{space 3}0.106{col 66}{space 4}-.0312852{col 79}{space 3} .3190856
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 2}spandana_2 {c |}{res}      2,943    .1114509    .3147432          0          1
{txt}(sum of wgt is 5,957.90570878983)

Linear regression                               Number of obs     = {res}     6,142
                                                {txt}F(7, 103)         =  {res}     2.18
                                                {txt}Prob > F          = {res}    0.0417
                                                {txt}R-squared         = {res}    0.0117
                                                {txt}Root MSE          =    {res} .42922

{txt}{ralign 90:(Std. err. adjusted for {res:104} clusters in {res:areaid})}
{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}              othermfi_2{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2}-.0387575{col 38}{space 2} .0262002{col 49}{space 1}   -1.48{col 58}{space 3}0.142{col 66}{space 4}-.0907195{col 79}{space 3} .0132045
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2}-.0000527{col 38}{space 2} .0000873{col 49}{space 1}   -0.60{col 58}{space 3}0.547{col 66}{space 4}-.0002259{col 79}{space 3} .0001205
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2}-8.07e-07{col 38}{space 2} 3.43e-07{col 49}{space 1}   -2.35{col 58}{space 3}0.021{col 66}{space 4}-1.49e-06{col 79}{space 3}-1.27e-07
{txt}area_business_total_base {c |}{col 26}{res}{space 2} .0003896{col 38}{space 2} .0030094{col 49}{space 1}    0.13{col 58}{space 3}0.897{col 66}{space 4}-.0055789{col 79}{space 3} .0063582
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2} -.000033{col 38}{space 2} .0000679{col 49}{space 1}   -0.49{col 58}{space 3}0.628{col 66}{space 4}-.0001678{col 79}{space 3} .0001017
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2}-.3546357{col 38}{space 2} .1201319{col 49}{space 1}   -2.95{col 58}{space 3}0.004{col 66}{space 4} -.592889{col 79}{space 3}-.1163823
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2} .3470311{col 38}{space 2} .2118267{col 49}{space 1}    1.64{col 58}{space 3}0.104{col 66}{space 4}-.0730773{col 79}{space 3} .7671394
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} .3233602{col 38}{space 2} .1323781{col 49}{space 1}    2.44{col 58}{space 3}0.016{col 66}{space 4} .0608195{col 79}{space 3}  .585901
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 2}othermfi_2 {c |}{res}      2,943    .2684336    .4432197          0          1
{txt}(sum of wgt is 5,957.90570878983)

Linear regression                               Number of obs     = {res}     6,142
                                                {txt}F(7, 103)         =  {res}     1.46
                                                {txt}Prob > F          = {res}    0.1899
                                                {txt}R-squared         = {res}    0.0083
                                                {txt}Root MSE          =    {res}  .4669

{txt}{ralign 90:(Std. err. adjusted for {res:104} clusters in {res:areaid})}
{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}                anymfi_2{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2} .0021354{col 38}{space 2} .0290918{col 49}{space 1}    0.07{col 58}{space 3}0.942{col 66}{space 4}-.0555612{col 79}{space 3} .0598321
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2}-.0000723{col 38}{space 2} .0000982{col 49}{space 1}   -0.74{col 58}{space 3}0.463{col 66}{space 4} -.000267{col 79}{space 3} .0001224
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2}-4.33e-07{col 38}{space 2} 4.37e-07{col 49}{space 1}   -0.99{col 58}{space 3}0.324{col 66}{space 4}-1.30e-06{col 79}{space 3} 4.34e-07
{txt}area_business_total_base {c |}{col 26}{res}{space 2}-.0015032{col 38}{space 2} .0032972{col 49}{space 1}   -0.46{col 58}{space 3}0.649{col 66}{space 4}-.0080423{col 79}{space 3}  .005036
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2}-.0000542{col 38}{space 2} .0000829{col 49}{space 1}   -0.65{col 58}{space 3}0.514{col 66}{space 4}-.0002187{col 79}{space 3} .0001102
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2}-.3625886{col 38}{space 2}  .143614{col 49}{space 1}   -2.52{col 58}{space 3}0.013{col 66}{space 4}-.6474131{col 79}{space 3}-.0777641
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2}  .344901{col 38}{space 2} .2576214{col 49}{space 1}    1.34{col 58}{space 3}0.184{col 66}{space 4}-.1660304{col 79}{space 3} .8558323
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} .4147019{col 38}{space 2} .1544785{col 49}{space 1}    2.68{col 58}{space 3}0.008{col 66}{space 4} .1083304{col 79}{space 3} .7210735
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}anymfi_2 {c |}{res}      2,943    .3309548    .4706368          0          1
{txt}(sum of wgt is 5,957.90570878983)

Linear regression                               Number of obs     = {res}     6,142
                                                {txt}F(7, 103)         =  {res}     1.02
                                                {txt}Prob > F          = {res}    0.4248
                                                {txt}R-squared         = {res}    0.0018
                                                {txt}Root MSE          =    {res} .26133

{txt}{ralign 90:(Std. err. adjusted for {res:104} clusters in {res:areaid})}
{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}               anybank_2{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2} .0007455{col 38}{space 2} .0085107{col 49}{space 1}    0.09{col 58}{space 3}0.930{col 66}{space 4}-.0161335{col 79}{space 3} .0176244
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2}-.0000417{col 38}{space 2} .0000303{col 49}{space 1}   -1.38{col 58}{space 3}0.171{col 66}{space 4}-.0001018{col 79}{space 3} .0000184
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2}-2.11e-08{col 38}{space 2} 2.12e-07{col 49}{space 1}   -0.10{col 58}{space 3}0.921{col 66}{space 4}-4.42e-07{col 79}{space 3} 4.00e-07
{txt}area_business_total_base {c |}{col 26}{res}{space 2}-.0012436{col 38}{space 2}  .000886{col 49}{space 1}   -1.40{col 58}{space 3}0.163{col 66}{space 4}-.0030008{col 79}{space 3} .0005137
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2}-.0000203{col 38}{space 2} .0000368{col 49}{space 1}   -0.55{col 58}{space 3}0.583{col 66}{space 4}-.0000933{col 79}{space 3} .0000527
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2} -.035125{col 38}{space 2} .0384987{col 49}{space 1}   -0.91{col 58}{space 3}0.364{col 66}{space 4}-.1114782{col 79}{space 3} .0412282
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2} .1076184{col 38}{space 2} .0725132{col 49}{space 1}    1.48{col 58}{space 3}0.141{col 66}{space 4}-.0361945{col 79}{space 3} .2514314
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} .0643696{col 38}{space 2} .0539528{col 49}{space 1}    1.19{col 58}{space 3}0.236{col 66}{space 4}-.0426331{col 79}{space 3} .1713723
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 3}anybank_2 {c |}{res}      2,943    .0730547    .2602705          0          1
{txt}(sum of wgt is 5,957.90570878983)

Linear regression                               Number of obs     = {res}     6,142
                                                {txt}F(7, 103)         =  {res}     4.31
                                                {txt}Prob > F          = {res}    0.0003
                                                {txt}R-squared         = {res}    0.0076
                                                {txt}Root MSE          =    {res} .48809

{txt}{ralign 90:(Std. err. adjusted for {res:104} clusters in {res:areaid})}
{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}           anyinformal_2{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2}  .002137{col 38}{space 2} .0176095{col 49}{space 1}    0.12{col 58}{space 3}0.904{col 66}{space 4}-.0327873{col 79}{space 3} .0370612
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2} .0000992{col 38}{space 2} .0000598{col 49}{space 1}    1.66{col 58}{space 3}0.100{col 66}{space 4}-.0000194{col 79}{space 3} .0002179
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} 4.11e-07{col 38}{space 2} 2.41e-07{col 49}{space 1}    1.70{col 58}{space 3}0.092{col 66}{space 4}-6.76e-08{col 79}{space 3} 8.90e-07
{txt}area_business_total_base {c |}{col 26}{res}{space 2}-.0010682{col 38}{space 2} .0018247{col 49}{space 1}   -0.59{col 58}{space 3}0.560{col 66}{space 4} -.004687{col 79}{space 3} .0025507
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2}-.0000762{col 38}{space 2} .0000608{col 49}{space 1}   -1.25{col 58}{space 3}0.213{col 66}{space 4}-.0001967{col 79}{space 3} .0000443
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2} .0438784{col 38}{space 2} .0868386{col 49}{space 1}    0.51{col 58}{space 3}0.614{col 66}{space 4}-.1283454{col 79}{space 3} .2161022
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2}-.4332477{col 38}{space 2} .1479894{col 49}{space 1}   -2.93{col 58}{space 3}0.004{col 66}{space 4}-.7267497{col 79}{space 3}-.1397456
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} .9065527{col 38}{space 2} .0943386{col 49}{space 1}    9.61{col 58}{space 3}0.000{col 66}{space 4} .7194543{col 79}{space 3} 1.093651
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
anyinforma~2 {c |}{res}      2,943    .6034659    .4892608          0          1
{txt}(sum of wgt is 5,957.90570878983)

Linear regression                               Number of obs     = {res}     6,142
                                                {txt}F(7, 103)         =  {res}     3.88
                                                {txt}Prob > F          = {res}    0.0009
                                                {txt}R-squared         = {res}    0.0072
                                                {txt}Root MSE          =    {res} .29556

{txt}{ralign 90:(Std. err. adjusted for {res:104} clusters in {res:areaid})}
{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}               anyloan_2{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2} .0002201{col 38}{space 2} .0104022{col 49}{space 1}    0.02{col 58}{space 3}0.983{col 66}{space 4}-.0204101{col 79}{space 3} .0208503
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2} 2.72e-06{col 38}{space 2} .0000362{col 49}{space 1}    0.08{col 58}{space 3}0.940{col 66}{space 4} -.000069{col 79}{space 3} .0000744
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} 1.71e-08{col 38}{space 2} 2.32e-07{col 49}{space 1}    0.07{col 58}{space 3}0.941{col 66}{space 4}-4.43e-07{col 79}{space 3} 4.78e-07
{txt}area_business_total_base {c |}{col 26}{res}{space 2}-.0008122{col 38}{space 2} .0011862{col 49}{space 1}   -0.68{col 58}{space 3}0.495{col 66}{space 4}-.0031648{col 79}{space 3} .0015403
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2}-.0000322{col 38}{space 2}  .000031{col 49}{space 1}   -1.04{col 58}{space 3}0.302{col 66}{space 4}-.0000938{col 79}{space 3} .0000293
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2}-.0663382{col 38}{space 2} .0558863{col 49}{space 1}   -1.19{col 58}{space 3}0.238{col 66}{space 4}-.1771755{col 79}{space 3} .0444991
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2}-.1741993{col 38}{space 2}  .101306{col 49}{space 1}   -1.72{col 58}{space 3}0.089{col 66}{space 4}-.3751158{col 79}{space 3} .0267173
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} 1.098302{col 38}{space 2} .0642466{col 49}{space 1}   17.10{col 58}{space 3}0.000{col 66}{space 4} .9708836{col 79}{space 3}  1.22572
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 3}anyloan_2 {c |}{res}      2,943    .9041794    .2943951          0          1
{txt}(sum of wgt is 5,957.90570878983)

Linear regression                               Number of obs     = {res}     6,142
                                                {txt}F(7, 103)         =  {res}     2.11
                                                {txt}Prob > F          = {res}    0.0489
                                                {txt}R-squared         = {res}    0.0071
                                                {txt}Root MSE          =    {res} .48879

{txt}{ralign 90:(Std. err. adjusted for {res:104} clusters in {res:areaid})}
{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}              everlate_2{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2} .0070295{col 38}{space 2} .0211907{col 49}{space 1}    0.33{col 58}{space 3}0.741{col 66}{space 4}-.0349973{col 79}{space 3} .0490562
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2}-.0000862{col 38}{space 2} .0000758{col 49}{space 1}   -1.14{col 58}{space 3}0.258{col 66}{space 4}-.0002365{col 79}{space 3} .0000641
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} 4.62e-07{col 38}{space 2} 4.98e-07{col 49}{space 1}    0.93{col 58}{space 3}0.356{col 66}{space 4}-5.25e-07{col 79}{space 3} 1.45e-06
{txt}area_business_total_base {c |}{col 26}{res}{space 2}-.0010351{col 38}{space 2} .0017758{col 49}{space 1}   -0.58{col 58}{space 3}0.561{col 66}{space 4}-.0045569{col 79}{space 3} .0024867
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2}-.0001265{col 38}{space 2} .0000666{col 49}{space 1}   -1.90{col 58}{space 3}0.060{col 66}{space 4}-.0002586{col 79}{space 3} 5.61e-06
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2}-.0839235{col 38}{space 2} .1111866{col 49}{space 1}   -0.75{col 58}{space 3}0.452{col 66}{space 4}-.3044359{col 79}{space 3} .1365889
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2}-.1863798{col 38}{space 2} .1884652{col 49}{space 1}   -0.99{col 58}{space 3}0.325{col 66}{space 4}-.5601561{col 79}{space 3} .1873964
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} .9168961{col 38}{space 2}  .108015{col 49}{space 1}    8.49{col 58}{space 3}0.000{col 66}{space 4} .7026739{col 79}{space 3} 1.131118
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 2}everlate_2 {c |}{res}      2,943    .5980292    .4903794          0          1
{txt}(sum of wgt is 5,756.47931742668)

Linear regression                               Number of obs     = {res}     5,926
                                                {txt}F(7, 103)         =  {res}     2.03
                                                {txt}Prob > F          = {res}    0.0581
                                                {txt}R-squared         = {res}    0.0103
                                                {txt}Root MSE          =    {res} 1.0828

{txt}{ralign 90:(Std. err. adjusted for {res:104} clusters in {res:areaid})}
{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}       mfi_loan_cycles_2{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2} .0845583{col 38}{space 2} .0666156{col 49}{space 1}    1.27{col 58}{space 3}0.207{col 66}{space 4}-.0475581{col 79}{space 3} .2166747
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2} .0000845{col 38}{space 2} .0002275{col 49}{space 1}    0.37{col 58}{space 3}0.711{col 66}{space 4}-.0003667{col 79}{space 3} .0005357
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} 1.19e-06{col 38}{space 2} 1.10e-06{col 49}{space 1}    1.08{col 58}{space 3}0.284{col 66}{space 4}-1.00e-06{col 79}{space 3} 3.38e-06
{txt}area_business_total_base {c |}{col 26}{res}{space 2}-.0069377{col 38}{space 2} .0071932{col 49}{space 1}   -0.96{col 58}{space 3}0.337{col 66}{space 4}-.0212038{col 79}{space 3} .0073283
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2}-.0000129{col 38}{space 2} .0001885{col 49}{space 1}   -0.07{col 58}{space 3}0.945{col 66}{space 4}-.0003868{col 79}{space 3} .0003609
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2}-.9576305{col 38}{space 2} .3557969{col 49}{space 1}   -2.69{col 58}{space 3}0.008{col 66}{space 4} -1.66327{col 79}{space 3}-.2519913
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2}  1.25438{col 38}{space 2} .5579096{col 49}{space 1}    2.25{col 58}{space 3}0.027{col 66}{space 4} .1478975{col 79}{space 3} 2.360862
{txt}{space 19}_cons {c |}{col 26}{res}{space 2}   .44066{col 38}{space 2}  .322869{col 49}{space 1}    1.36{col 58}{space 3}0.175{col 66}{space 4}-.1996745{col 79}{space 3} 1.080994
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
mfi_loan_c~2 {c |}{res}      2,863     .724405    1.098266          0         10
{txt}(sum of wgt is 5,957.90570878983)

Linear regression                               Number of obs     = {res}     6,142
                                                {txt}F(7, 103)         =  {res}     4.24
                                                {txt}Prob > F          = {res}    0.0004
                                                {txt}R-squared         = {res}    0.0090
                                                {txt}Root MSE          =    {res} 6236.4

{txt}{ralign 90:(Std. err. adjusted for {res:104} clusters in {res:areaid})}
{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}          spandana_amt_2{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2} 979.4121{col 38}{space 2} 286.5865{col 49}{space 1}    3.42{col 58}{space 3}0.001{col 66}{space 4} 411.0354{col 79}{space 3} 1547.789
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2}-.5393264{col 38}{space 2} 1.081475{col 49}{space 1}   -0.50{col 58}{space 3}0.619{col 66}{space 4}-2.684177{col 79}{space 3} 1.605524
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} .0085045{col 38}{space 2} .0049633{col 49}{space 1}    1.71{col 58}{space 3}0.090{col 66}{space 4} -.001339{col 79}{space 3} .0183479
{txt}area_business_total_base {c |}{col 26}{res}{space 2}-33.47461{col 38}{space 2} 25.84456{col 49}{space 1}   -1.30{col 58}{space 3}0.198{col 66}{space 4} -84.7312{col 79}{space 3} 17.78198
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2}-1.178144{col 38}{space 2} .9435467{col 49}{space 1}   -1.25{col 58}{space 3}0.215{col 66}{space 4}-3.049446{col 79}{space 3} .6931589
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2}-32.09286{col 38}{space 2} 1512.675{col 49}{space 1}   -0.02{col 58}{space 3}0.983{col 66}{space 4}-3032.127{col 79}{space 3} 2967.942
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2}-451.8967{col 38}{space 2} 2345.579{col 49}{space 1}   -0.19{col 58}{space 3}0.848{col 66}{space 4}  -5103.8{col 79}{space 3} 4200.006
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} 3033.555{col 38}{space 2} 1352.023{col 49}{space 1}    2.24{col 58}{space 3}0.027{col 66}{space 4} 352.1363{col 79}{space 3} 5714.974
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
spandana_a~2 {c |}{res}      2,943     1566.64    5618.335          0   133276.6
{txt}(sum of wgt is 5,957.90570878983)

Linear regression                               Number of obs     = {res}     6,142
                                                {txt}F(7, 103)         =  {res}     1.27
                                                {txt}Prob > F          = {res}    0.2739
                                                {txt}R-squared         = {res}    0.0041
                                                {txt}Root MSE          =    {res}  11309

{txt}{ralign 90:(Std. err. adjusted for {res:104} clusters in {res:areaid})}
{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}          othermfi_amt_2{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2}-217.1031{col 38}{space 2}  627.579{col 49}{space 1}   -0.35{col 58}{space 3}0.730{col 66}{space 4}-1461.758{col 79}{space 3} 1027.552
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2} .6339373{col 38}{space 2} 2.074632{col 49}{space 1}    0.31{col 58}{space 3}0.761{col 66}{space 4}-3.480607{col 79}{space 3} 4.748481
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2}-.0070521{col 38}{space 2} .0069228{col 49}{space 1}   -1.02{col 58}{space 3}0.311{col 66}{space 4}-.0207818{col 79}{space 3} .0066776
{txt}area_business_total_base {c |}{col 26}{res}{space 2} 2.334396{col 38}{space 2} 66.10183{col 49}{space 1}    0.04{col 58}{space 3}0.972{col 66}{space 4} -128.763{col 79}{space 3} 133.4318
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2}-2.058355{col 38}{space 2} 1.485733{col 49}{space 1}   -1.39{col 58}{space 3}0.169{col 66}{space 4}-5.004956{col 79}{space 3} .8882461
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2}-5167.302{col 38}{space 2} 2768.587{col 49}{space 1}   -1.87{col 58}{space 3}0.065{col 66}{space 4}-10658.14{col 79}{space 3} 323.5376
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2} 5636.978{col 38}{space 2} 4717.975{col 49}{space 1}    1.19{col 58}{space 3}0.235{col 66}{space 4}-3720.014{col 79}{space 3} 14993.97
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} 6102.483{col 38}{space 2} 2999.978{col 49}{space 1}    2.03{col 58}{space 3}0.045{col 66}{space 4} 152.7333{col 79}{space 3} 12052.23
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
othermfi_a~2 {c |}{res}      2,943    4775.059     10735.6          0     164000
{txt}(sum of wgt is 5,957.90570878983)

Linear regression                               Number of obs     = {res}     6,142
                                                {txt}F(7, 103)         =  {res}     1.39
                                                {txt}Prob > F          = {res}    0.2158
                                                {txt}R-squared         = {res}    0.0048
                                                {txt}Root MSE          =    {res}  12053

{txt}{ralign 90:(Std. err. adjusted for {res:104} clusters in {res:areaid})}
{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}            anymfi_amt_2{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2} 798.5698{col 38}{space 2} 669.0149{col 49}{space 1}    1.19{col 58}{space 3}0.235{col 66}{space 4}-528.2634{col 79}{space 3} 2125.403
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2}  -.01127{col 38}{space 2} 2.346109{col 49}{space 1}   -0.00{col 58}{space 3}0.996{col 66}{space 4}-4.664224{col 79}{space 3} 4.641684
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} .0026302{col 38}{space 2} .0075299{col 49}{space 1}    0.35{col 58}{space 3}0.728{col 66}{space 4}-.0123035{col 79}{space 3} .0175639
{txt}area_business_total_base {c |}{col 26}{res}{space 2}-31.53011{col 38}{space 2} 68.50702{col 49}{space 1}   -0.46{col 58}{space 3}0.646{col 66}{space 4}-167.3976{col 79}{space 3} 104.3374
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2} -2.89271{col 38}{space 2} 1.876197{col 49}{space 1}   -1.54{col 58}{space 3}0.126{col 66}{space 4}-6.613703{col 79}{space 3} .8282838
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2}-4336.347{col 38}{space 2} 3215.912{col 49}{space 1}   -1.35{col 58}{space 3}0.180{col 66}{space 4}-10714.35{col 79}{space 3} 2041.656
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2} 4243.587{col 38}{space 2} 5310.985{col 49}{space 1}    0.80{col 58}{space 3}0.426{col 66}{space 4}-6289.499{col 79}{space 3} 14776.67
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} 8116.795{col 38}{space 2} 3310.304{col 49}{space 1}    2.45{col 58}{space 3}0.016{col 66}{space 4} 1551.587{col 79}{space 3}    14682
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
anymfi_amt_2 {c |}{res}      2,943    5544.164    11347.59          0   146604.3
{txt}(sum of wgt is 5,957.90570878983)

Linear regression                               Number of obs     = {res}     6,142
                                                {txt}F(7, 103)         =  {res}     1.91
                                                {txt}Prob > F          = {res}    0.0754
                                                {txt}R-squared         = {res}    0.0043
                                                {txt}Root MSE          =    {res}  35819

{txt}{ralign 90:(Std. err. adjusted for {res:104} clusters in {res:areaid})}
{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}              bank_amt_2{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2}-1180.783{col 38}{space 2} 1085.622{col 49}{space 1}   -1.09{col 58}{space 3}0.279{col 66}{space 4}-3333.857{col 79}{space 3}  972.291
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2}-.9162888{col 38}{space 2}  3.71329{col 49}{space 1}   -0.25{col 58}{space 3}0.806{col 66}{space 4}-8.280724{col 79}{space 3} 6.448146
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} -.018718{col 38}{space 2} .0160207{col 49}{space 1}   -1.17{col 58}{space 3}0.245{col 66}{space 4}-.0504913{col 79}{space 3} .0130553
{txt}area_business_total_base {c |}{col 26}{res}{space 2} -115.111{col 38}{space 2}  108.363{col 49}{space 1}   -1.06{col 58}{space 3}0.291{col 66}{space 4}-330.0236{col 79}{space 3} 99.80153
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2} 4.529717{col 38}{space 2} 2.928365{col 49}{space 1}    1.55{col 58}{space 3}0.125{col 66}{space 4}-1.278005{col 79}{space 3} 10.33744
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2} 2383.679{col 38}{space 2} 5257.338{col 49}{space 1}    0.45{col 58}{space 3}0.651{col 66}{space 4} -8043.01{col 79}{space 3} 12810.37
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2} 20384.59{col 38}{space 2} 8217.479{col 49}{space 1}    2.48{col 58}{space 3}0.015{col 66}{space 4} 4087.161{col 79}{space 3} 36682.02
{txt}{space 19}_cons {c |}{col 26}{res}{space 2}-11766.82{col 38}{space 2} 5371.149{col 49}{space 1}   -2.19{col 58}{space 3}0.031{col 66}{space 4}-22419.23{col 79}{space 3}-1114.411
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 2}bank_amt_2 {c |}{res}      2,943    6126.523    40307.63          0   832978.9
{txt}(sum of wgt is 5,957.90570878983)

Linear regression                               Number of obs     = {res}     6,142
                                                {txt}F(7, 103)         =  {res}     1.28
                                                {txt}Prob > F          = {res}    0.2696
                                                {txt}R-squared         = {res}    0.0026
                                                {txt}Root MSE          =    {res}  80450

{txt}{ralign 90:(Std. err. adjusted for {res:104} clusters in {res:areaid})}
{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}          informal_amt_2{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2} 158.2941{col 38}{space 2} 2939.685{col 49}{space 1}    0.05{col 58}{space 3}0.957{col 66}{space 4}-5671.877{col 79}{space 3} 5988.466
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2}-2.380037{col 38}{space 2} 9.449263{col 49}{space 1}   -0.25{col 58}{space 3}0.802{col 66}{space 4}-21.12042{col 79}{space 3} 16.36035
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2}  .095449{col 38}{space 2} .0498414{col 49}{space 1}    1.92{col 58}{space 3}0.058{col 66}{space 4}-.0033997{col 79}{space 3} .1942977
{txt}area_business_total_base {c |}{col 26}{res}{space 2}-300.3636{col 38}{space 2} 306.2585{col 49}{space 1}   -0.98{col 58}{space 3}0.329{col 66}{space 4}-907.7551{col 79}{space 3} 307.0279
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2}   8.9145{col 38}{space 2}  9.16213{col 49}{space 1}    0.97{col 58}{space 3}0.333{col 66}{space 4}-9.256423{col 79}{space 3} 27.08542
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2}-2768.855{col 38}{space 2} 15275.71{col 49}{space 1}   -0.18{col 58}{space 3}0.857{col 66}{space 4}-33064.62{col 79}{space 3} 27526.91
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2}-19971.33{col 38}{space 2} 23697.59{col 49}{space 1}   -0.84{col 58}{space 3}0.401{col 66}{space 4}-66969.91{col 79}{space 3} 27027.25
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} 38332.86{col 38}{space 2} 14903.66{col 49}{space 1}    2.57{col 58}{space 3}0.012{col 66}{space 4} 8774.975{col 79}{space 3} 67890.75
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
informal_a~2 {c |}{res}      2,943    32355.99    76704.16          0    1266128
{txt}(sum of wgt is 5,957.90570878983)

Linear regression                               Number of obs     = {res}     6,142
                                                {txt}F(7, 103)         =  {res}     1.05
                                                {txt}Prob > F          = {res}    0.4025
                                                {txt}R-squared         = {res}    0.0033
                                                {txt}Root MSE          =    {res} 1.5e+05

{txt}{ralign 90:(Std. err. adjusted for {res:104} clusters in {res:areaid})}
{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}           anyloan_amt_2{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2} 2554.018{col 38}{space 2} 6155.602{col 49}{space 1}    0.41{col 58}{space 3}0.679{col 66}{space 4}-9654.168{col 79}{space 3}  14762.2
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2}-9.483572{col 38}{space 2} 20.59606{col 49}{space 1}   -0.46{col 58}{space 3}0.646{col 66}{space 4}-50.33101{col 79}{space 3} 31.36386
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} .1010647{col 38}{space 2} .1367847{col 49}{space 1}    0.74{col 58}{space 3}0.462{col 66}{space 4}-.1702155{col 79}{space 3} .3723448
{txt}area_business_total_base {c |}{col 26}{res}{space 2}-1604.984{col 38}{space 2} 660.4849{col 49}{space 1}   -2.43{col 58}{space 3}0.017{col 66}{space 4}  -2914.9{col 79}{space 3}-295.0684
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2} 13.97344{col 38}{space 2} 20.74079{col 49}{space 1}    0.67{col 58}{space 3}0.502{col 66}{space 4}-27.16102{col 79}{space 3} 55.10791
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2} 5485.492{col 38}{space 2} 31851.08{col 49}{space 1}    0.17{col 58}{space 3}0.864{col 66}{space 4}-57683.62{col 79}{space 3}  68654.6
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2}-14797.26{col 38}{space 2} 52575.51{col 49}{space 1}   -0.28{col 58}{space 3}0.779{col 66}{space 4}-119068.4{col 79}{space 3} 89473.87
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} 92697.42{col 38}{space 2} 33087.98{col 49}{space 1}    2.80{col 58}{space 3}0.006{col 66}{space 4} 27075.21{col 79}{space 3} 158319.6
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
anyloan_am~2 {c |}{res}      2,943    88631.46    144634.3          0    2520000
{txt}(sum of wgt is 5,957.90570878983)

Linear regression                               Number of obs     = {res}     6,142
                                                {txt}F(7, 103)         =  {res}     1.83
                                                {txt}Prob > F          = {res}    0.0901
                                                {txt}R-squared         = {res}    0.0062
                                                {txt}Root MSE          =    {res} .47504

{txt}{ralign 90:(Std. err. adjusted for {res:104} clusters in {res:areaid})}
{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}          credit_index_2{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2}  .028842{col 38}{space 2} .0252722{col 49}{space 1}    1.14{col 58}{space 3}0.256{col 66}{space 4}-.0212794{col 79}{space 3} .0789634
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2}-.0000235{col 38}{space 2} .0000886{col 49}{space 1}   -0.27{col 58}{space 3}0.791{col 66}{space 4}-.0001993{col 79}{space 3} .0001523
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} 1.47e-07{col 38}{space 2} 2.77e-07{col 49}{space 1}    0.53{col 58}{space 3}0.596{col 66}{space 4}-4.02e-07{col 79}{space 3} 6.96e-07
{txt}area_business_total_base {c |}{col 26}{res}{space 2}-.0034499{col 38}{space 2}  .002823{col 49}{space 1}   -1.22{col 58}{space 3}0.224{col 66}{space 4}-.0090487{col 79}{space 3} .0021488
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2}-.0000549{col 38}{space 2} .0000708{col 49}{space 1}   -0.78{col 58}{space 3}0.440{col 66}{space 4}-.0001952{col 79}{space 3} .0000855
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2}-.2522681{col 38}{space 2}  .118518{col 49}{space 1}   -2.13{col 58}{space 3}0.036{col 66}{space 4}-.4873207{col 79}{space 3}-.0172156
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2} .2272751{col 38}{space 2} .1982364{col 49}{space 1}    1.15{col 58}{space 3}0.254{col 66}{space 4}-.1658801{col 79}{space 3} .6204304
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} .0739559{col 38}{space 2} .1275052{col 49}{space 1}    0.58{col 58}{space 3}0.563{col 66}{space 4}-.1789205{col 79}{space 3} .3268323
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
credit_ind~2 {c |}{res}      2,943   -2.82e-09    .4654905  -.5776622   4.082351
{txt}
{com}. *Export all stored results to a table
. 
. 
. ***SENSITIVITY ANALYSIS***
. 
. *Compare results using robust standard errors*
. *Endline 1
. est clear
{res}{txt}
{com}. foreach var in spandana_1 othermfi_1 anymfi_1 anybank_1 anyinformal_1  anyloan_1 everlate_1 mfi_loan_cycles_1 ///
>                            spandana_amt_1 othermfi_amt_1 anymfi_amt_1 bank_amt_1 informal_amt_1 anyloan_amt_1 credit_index_1 {c -(}
{txt}  2{com}.     * Run regression with treatment and area controls, weighted by w1
.     reg `var' treatment $area_controls [pweight=w1], robust
{txt}  3{com}.     
.     * p-value for treatment coefficients
.     scalar pval = 2 * ttail(e(df_r), abs(_b[treatment] / _se[treatment]))
{txt}  4{com}.     
.     * Summarize the variable for the control group at endline 1
.     sum `var' if treatment == 0 & e(sample)
{txt}  5{com}.     scalar mean_control = r(mean)
{txt}  6{com}.     scalar sd_control = r(sd)
{txt}  7{com}.     
.     est store `var'
{txt}  8{com}. {c )-}
{txt}(sum of wgt is 6,651.52161359787)

Linear regression                               Number of obs     = {res}     6,811
                                                {txt}F(7, 6803)        =  {res}    60.77
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0520
                                                {txt}Root MSE          =    {res} .30636

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}              spandana_1{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2} .1273842{col 38}{space 2} .0068421{col 49}{space 1}   18.62{col 58}{space 3}0.000{col 66}{space 4} .1139716{col 79}{space 3} .1407968
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2}-.0000527{col 38}{space 2} .0000222{col 49}{space 1}   -2.37{col 58}{space 3}0.018{col 66}{space 4}-.0000963{col 79}{space 3}-9.19e-06
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} 1.20e-06{col 38}{space 2} 2.00e-07{col 49}{space 1}    5.98{col 58}{space 3}0.000{col 66}{space 4} 8.04e-07{col 79}{space 3} 1.59e-06
{txt}area_business_total_base {c |}{col 26}{res}{space 2}-.0018504{col 38}{space 2} .0006673{col 49}{space 1}   -2.77{col 58}{space 3}0.006{col 66}{space 4}-.0031585{col 79}{space 3}-.0005422
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2}-1.06e-06{col 38}{space 2} .0000225{col 49}{space 1}   -0.05{col 58}{space 3}0.962{col 66}{space 4}-.0000451{col 79}{space 3}  .000043
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2}-.0798948{col 38}{space 2} .0402637{col 49}{space 1}   -1.98{col 58}{space 3}0.047{col 66}{space 4}-.1588242{col 79}{space 3}-.0009654
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2} .0778548{col 38}{space 2}   .06467{col 49}{space 1}    1.20{col 58}{space 3}0.229{col 66}{space 4}-.0489186{col 79}{space 3} .2046281
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} .0319041{col 38}{space 2}  .036261{col 49}{space 1}    0.88{col 58}{space 3}0.379{col 66}{space 4}-.0391787{col 79}{space 3}  .102987
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 2}spandana_1 {c |}{res}      3,247    .0505082    .2190248          0          1
{txt}(sum of wgt is 6,497.52161359787)

Linear regression                               Number of obs     = {res}     6,657
                                                {txt}F(7, 6649)        =  {res}    12.90
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0135
                                                {txt}Root MSE          =    {res} .34328

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}              othermfi_1{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2}-.0116026{col 38}{space 2} .0084279{col 49}{space 1}   -1.38{col 58}{space 3}0.169{col 66}{space 4}-.0281239{col 79}{space 3} .0049187
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2} .0001852{col 38}{space 2} .0000294{col 49}{space 1}    6.30{col 58}{space 3}0.000{col 66}{space 4} .0001276{col 79}{space 3} .0002429
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} 8.75e-08{col 38}{space 2} 1.52e-07{col 49}{space 1}    0.58{col 58}{space 3}0.564{col 66}{space 4}-2.10e-07{col 79}{space 3} 3.85e-07
{txt}area_business_total_base {c |}{col 26}{res}{space 2} .0003109{col 38}{space 2} .0008585{col 49}{space 1}    0.36{col 58}{space 3}0.717{col 66}{space 4} -.001372{col 79}{space 3} .0019938
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2}-.0001014{col 38}{space 2} .0000233{col 49}{space 1}   -4.35{col 58}{space 3}0.000{col 66}{space 4} -.000147{col 79}{space 3}-.0000557
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2}-.1953897{col 38}{space 2} .0447849{col 49}{space 1}   -4.36{col 58}{space 3}0.000{col 66}{space 4}-.2831825{col 79}{space 3}-.1075969
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2} .3031144{col 38}{space 2} .0758444{col 49}{space 1}    4.00{col 58}{space 3}0.000{col 66}{space 4} .1544352{col 79}{space 3} .4517937
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} .0968452{col 38}{space 2} .0446494{col 49}{space 1}    2.17{col 58}{space 3}0.030{col 66}{space 4} .0093181{col 79}{space 3} .1843723
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 2}othermfi_1 {c |}{res}      3,183    .1486019    .3557516          0          1
{txt}(sum of wgt is 6,651.52161359787)

Linear regression                               Number of obs     = {res}     6,811
                                                {txt}F(7, 6803)        =  {res}    21.70
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0191
                                                {txt}Root MSE          =    {res} .40992

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}                anymfi_1{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2} .0834639{col 38}{space 2} .0097237{col 49}{space 1}    8.58{col 58}{space 3}0.000{col 66}{space 4} .0644024{col 79}{space 3} .1025254
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2}  .000126{col 38}{space 2} .0000334{col 49}{space 1}    3.77{col 58}{space 3}0.000{col 66}{space 4} .0000605{col 79}{space 3} .0001914
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} 9.82e-07{col 38}{space 2} 2.15e-07{col 49}{space 1}    4.57{col 58}{space 3}0.000{col 66}{space 4} 5.61e-07{col 79}{space 3} 1.40e-06
{txt}area_business_total_base {c |}{col 26}{res}{space 2}-.0015741{col 38}{space 2} .0009869{col 49}{space 1}   -1.60{col 58}{space 3}0.111{col 66}{space 4}-.0035088{col 79}{space 3} .0003605
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2}-.0000702{col 38}{space 2}  .000029{col 49}{space 1}   -2.42{col 58}{space 3}0.016{col 66}{space 4}-.0001271{col 79}{space 3}-.0000132
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2}-.2628159{col 38}{space 2} .0537011{col 49}{space 1}   -4.89{col 58}{space 3}0.000{col 66}{space 4}-.3680868{col 79}{space 3} -.157545
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2} .3226162{col 38}{space 2} .0889138{col 49}{space 1}    3.63{col 58}{space 3}0.000{col 66}{space 4} .1483173{col 79}{space 3} .4969151
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} .1272933{col 38}{space 2} .0516526{col 49}{space 1}    2.46{col 58}{space 3}0.014{col 66}{space 4} .0260379{col 79}{space 3} .2285486
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}anymfi_1 {c |}{res}      3,247    .1832461    .3869277          0          1
{txt}(sum of wgt is 6,651.52161359787)

Linear regression                               Number of obs     = {res}     6,811
                                                {txt}F(7, 6803)        =  {res}     2.37
                                                {txt}Prob > F          = {res}    0.0204
                                                {txt}R-squared         = {res}    0.0026
                                                {txt}Root MSE          =    {res} .27343

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}               anybank_1{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2}  .002774{col 38}{space 2} .0068119{col 49}{space 1}    0.41{col 58}{space 3}0.684{col 66}{space 4}-.0105794{col 79}{space 3} .0161275
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2}-.0000259{col 38}{space 2} .0000229{col 49}{space 1}   -1.13{col 58}{space 3}0.258{col 66}{space 4}-.0000708{col 79}{space 3}  .000019
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} 1.23e-08{col 38}{space 2} 1.35e-07{col 49}{space 1}    0.09{col 58}{space 3}0.928{col 66}{space 4}-2.53e-07{col 79}{space 3} 2.77e-07
{txt}area_business_total_base {c |}{col 26}{res}{space 2}-.0014119{col 38}{space 2}  .000739{col 49}{space 1}   -1.91{col 58}{space 3}0.056{col 66}{space 4}-.0028606{col 79}{space 3} .0000368
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2} .0000198{col 38}{space 2} .0000228{col 49}{space 1}    0.87{col 58}{space 3}0.386{col 66}{space 4} -.000025{col 79}{space 3} .0000645
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2}-.0171095{col 38}{space 2} .0339541{col 49}{space 1}   -0.50{col 58}{space 3}0.614{col 66}{space 4}-.0836701{col 79}{space 3} .0494511
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2} .1565103{col 38}{space 2}  .056949{col 49}{space 1}    2.75{col 58}{space 3}0.006{col 66}{space 4} .0448726{col 79}{space 3} .2681481
{txt}{space 19}_cons {c |}{col 26}{res}{space 2}-.0179807{col 38}{space 2} .0353787{col 49}{space 1}   -0.51{col 58}{space 3}0.611{col 66}{space 4} -.087334{col 79}{space 3} .0513726
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 3}anybank_1 {c |}{res}      3,247      .07915    .2700143          0          1
{txt}(sum of wgt is 6,651.52161359787)

Linear regression                               Number of obs     = {res}     6,811
                                                {txt}F(7, 6803)        =  {res}    10.61
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0104
                                                {txt}Root MSE          =    {res} .43992

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}           anyinformal_1{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2}-.0516701{col 38}{space 2} .0108272{col 49}{space 1}   -4.77{col 58}{space 3}0.000{col 66}{space 4}-.0728948{col 79}{space 3}-.0304454
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2}-.0000405{col 38}{space 2} .0000363{col 49}{space 1}   -1.12{col 58}{space 3}0.264{col 66}{space 4}-.0001116{col 79}{space 3} .0000306
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} 1.06e-07{col 38}{space 2} 2.13e-07{col 49}{space 1}    0.50{col 58}{space 3}0.620{col 66}{space 4}-3.13e-07{col 79}{space 3} 5.24e-07
{txt}area_business_total_base {c |}{col 26}{res}{space 2}-.0031273{col 38}{space 2} .0011492{col 49}{space 1}   -2.72{col 58}{space 3}0.007{col 66}{space 4}-.0053801{col 79}{space 3}-.0008745
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2}-.0000934{col 38}{space 2} .0000335{col 49}{space 1}   -2.79{col 58}{space 3}0.005{col 66}{space 4}-.0001591{col 79}{space 3}-.0000277
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2}-.0639339{col 38}{space 2} .0573103{col 49}{space 1}   -1.12{col 58}{space 3}0.265{col 66}{space 4}  -.17628{col 79}{space 3} .0484121
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2}-.1800813{col 38}{space 2} .0976832{col 49}{space 1}   -1.84{col 58}{space 3}0.065{col 66}{space 4}-.3715709{col 79}{space 3} .0114083
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} 1.046398{col 38}{space 2} .0559237{col 49}{space 1}   18.71{col 58}{space 3}0.000{col 66}{space 4} .9367699{col 79}{space 3} 1.156026
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
anyinforma~1 {c |}{res}      3,247    .7610102    .4265322          0          1
{txt}(sum of wgt is 6,702.52161359787)

Linear regression                               Number of obs     = {res}     6,862
                                                {txt}F(7, 6854)        =  {res}     7.95
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0074
                                                {txt}Root MSE          =    {res} .35167

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}               anyloan_1{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2}-.0224983{col 38}{space 2} .0087186{col 49}{space 1}   -2.58{col 58}{space 3}0.010{col 66}{space 4}-.0395894{col 79}{space 3}-.0054072
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2}-.0000123{col 38}{space 2} .0000287{col 49}{space 1}   -0.43{col 58}{space 3}0.669{col 66}{space 4}-.0000686{col 79}{space 3}  .000044
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} 1.63e-07{col 38}{space 2} 1.51e-07{col 49}{space 1}    1.08{col 58}{space 3}0.280{col 66}{space 4}-1.32e-07{col 79}{space 3} 4.58e-07
{txt}area_business_total_base {c |}{col 26}{res}{space 2}-.0020494{col 38}{space 2} .0009264{col 49}{space 1}   -2.21{col 58}{space 3}0.027{col 66}{space 4}-.0038656{col 79}{space 3}-.0002333
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2}-.0000648{col 38}{space 2} .0000262{col 49}{space 1}   -2.47{col 58}{space 3}0.014{col 66}{space 4}-.0001162{col 79}{space 3}-.0000134
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2}-.1272992{col 38}{space 2}  .044772{col 49}{space 1}   -2.84{col 58}{space 3}0.004{col 66}{space 4}-.2150662{col 79}{space 3}-.0395321
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2}-.0116331{col 38}{space 2} .0780105{col 49}{space 1}   -0.15{col 58}{space 3}0.881{col 66}{space 4}-.1645578{col 79}{space 3} .1412916
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} 1.029561{col 38}{space 2} .0442675{col 49}{space 1}   23.26{col 58}{space 3}0.000{col 66}{space 4} .9427825{col 79}{space 3} 1.116339
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 3}anyloan_1 {c |}{res}      3,264    .8673407    .3392581          0          1
{txt}(sum of wgt is 6,317.21992182732)

Linear regression                               Number of obs     = {res}     6,475
                                                {txt}F(7, 6467)        =  {res}    15.02
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0147
                                                {txt}Root MSE          =    {res}  .4894

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}              everlate_1{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2}-.0595832{col 38}{space 2} .0124096{col 49}{space 1}   -4.80{col 58}{space 3}0.000{col 66}{space 4}-.0839102{col 79}{space 3}-.0352563
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2} 1.35e-06{col 38}{space 2} .0000417{col 49}{space 1}    0.03{col 58}{space 3}0.974{col 66}{space 4}-.0000803{col 79}{space 3}  .000083
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2}-4.37e-07{col 38}{space 2} 2.25e-07{col 49}{space 1}   -1.94{col 58}{space 3}0.052{col 66}{space 4}-8.78e-07{col 79}{space 3} 4.13e-09
{txt}area_business_total_base {c |}{col 26}{res}{space 2}-.0026021{col 38}{space 2} .0013145{col 49}{space 1}   -1.98{col 58}{space 3}0.048{col 66}{space 4}-.0051789{col 79}{space 3}-.0000252
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2}-.0000777{col 38}{space 2} .0000383{col 49}{space 1}   -2.03{col 58}{space 3}0.043{col 66}{space 4}-.0001529{col 79}{space 3}-2.61e-06
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2}-.3281581{col 38}{space 2}  .063604{col 49}{space 1}   -5.16{col 58}{space 3}0.000{col 66}{space 4} -.452843{col 79}{space 3}-.2034731
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2} .0691651{col 38}{space 2} .1091369{col 49}{space 1}    0.63{col 58}{space 3}0.526{col 66}{space 4}-.1447793{col 79}{space 3} .2831095
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} .8804347{col 38}{space 2}  .063951{col 49}{space 1}   13.77{col 58}{space 3}0.000{col 66}{space 4} .7550695{col 79}{space 3}   1.0058
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 2}everlate_1 {c |}{res}      3,108    .6158301    .4864766          0          1
{txt}(sum of wgt is 6,656.52161359787)

Linear regression                               Number of obs     = {res}     6,816
                                                {txt}F(7, 6808)        =  {res}    11.27
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0107
                                                {txt}Root MSE          =    {res} .66533

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}       mfi_loan_cycles_1{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2} .0839298{col 38}{space 2} .0160636{col 49}{space 1}    5.22{col 58}{space 3}0.000{col 66}{space 4} .0524401{col 79}{space 3} .1154195
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2} .0001495{col 38}{space 2} .0000565{col 49}{space 1}    2.65{col 58}{space 3}0.008{col 66}{space 4} .0000388{col 79}{space 3} .0002601
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} 1.23e-06{col 38}{space 2} 3.95e-07{col 49}{space 1}    3.11{col 58}{space 3}0.002{col 66}{space 4} 4.54e-07{col 79}{space 3} 2.00e-06
{txt}area_business_total_base {c |}{col 26}{res}{space 2} -.007362{col 38}{space 2} .0015594{col 49}{space 1}   -4.72{col 58}{space 3}0.000{col 66}{space 4}-.0104189{col 79}{space 3}-.0043052
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2} -.000011{col 38}{space 2} .0000466{col 49}{space 1}   -0.24{col 58}{space 3}0.813{col 66}{space 4}-.0001023{col 79}{space 3} .0000802
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2}-.1820663{col 38}{space 2}  .088266{col 49}{space 1}   -2.06{col 58}{space 3}0.039{col 66}{space 4}-.3550953{col 79}{space 3}-.0090373
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2} .1651509{col 38}{space 2} .1407186{col 49}{space 1}    1.17{col 58}{space 3}0.241{col 66}{space 4}-.1107016{col 79}{space 3} .4410034
{txt}{space 19}_cons {c |}{col 26}{res}{space 2}  .300197{col 38}{space 2} .0818733{col 49}{space 1}    3.67{col 58}{space 3}0.000{col 66}{space 4} .1396998{col 79}{space 3} .4606942
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
mfi_loan_c~1 {c |}{res}      3,250    .3298462    .6930169          0          8
{txt}(sum of wgt is 6,651.52161359787)

Linear regression                               Number of obs     = {res}     6,811
                                                {txt}F(7, 6803)        =  {res}    41.31
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0363
                                                {txt}Root MSE          =    {res} 4061.9

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}          spandana_amt_1{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2} 1333.772{col 38}{space 2} 89.68594{col 49}{space 1}   14.87{col 58}{space 3}0.000{col 66}{space 4}  1157.96{col 79}{space 3} 1509.585
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2}-.3167799{col 38}{space 2} .3091871{col 49}{space 1}   -1.02{col 58}{space 3}0.306{col 66}{space 4}-.9228833{col 79}{space 3} .2893235
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} .0150007{col 38}{space 2} .0031106{col 49}{space 1}    4.82{col 58}{space 3}0.000{col 66}{space 4}  .008903{col 79}{space 3} .0210984
{txt}area_business_total_base {c |}{col 26}{res}{space 2}-24.36998{col 38}{space 2} 8.721014{col 49}{space 1}   -2.79{col 58}{space 3}0.005{col 66}{space 4} -41.4659{col 79}{space 3}-7.274067
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2} .3092694{col 38}{space 2} .2731026{col 49}{space 1}    1.13{col 58}{space 3}0.257{col 66}{space 4} -.226097{col 79}{space 3} .8446358
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2}-459.6969{col 38}{space 2}  483.708{col 49}{space 1}   -0.95{col 58}{space 3}0.342{col 66}{space 4}-1407.916{col 79}{space 3} 488.5221
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2} -176.225{col 38}{space 2} 766.9947{col 49}{space 1}   -0.23{col 58}{space 3}0.818{col 66}{space 4}-1679.774{col 79}{space 3} 1327.324
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} 401.1612{col 38}{space 2} 452.5376{col 49}{space 1}    0.89{col 58}{space 3}0.375{col 66}{space 4} -485.954{col 79}{space 3} 1288.276
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
spandana_a~1 {c |}{res}      3,247    597.4407    2907.486          0      40000
{txt}(sum of wgt is 6,548.52161359787)

Linear regression                               Number of obs     = {res}     6,708
                                                {txt}F(7, 6700)        =  {res}     9.44
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0116
                                                {txt}Root MSE          =    {res} 5468.6

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}          othermfi_amt_1{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2}-93.66762{col 38}{space 2} 131.1802{col 49}{space 1}   -0.71{col 58}{space 3}0.475{col 66}{space 4}-350.8226{col 79}{space 3} 163.4874
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2} 2.861135{col 38}{space 2} .4931089{col 49}{space 1}    5.80{col 58}{space 3}0.000{col 66}{space 4} 1.894485{col 79}{space 3} 3.827785
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} .0015188{col 38}{space 2} .0019153{col 49}{space 1}    0.79{col 58}{space 3}0.428{col 66}{space 4}-.0022358{col 79}{space 3} .0052734
{txt}area_business_total_base {c |}{col 26}{res}{space 2}-7.112855{col 38}{space 2} 12.07326{col 49}{space 1}   -0.59{col 58}{space 3}0.556{col 66}{space 4}-30.78028{col 79}{space 3} 16.55457
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2}-1.429049{col 38}{space 2} .3128443{col 49}{space 1}   -4.57{col 58}{space 3}0.000{col 66}{space 4}-2.042323{col 79}{space 3}-.8157742
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2}-2721.199{col 38}{space 2} 741.8418{col 49}{space 1}   -3.67{col 58}{space 3}0.000{col 66}{space 4}-4175.445{col 79}{space 3}-1266.953
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2} 4450.352{col 38}{space 2} 1182.723{col 49}{space 1}    3.76{col 58}{space 3}0.000{col 66}{space 4}  2131.84{col 79}{space 3} 6768.865
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} 931.8013{col 38}{space 2} 634.7728{col 49}{space 1}    1.47{col 58}{space 3}0.142{col 66}{space 4}-312.5553{col 79}{space 3} 2176.158
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
othermfi_a~1 {c |}{res}      3,200    1806.026    5917.835          0     180000
{txt}(sum of wgt is 6,651.52161359787)

Linear regression                               Number of obs     = {res}     6,811
                                                {txt}F(7, 6803)        =  {res}    20.77
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0148
                                                {txt}Root MSE          =    {res} 7074.7

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}            anymfi_amt_1{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2} 1285.694{col 38}{space 2} 165.3651{col 49}{space 1}    7.77{col 58}{space 3}0.000{col 66}{space 4} 961.5268{col 79}{space 3} 1609.862
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2} 2.625806{col 38}{space 2} .5808402{col 49}{space 1}    4.52{col 58}{space 3}0.000{col 66}{space 4} 1.487177{col 79}{space 3} 3.764434
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} .0158783{col 38}{space 2} .0033586{col 49}{space 1}    4.73{col 58}{space 3}0.000{col 66}{space 4} .0092945{col 79}{space 3} .0224622
{txt}area_business_total_base {c |}{col 26}{res}{space 2} -24.2327{col 38}{space 2} 16.30774{col 49}{space 1}   -1.49{col 58}{space 3}0.137{col 66}{space 4}-56.20096{col 79}{space 3} 7.735562
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2}-1.097347{col 38}{space 2} .4479903{col 49}{space 1}   -2.45{col 58}{space 3}0.014{col 66}{space 4}-1.975548{col 79}{space 3}-.2191462
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2}-2687.242{col 38}{space 2} 910.0855{col 49}{space 1}   -2.95{col 58}{space 3}0.003{col 66}{space 4}-4471.294{col 79}{space 3}-903.1897
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2} 4059.763{col 38}{space 2} 1427.196{col 49}{space 1}    2.84{col 58}{space 3}0.004{col 66}{space 4} 1262.012{col 79}{space 3} 6857.514
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} 1070.767{col 38}{space 2} 815.0347{col 49}{space 1}    1.31{col 58}{space 3}0.189{col 66}{space 4}-526.9557{col 79}{space 3}  2668.49
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
anymfi_amt_1 {c |}{res}      3,247    2373.776    6651.525          0     185000
{txt}(sum of wgt is 6,651.52161359787)

Linear regression                               Number of obs     = {res}     6,811
                                                {txt}F(7, 6803)        =  {res}     3.62
                                                {txt}Prob > F          = {res}    0.0007
                                                {txt}R-squared         = {res}    0.0024
                                                {txt}Root MSE          =    {res}  83949

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}              bank_amt_1{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2} 74.95723{col 38}{space 2} 1978.811{col 49}{space 1}    0.04{col 58}{space 3}0.970{col 66}{space 4}-3804.132{col 79}{space 3} 3954.046
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2}-11.35806{col 38}{space 2} 5.444417{col 49}{space 1}   -2.09{col 58}{space 3}0.037{col 66}{space 4}-22.03082{col 79}{space 3}-.6852984
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2}-.0312921{col 38}{space 2} .0300237{col 49}{space 1}   -1.04{col 58}{space 3}0.297{col 66}{space 4} -.090148{col 79}{space 3} .0275638
{txt}area_business_total_base {c |}{col 26}{res}{space 2} -51.1939{col 38}{space 2} 421.0396{col 49}{space 1}   -0.12{col 58}{space 3}0.903{col 66}{space 4}-876.5632{col 79}{space 3} 774.1754
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2}  14.0207{col 38}{space 2} 4.275519{col 49}{space 1}    3.28{col 58}{space 3}0.001{col 66}{space 4} 5.639348{col 79}{space 3} 22.40206
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2}-6207.828{col 38}{space 2} 5204.403{col 49}{space 1}   -1.19{col 58}{space 3}0.233{col 66}{space 4}-16410.09{col 79}{space 3}  3994.43
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2} 35656.94{col 38}{space 2} 13669.36{col 49}{space 1}    2.61{col 58}{space 3}0.009{col 66}{space 4} 8860.706{col 79}{space 3} 62453.16
{txt}{space 19}_cons {c |}{col 26}{res}{space 2}-20667.03{col 38}{space 2} 8595.812{col 49}{space 1}   -2.40{col 58}{space 3}0.016{col 66}{space 4}-37517.51{col 79}{space 3} -3816.55
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 2}bank_amt_1 {c |}{res}      3,247    8422.431    101952.8          0    5000000
{txt}(sum of wgt is 6,651.52161359787)

Linear regression                               Number of obs     = {res}     6,811
                                                {txt}F(7, 6803)        =  {res}     3.46
                                                {txt}Prob > F          = {res}    0.0010
                                                {txt}R-squared         = {res}    0.0047
                                                {txt}Root MSE          =    {res}  86803

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}          informal_amt_1{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2}-1068.984{col 38}{space 2} 1999.351{col 49}{space 1}   -0.53{col 58}{space 3}0.593{col 66}{space 4}-4988.338{col 79}{space 3}  2850.37
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2}-7.218501{col 38}{space 2} 6.433392{col 49}{space 1}   -1.12{col 58}{space 3}0.262{col 66}{space 4}-19.82996{col 79}{space 3}  5.39296
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} .0997099{col 38}{space 2} .1025838{col 49}{space 1}    0.97{col 58}{space 3}0.331{col 66}{space 4}-.1013864{col 79}{space 3} .3008061
{txt}area_business_total_base {c |}{col 26}{res}{space 2}-782.0146{col 38}{space 2} 224.3527{col 49}{space 1}   -3.49{col 58}{space 3}0.000{col 66}{space 4}-1221.816{col 79}{space 3}-342.2131
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2} 20.80953{col 38}{space 2} 8.074997{col 49}{space 1}    2.58{col 58}{space 3}0.010{col 66}{space 4} 4.980007{col 79}{space 3} 36.63905
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2}-15584.54{col 38}{space 2} 8730.514{col 49}{space 1}   -1.79{col 58}{space 3}0.074{col 66}{space 4}-32699.07{col 79}{space 3} 1530.004
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2} 7713.198{col 38}{space 2}  18296.3{col 49}{space 1}    0.42{col 58}{space 3}0.673{col 66}{space 4}-28153.28{col 79}{space 3} 43579.68
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} 29371.25{col 38}{space 2} 11276.06{col 49}{space 1}    2.60{col 58}{space 3}0.009{col 66}{space 4} 7266.649{col 79}{space 3} 51475.85
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
informal_a~1 {c |}{res}      3,247    41044.62    78032.52          0    1650000
{txt}(sum of wgt is 6,702.52161359787)

Linear regression                               Number of obs     = {res}     6,862
                                                {txt}F(7, 6854)        =  {res}     3.43
                                                {txt}Prob > F          = {res}    0.0012
                                                {txt}R-squared         = {res}    0.0034
                                                {txt}Root MSE          =    {res} 1.7e+05

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}           anyloan_amt_1{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2} 2856.236{col 38}{space 2} 3917.529{col 49}{space 1}    0.73{col 58}{space 3}0.466{col 66}{space 4}-4823.335{col 79}{space 3} 10535.81
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2}-22.75524{col 38}{space 2} 10.20624{col 49}{space 1}   -2.23{col 58}{space 3}0.026{col 66}{space 4}-42.76263{col 79}{space 3}-2.747842
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} .1295937{col 38}{space 2} .1055358{col 49}{space 1}    1.23{col 58}{space 3}0.220{col 66}{space 4}-.0772892{col 79}{space 3} .3364766
{txt}area_business_total_base {c |}{col 26}{res}{space 2}-1148.216{col 38}{space 2} 524.2611{col 49}{space 1}   -2.19{col 58}{space 3}0.029{col 66}{space 4}-2175.931{col 79}{space 3}-120.5019
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2} 39.91257{col 38}{space 2}   14.039{col 49}{space 1}    2.84{col 58}{space 3}0.004{col 66}{space 4} 12.39177{col 79}{space 3} 67.43336
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2}-21983.32{col 38}{space 2} 12982.66{col 49}{space 1}   -1.69{col 58}{space 3}0.090{col 66}{space 4}-47433.37{col 79}{space 3} 3466.725
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2} 33871.93{col 38}{space 2} 29258.23{col 49}{space 1}    1.16{col 58}{space 3}0.247{col 66}{space 4}-23483.27{col 79}{space 3} 91227.13
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} 22063.04{col 38}{space 2} 15474.03{col 49}{space 1}    1.43{col 58}{space 3}0.154{col 66}{space 4}-8270.852{col 79}{space 3} 52396.93
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
anyloan_am~1 {c |}{res}      3,264    59836.27    133692.6          0    5000000
{txt}(sum of wgt is 6,702.52161359787)

Linear regression                               Number of obs     = {res}     6,862
                                                {txt}F(7, 6854)        =  {res}    18.90
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0203
                                                {txt}Root MSE          =    {res} .50385

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}          credit_index_1{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2} .1057547{col 38}{space 2} .0117005{col 49}{space 1}    9.04{col 58}{space 3}0.000{col 66}{space 4} .0828182{col 79}{space 3} .1286913
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2} .0000683{col 38}{space 2}  .000039{col 49}{space 1}    1.75{col 58}{space 3}0.079{col 66}{space 4}-8.01e-06{col 79}{space 3} .0001447
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} 1.53e-06{col 38}{space 2} 3.46e-07{col 49}{space 1}    4.42{col 58}{space 3}0.000{col 66}{space 4} 8.49e-07{col 79}{space 3} 2.21e-06
{txt}area_business_total_base {c |}{col 26}{res}{space 2}-.0048383{col 38}{space 2} .0012654{col 49}{space 1}   -3.82{col 58}{space 3}0.000{col 66}{space 4}-.0073188{col 79}{space 3}-.0023578
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2}-.0000184{col 38}{space 2} .0000363{col 49}{space 1}   -0.51{col 58}{space 3}0.611{col 66}{space 4}-.0000896{col 79}{space 3} .0000527
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2}-.2285552{col 38}{space 2} .0615087{col 49}{space 1}   -3.72{col 58}{space 3}0.000{col 66}{space 4}-.3491312{col 79}{space 3}-.1079791
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2} .3009112{col 38}{space 2} .1041559{col 49}{space 1}    2.89{col 58}{space 3}0.004{col 66}{space 4} .0967333{col 79}{space 3}  .505089
{txt}{space 19}_cons {c |}{col 26}{res}{space 2}-.0907979{col 38}{space 2} .0617001{col 49}{space 1}   -1.47{col 58}{space 3}0.141{col 66}{space 4}-.2117493{col 79}{space 3} .0301535
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
credit_ind~1 {c |}{res}      3,264    5.08e-09    .4595561  -.6389409   6.248938
{txt}
{com}. 
. *Endline 2
. est clear
{res}{txt}
{com}. foreach var in spandana_2 othermfi_2 anymfi_2 anybank_2 anyinformal_2 anyloan_2 everlate_2 mfi_loan_cycles_2 ///
>            spandana_amt_2 othermfi_amt_2 anymfi_amt_2 bank_amt_2 informal_amt_2 anyloan_amt_2 credit_index_2 {c -(}
{txt}  2{com}.     * Step 3a: Run regression with treatment and area controls, weighted by w2
.     reg `var' treatment $area_controls [pweight=w2], robust
{txt}  3{com}. 
.     * Step 3b: Calculate p-value for the treatment coefficient
.     scalar pval = 2 * ttail(e(df_r), abs(_b[treatment] / _se[treatment]))
{txt}  4{com}. 
.     * Step 3c: Summarize the variable for the control group at endline 2
.     sum `var' if treatment == 0 & e(sample)
{txt}  5{com}.     scalar mean_control = r(mean)
{txt}  6{com}.     scalar sd_control = r(sd)
{txt}  7{com}. 
.     * Step 3d: Store the regression results for this variable
.     est store `var'
{txt}  8{com}. {c )-}
{txt}(sum of wgt is 5,957.90570878983)

Linear regression                               Number of obs     = {res}     6,142
                                                {txt}F(7, 6134)        =  {res}    11.49
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0119
                                                {txt}Root MSE          =    {res} .33879

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}              spandana_2{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2} .0625908{col 38}{space 2} .0082734{col 49}{space 1}    7.57{col 58}{space 3}0.000{col 66}{space 4}  .046372{col 79}{space 3} .0788097
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2}-.0000637{col 38}{space 2} .0000274{col 49}{space 1}   -2.33{col 58}{space 3}0.020{col 66}{space 4}-.0001174{col 79}{space 3}-.0000101
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} 4.53e-07{col 38}{space 2} 1.95e-07{col 49}{space 1}    2.32{col 58}{space 3}0.020{col 66}{space 4} 7.02e-08{col 79}{space 3} 8.36e-07
{txt}area_business_total_base {c |}{col 26}{res}{space 2}-.0018853{col 38}{space 2} .0008318{col 49}{space 1}   -2.27{col 58}{space 3}0.023{col 66}{space 4} -.003516{col 79}{space 3}-.0002547
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2}-.0000477{col 38}{space 2} .0000272{col 49}{space 1}   -1.76{col 58}{space 3}0.079{col 66}{space 4} -.000101{col 79}{space 3} 5.55e-06
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2}-.0667348{col 38}{space 2} .0452258{col 49}{space 1}   -1.48{col 58}{space 3}0.140{col 66}{space 4}-.1553932{col 79}{space 3} .0219236
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2} .0940757{col 38}{space 2} .0762085{col 49}{space 1}    1.23{col 58}{space 3}0.217{col 66}{space 4}-.0553196{col 79}{space 3} .2434711
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} .1439002{col 38}{space 2} .0441553{col 49}{space 1}    3.26{col 58}{space 3}0.001{col 66}{space 4} .0573403{col 79}{space 3} .2304601
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 2}spandana_2 {c |}{res}      2,943    .1114509    .3147432          0          1
{txt}(sum of wgt is 5,957.90570878983)

Linear regression                               Number of obs     = {res}     6,142
                                                {txt}F(7, 6134)        =  {res}     9.90
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0117
                                                {txt}Root MSE          =    {res} .42922

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}              othermfi_2{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2}-.0387575{col 38}{space 2} .0110444{col 49}{space 1}   -3.51{col 58}{space 3}0.000{col 66}{space 4}-.0604084{col 79}{space 3}-.0171065
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2}-.0000527{col 38}{space 2} .0000378{col 49}{space 1}   -1.39{col 58}{space 3}0.163{col 66}{space 4}-.0001268{col 79}{space 3} .0000214
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2}-8.07e-07{col 38}{space 2} 1.84e-07{col 49}{space 1}   -4.38{col 58}{space 3}0.000{col 66}{space 4}-1.17e-06{col 79}{space 3}-4.45e-07
{txt}area_business_total_base {c |}{col 26}{res}{space 2} .0003896{col 38}{space 2} .0011492{col 49}{space 1}    0.34{col 58}{space 3}0.735{col 66}{space 4}-.0018632{col 79}{space 3} .0026425
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2} -.000033{col 38}{space 2} .0000337{col 49}{space 1}   -0.98{col 58}{space 3}0.327{col 66}{space 4}-.0000991{col 79}{space 3}  .000033
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2}-.3546357{col 38}{space 2} .0605663{col 49}{space 1}   -5.86{col 58}{space 3}0.000{col 66}{space 4}-.4733668{col 79}{space 3}-.2359045
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2} .3470311{col 38}{space 2} .0983034{col 49}{space 1}    3.53{col 58}{space 3}0.000{col 66}{space 4}  .154322{col 79}{space 3} .5397402
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} .3233602{col 38}{space 2} .0580224{col 49}{space 1}    5.57{col 58}{space 3}0.000{col 66}{space 4}  .209616{col 79}{space 3} .4371044
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 2}othermfi_2 {c |}{res}      2,943    .2684336    .4432197          0          1
{txt}(sum of wgt is 5,957.90570878983)

Linear regression                               Number of obs     = {res}     6,142
                                                {txt}F(7, 6134)        =  {res}     7.27
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0083
                                                {txt}Root MSE          =    {res}  .4669

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}                anymfi_2{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2} .0021354{col 38}{space 2} .0119333{col 49}{space 1}    0.18{col 58}{space 3}0.858{col 66}{space 4} -.021258{col 79}{space 3} .0255289
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2}-.0000723{col 38}{space 2} .0000406{col 49}{space 1}   -1.78{col 58}{space 3}0.075{col 66}{space 4}-.0001519{col 79}{space 3} 7.29e-06
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2}-4.33e-07{col 38}{space 2} 2.29e-07{col 49}{space 1}   -1.89{col 58}{space 3}0.059{col 66}{space 4}-8.82e-07{col 79}{space 3} 1.59e-08
{txt}area_business_total_base {c |}{col 26}{res}{space 2}-.0015032{col 38}{space 2} .0012451{col 49}{space 1}   -1.21{col 58}{space 3}0.227{col 66}{space 4}-.0039441{col 79}{space 3} .0009378
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2}-.0000542{col 38}{space 2} .0000367{col 49}{space 1}   -1.48{col 58}{space 3}0.140{col 66}{space 4}-.0001263{col 79}{space 3} .0000178
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2}-.3625886{col 38}{space 2} .0642894{col 49}{space 1}   -5.64{col 58}{space 3}0.000{col 66}{space 4}-.4886184{col 79}{space 3}-.2365588
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2}  .344901{col 38}{space 2} .1061864{col 49}{space 1}    3.25{col 58}{space 3}0.001{col 66}{space 4} .1367384{col 79}{space 3} .5530636
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} .4147019{col 38}{space 2} .0628491{col 49}{space 1}    6.60{col 58}{space 3}0.000{col 66}{space 4} .2914956{col 79}{space 3} .5379083
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}anymfi_2 {c |}{res}      2,943    .3309548    .4706368          0          1
{txt}(sum of wgt is 5,957.90570878983)

Linear regression                               Number of obs     = {res}     6,142
                                                {txt}F(7, 6134)        =  {res}     1.59
                                                {txt}Prob > F          = {res}    0.1325
                                                {txt}R-squared         = {res}    0.0018
                                                {txt}Root MSE          =    {res} .26133

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}               anybank_2{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2} .0007455{col 38}{space 2} .0068346{col 49}{space 1}    0.11{col 58}{space 3}0.913{col 66}{space 4}-.0126528{col 79}{space 3} .0141437
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2}-.0000417{col 38}{space 2} .0000227{col 49}{space 1}   -1.84{col 58}{space 3}0.066{col 66}{space 4}-.0000863{col 79}{space 3} 2.82e-06
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2}-2.11e-08{col 38}{space 2} 9.66e-08{col 49}{space 1}   -0.22{col 58}{space 3}0.827{col 66}{space 4}-2.10e-07{col 79}{space 3} 1.68e-07
{txt}area_business_total_base {c |}{col 26}{res}{space 2}-.0012436{col 38}{space 2} .0007103{col 49}{space 1}   -1.75{col 58}{space 3}0.080{col 66}{space 4} -.002636{col 79}{space 3} .0001489
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2}-.0000203{col 38}{space 2} .0000225{col 49}{space 1}   -0.90{col 58}{space 3}0.367{col 66}{space 4}-.0000644{col 79}{space 3} .0000238
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2} -.035125{col 38}{space 2}  .034829{col 49}{space 1}   -1.01{col 58}{space 3}0.313{col 66}{space 4} -.103402{col 79}{space 3} .0331521
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2} .1076184{col 38}{space 2}  .055951{col 49}{space 1}    1.92{col 58}{space 3}0.054{col 66}{space 4}-.0020652{col 79}{space 3} .2173021
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} .0643696{col 38}{space 2} .0350882{col 49}{space 1}    1.83{col 58}{space 3}0.067{col 66}{space 4}-.0044156{col 79}{space 3} .1331548
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 3}anybank_2 {c |}{res}      2,943    .0730547    .2602705          0          1
{txt}(sum of wgt is 5,957.90570878983)

Linear regression                               Number of obs     = {res}     6,142
                                                {txt}F(7, 6134)        =  {res}     6.76
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0076
                                                {txt}Root MSE          =    {res} .48809

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}           anyinformal_2{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2}  .002137{col 38}{space 2} .0126883{col 49}{space 1}    0.17{col 58}{space 3}0.866{col 66}{space 4}-.0227366{col 79}{space 3} .0270105
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2} .0000992{col 38}{space 2}  .000043{col 49}{space 1}    2.31{col 58}{space 3}0.021{col 66}{space 4} .0000149{col 79}{space 3} .0001836
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} 4.11e-07{col 38}{space 2} 2.30e-07{col 49}{space 1}    1.79{col 58}{space 3}0.074{col 66}{space 4}-3.93e-08{col 79}{space 3} 8.61e-07
{txt}area_business_total_base {c |}{col 26}{res}{space 2}-.0010682{col 38}{space 2} .0013421{col 49}{space 1}   -0.80{col 58}{space 3}0.426{col 66}{space 4}-.0036991{col 79}{space 3} .0015627
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2}-.0000762{col 38}{space 2} .0000389{col 49}{space 1}   -1.96{col 58}{space 3}0.050{col 66}{space 4}-.0001524{col 79}{space 3} 8.68e-08
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2} .0438784{col 38}{space 2} .0669131{col 49}{space 1}    0.66{col 58}{space 3}0.512{col 66}{space 4}-.0872948{col 79}{space 3} .1750515
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2}-.4332477{col 38}{space 2} .1105691{col 49}{space 1}   -3.92{col 58}{space 3}0.000{col 66}{space 4}-.6500018{col 79}{space 3}-.2164935
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} .9065527{col 38}{space 2}  .064853{col 49}{space 1}   13.98{col 58}{space 3}0.000{col 66}{space 4} .7794181{col 79}{space 3} 1.033687
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
anyinforma~2 {c |}{res}      2,943    .6034659    .4892608          0          1
{txt}(sum of wgt is 5,957.90570878983)

Linear regression                               Number of obs     = {res}     6,142
                                                {txt}F(7, 6134)        =  {res}     6.22
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0072
                                                {txt}Root MSE          =    {res} .29556

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}               anyloan_2{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2} .0002201{col 38}{space 2} .0077491{col 49}{space 1}    0.03{col 58}{space 3}0.977{col 66}{space 4}-.0149708{col 79}{space 3}  .015411
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2} 2.72e-06{col 38}{space 2} .0000259{col 49}{space 1}    0.11{col 58}{space 3}0.916{col 66}{space 4}-.0000481{col 79}{space 3} .0000535
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} 1.71e-08{col 38}{space 2} 1.73e-07{col 49}{space 1}    0.10{col 58}{space 3}0.921{col 66}{space 4}-3.23e-07{col 79}{space 3} 3.57e-07
{txt}area_business_total_base {c |}{col 26}{res}{space 2}-.0008122{col 38}{space 2} .0008316{col 49}{space 1}   -0.98{col 58}{space 3}0.329{col 66}{space 4}-.0024424{col 79}{space 3} .0008179
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2}-.0000322{col 38}{space 2} .0000224{col 49}{space 1}   -1.44{col 58}{space 3}0.151{col 66}{space 4}-.0000762{col 79}{space 3} .0000118
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2}-.0663382{col 38}{space 2} .0408495{col 49}{space 1}   -1.62{col 58}{space 3}0.104{col 66}{space 4}-.1464175{col 79}{space 3}  .013741
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2}-.1741993{col 38}{space 2} .0700938{col 49}{space 1}   -2.49{col 58}{space 3}0.013{col 66}{space 4}-.3116077{col 79}{space 3}-.0367908
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} 1.098302{col 38}{space 2} .0397558{col 49}{space 1}   27.63{col 58}{space 3}0.000{col 66}{space 4} 1.020366{col 79}{space 3} 1.176237
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 3}anyloan_2 {c |}{res}      2,943    .9041794    .2943951          0          1
{txt}(sum of wgt is 5,957.90570878983)

Linear regression                               Number of obs     = {res}     6,142
                                                {txt}F(7, 6134)        =  {res}     6.45
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0071
                                                {txt}Root MSE          =    {res} .48879

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}              everlate_2{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2} .0070295{col 38}{space 2}  .012705{col 49}{space 1}    0.55{col 58}{space 3}0.580{col 66}{space 4}-.0178768{col 79}{space 3} .0319358
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2}-.0000862{col 38}{space 2} .0000431{col 49}{space 1}   -2.00{col 58}{space 3}0.045{col 66}{space 4}-.0001706{col 79}{space 3}-1.78e-06
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} 4.62e-07{col 38}{space 2} 2.40e-07{col 49}{space 1}    1.92{col 58}{space 3}0.055{col 66}{space 4}-9.45e-09{col 79}{space 3} 9.33e-07
{txt}area_business_total_base {c |}{col 26}{res}{space 2}-.0010351{col 38}{space 2} .0013403{col 49}{space 1}   -0.77{col 58}{space 3}0.440{col 66}{space 4}-.0036625{col 79}{space 3} .0015923
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2}-.0001265{col 38}{space 2} .0000385{col 49}{space 1}   -3.28{col 58}{space 3}0.001{col 66}{space 4} -.000202{col 79}{space 3} -.000051
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2}-.0839235{col 38}{space 2} .0664811{col 49}{space 1}   -1.26{col 58}{space 3}0.207{col 66}{space 4}-.2142497{col 79}{space 3} .0464027
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2}-.1863798{col 38}{space 2} .1115571{col 49}{space 1}   -1.67{col 58}{space 3}0.095{col 66}{space 4}-.4050709{col 79}{space 3} .0323112
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} .9168961{col 38}{space 2} .0656793{col 49}{space 1}   13.96{col 58}{space 3}0.000{col 66}{space 4} .7881417{col 79}{space 3} 1.045651
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 2}everlate_2 {c |}{res}      2,943    .5980292    .4903794          0          1
{txt}(sum of wgt is 5,756.47931742668)

Linear regression                               Number of obs     = {res}     5,926
                                                {txt}F(7, 5918)        =  {res}     9.53
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0103
                                                {txt}Root MSE          =    {res} 1.0828

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}       mfi_loan_cycles_2{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2} .0845583{col 38}{space 2} .0280322{col 49}{space 1}    3.02{col 58}{space 3}0.003{col 66}{space 4} .0296049{col 79}{space 3} .1395116
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2} .0000845{col 38}{space 2} .0000959{col 49}{space 1}    0.88{col 58}{space 3}0.378{col 66}{space 4}-.0001035{col 79}{space 3} .0002725
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} 1.19e-06{col 38}{space 2} 6.76e-07{col 49}{space 1}    1.76{col 58}{space 3}0.079{col 66}{space 4}-1.37e-07{col 79}{space 3} 2.51e-06
{txt}area_business_total_base {c |}{col 26}{res}{space 2}-.0069377{col 38}{space 2} .0028184{col 49}{space 1}   -2.46{col 58}{space 3}0.014{col 66}{space 4}-.0124627{col 79}{space 3}-.0014127
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2}-.0000129{col 38}{space 2} .0000796{col 49}{space 1}   -0.16{col 58}{space 3}0.871{col 66}{space 4}-.0001691{col 79}{space 3} .0001432
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2}-.9576305{col 38}{space 2} .1527282{col 49}{space 1}   -6.27{col 58}{space 3}0.000{col 66}{space 4}-1.257034{col 79}{space 3}-.6582274
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2}  1.25438{col 38}{space 2} .2406109{col 49}{space 1}    5.21{col 58}{space 3}0.000{col 66}{space 4} .7826945{col 79}{space 3} 1.726065
{txt}{space 19}_cons {c |}{col 26}{res}{space 2}   .44066{col 38}{space 2} .1418316{col 49}{space 1}    3.11{col 58}{space 3}0.002{col 66}{space 4} .1626184{col 79}{space 3} .7187016
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
mfi_loan_c~2 {c |}{res}      2,863     .724405    1.098266          0         10
{txt}(sum of wgt is 5,957.90570878983)

Linear regression                               Number of obs     = {res}     6,142
                                                {txt}F(7, 6134)        =  {res}    11.13
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0090
                                                {txt}Root MSE          =    {res} 6236.4

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}          spandana_amt_2{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2} 979.4121{col 38}{space 2} 150.4021{col 49}{space 1}    6.51{col 58}{space 3}0.000{col 66}{space 4} 684.5712{col 79}{space 3} 1274.253
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2}-.5393264{col 38}{space 2} .5480921{col 49}{space 1}   -0.98{col 58}{space 3}0.325{col 66}{space 4}-1.613779{col 79}{space 3} .5351264
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} .0085045{col 38}{space 2} .0032147{col 49}{space 1}    2.65{col 58}{space 3}0.008{col 66}{space 4} .0022025{col 79}{space 3} .0148064
{txt}area_business_total_base {c |}{col 26}{res}{space 2}-33.47461{col 38}{space 2} 14.92834{col 49}{space 1}   -2.24{col 58}{space 3}0.025{col 66}{space 4} -62.7394{col 79}{space 3}-4.209823
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2}-1.178144{col 38}{space 2} .4711018{col 49}{space 1}   -2.50{col 58}{space 3}0.012{col 66}{space 4}-2.101668{col 79}{space 3}-.2546189
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2}-32.09286{col 38}{space 2} 823.7127{col 49}{space 1}   -0.04{col 58}{space 3}0.969{col 66}{space 4}-1646.859{col 79}{space 3} 1582.673
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2}-451.8967{col 38}{space 2} 1574.088{col 49}{space 1}   -0.29{col 58}{space 3}0.774{col 66}{space 4}-3537.661{col 79}{space 3} 2633.868
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} 3033.555{col 38}{space 2} 968.2345{col 49}{space 1}    3.13{col 58}{space 3}0.002{col 66}{space 4} 1135.476{col 79}{space 3} 4931.634
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
spandana_a~2 {c |}{res}      2,943     1566.64    5618.335          0   133276.6
{txt}(sum of wgt is 5,957.90570878983)

Linear regression                               Number of obs     = {res}     6,142
                                                {txt}F(7, 6134)        =  {res}     4.23
                                                {txt}Prob > F          = {res}    0.0001
                                                {txt}R-squared         = {res}    0.0041
                                                {txt}Root MSE          =    {res}  11309

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}          othermfi_amt_2{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2}-217.1031{col 38}{space 2} 292.2132{col 49}{space 1}   -0.74{col 58}{space 3}0.458{col 66}{space 4}-789.9434{col 79}{space 3} 355.7373
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2} .6339373{col 38}{space 2} .9683615{col 49}{space 1}    0.65{col 58}{space 3}0.513{col 66}{space 4}-1.264391{col 79}{space 3} 2.532266
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2}-.0070521{col 38}{space 2} .0047997{col 49}{space 1}   -1.47{col 58}{space 3}0.142{col 66}{space 4}-.0164611{col 79}{space 3} .0023569
{txt}area_business_total_base {c |}{col 26}{res}{space 2} 2.334396{col 38}{space 2} 30.62852{col 49}{space 1}    0.08{col 58}{space 3}0.939{col 66}{space 4}-57.70825{col 79}{space 3} 62.37704
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2}-2.058355{col 38}{space 2} .8828962{col 49}{space 1}   -2.33{col 58}{space 3}0.020{col 66}{space 4}-3.789141{col 79}{space 3}-.3275685
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2}-5167.302{col 38}{space 2} 1490.936{col 49}{space 1}   -3.47{col 58}{space 3}0.001{col 66}{space 4}-8090.061{col 79}{space 3}-2244.544
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2} 5636.978{col 38}{space 2} 2452.944{col 49}{space 1}    2.30{col 58}{space 3}0.022{col 66}{space 4} 828.3469{col 79}{space 3} 10445.61
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} 6102.483{col 38}{space 2}  1569.56{col 49}{space 1}    3.89{col 58}{space 3}0.000{col 66}{space 4} 3025.595{col 79}{space 3} 9179.371
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
othermfi_a~2 {c |}{res}      2,943    4775.059     10735.6          0     164000
{txt}(sum of wgt is 5,957.90570878983)

Linear regression                               Number of obs     = {res}     6,142
                                                {txt}F(7, 6134)        =  {res}     5.18
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0048
                                                {txt}Root MSE          =    {res}  12053

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}            anymfi_amt_2{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2} 798.5698{col 38}{space 2} 303.5792{col 49}{space 1}    2.63{col 58}{space 3}0.009{col 66}{space 4} 203.4482{col 79}{space 3} 1393.691
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2}  -.01127{col 38}{space 2} 1.030362{col 49}{space 1}   -0.01{col 58}{space 3}0.991{col 66}{space 4}-2.031142{col 79}{space 3} 2.008602
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} .0026302{col 38}{space 2} .0055448{col 49}{space 1}    0.47{col 58}{space 3}0.635{col 66}{space 4}-.0082394{col 79}{space 3} .0134999
{txt}area_business_total_base {c |}{col 26}{res}{space 2}-31.53011{col 38}{space 2} 31.49352{col 49}{space 1}   -1.00{col 58}{space 3}0.317{col 66}{space 4}-93.26846{col 79}{space 3} 30.20824
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2} -2.89271{col 38}{space 2}  .943255{col 49}{space 1}   -3.07{col 58}{space 3}0.002{col 66}{space 4} -4.74182{col 79}{space 3}-1.043599
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2}-4336.347{col 38}{space 2} 1602.382{col 49}{space 1}   -2.71{col 58}{space 3}0.007{col 66}{space 4}-7477.578{col 79}{space 3}-1195.115
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2} 4243.587{col 38}{space 2} 2749.919{col 49}{space 1}    1.54{col 58}{space 3}0.123{col 66}{space 4} -1147.22{col 79}{space 3} 9634.394
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} 8116.795{col 38}{space 2} 1728.316{col 49}{space 1}    4.70{col 58}{space 3}0.000{col 66}{space 4} 4728.689{col 79}{space 3}  11504.9
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
anymfi_amt_2 {c |}{res}      2,943    5544.164    11347.59          0   146604.3
{txt}(sum of wgt is 5,957.90570878983)

Linear regression                               Number of obs     = {res}     6,142
                                                {txt}F(7, 6134)        =  {res}     2.52
                                                {txt}Prob > F          = {res}    0.0139
                                                {txt}R-squared         = {res}    0.0043
                                                {txt}Root MSE          =    {res}  35819

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}              bank_amt_2{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2}-1180.783{col 38}{space 2} 944.2181{col 49}{space 1}   -1.25{col 58}{space 3}0.211{col 66}{space 4}-3031.782{col 79}{space 3} 670.2156
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2}-.9162888{col 38}{space 2} 3.290805{col 49}{space 1}   -0.28{col 58}{space 3}0.781{col 66}{space 4}-7.367421{col 79}{space 3} 5.534844
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} -.018718{col 38}{space 2} .0126746{col 49}{space 1}   -1.48{col 58}{space 3}0.140{col 66}{space 4}-.0435646{col 79}{space 3} .0061286
{txt}area_business_total_base {c |}{col 26}{res}{space 2} -115.111{col 38}{space 2} 96.36134{col 49}{space 1}   -1.19{col 58}{space 3}0.232{col 66}{space 4}-304.0131{col 79}{space 3}   73.791
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2} 4.529717{col 38}{space 2} 2.725996{col 49}{space 1}    1.66{col 58}{space 3}0.097{col 66}{space 4}-.8141907{col 79}{space 3} 9.873626
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2} 2383.679{col 38}{space 2} 4701.407{col 49}{space 1}    0.51{col 58}{space 3}0.612{col 66}{space 4}-6832.728{col 79}{space 3} 11600.09
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2} 20384.59{col 38}{space 2} 7318.814{col 49}{space 1}    2.79{col 58}{space 3}0.005{col 66}{space 4} 6037.148{col 79}{space 3} 34732.04
{txt}{space 19}_cons {c |}{col 26}{res}{space 2}-11766.82{col 38}{space 2} 4773.702{col 49}{space 1}   -2.46{col 58}{space 3}0.014{col 66}{space 4}-21124.95{col 79}{space 3}-2408.689
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 2}bank_amt_2 {c |}{res}      2,943    6126.523    40307.63          0   832978.9
{txt}(sum of wgt is 5,957.90570878983)

Linear regression                               Number of obs     = {res}     6,142
                                                {txt}F(7, 6134)        =  {res}     2.11
                                                {txt}Prob > F          = {res}    0.0393
                                                {txt}R-squared         = {res}    0.0026
                                                {txt}Root MSE          =    {res}  80450

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}          informal_amt_2{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2} 158.2941{col 38}{space 2}  2063.72{col 49}{space 1}    0.08{col 58}{space 3}0.939{col 66}{space 4} -3887.32{col 79}{space 3} 4203.908
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2}-2.380037{col 38}{space 2} 6.414644{col 49}{space 1}   -0.37{col 58}{space 3}0.711{col 66}{space 4}-14.95499{col 79}{space 3} 10.19492
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2}  .095449{col 38}{space 2} .0443662{col 49}{space 1}    2.15{col 58}{space 3}0.031{col 66}{space 4} .0084756{col 79}{space 3} .1824224
{txt}area_business_total_base {c |}{col 26}{res}{space 2}-300.3636{col 38}{space 2} 247.6184{col 49}{space 1}   -1.21{col 58}{space 3}0.225{col 66}{space 4}-785.7826{col 79}{space 3} 185.0554
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2}   8.9145{col 38}{space 2} 6.594371{col 49}{space 1}    1.35{col 58}{space 3}0.176{col 66}{space 4} -4.01278{col 79}{space 3} 21.84178
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2}-2768.855{col 38}{space 2} 10028.83{col 49}{space 1}   -0.28{col 58}{space 3}0.782{col 66}{space 4}-22428.88{col 79}{space 3} 16891.17
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2}-19971.33{col 38}{space 2} 16880.37{col 49}{space 1}   -1.18{col 58}{space 3}0.237{col 66}{space 4}-53062.77{col 79}{space 3} 13120.11
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} 38332.86{col 38}{space 2} 10450.67{col 49}{space 1}    3.67{col 58}{space 3}0.000{col 66}{space 4} 17845.88{col 79}{space 3} 58819.85
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
informal_a~2 {c |}{res}      2,943    32355.99    76704.16          0    1266128
{txt}(sum of wgt is 5,957.90570878983)

Linear regression                               Number of obs     = {res}     6,142
                                                {txt}F(7, 6134)        =  {res}     2.34
                                                {txt}Prob > F          = {res}    0.0221
                                                {txt}R-squared         = {res}    0.0033
                                                {txt}Root MSE          =    {res} 1.5e+05

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}           anyloan_amt_2{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2} 2554.018{col 38}{space 2} 3864.521{col 49}{space 1}    0.66{col 58}{space 3}0.509{col 66}{space 4}  -5021.8{col 79}{space 3} 10129.84
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2}-9.483572{col 38}{space 2} 12.34136{col 49}{space 1}   -0.77{col 58}{space 3}0.442{col 66}{space 4}-33.67697{col 79}{space 3} 14.70983
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} .1010647{col 38}{space 2} .0682212{col 49}{space 1}    1.48{col 58}{space 3}0.139{col 66}{space 4}-.0326728{col 79}{space 3} .2348021
{txt}area_business_total_base {c |}{col 26}{res}{space 2}-1604.984{col 38}{space 2} 456.3217{col 49}{space 1}   -3.52{col 58}{space 3}0.000{col 66}{space 4}-2499.535{col 79}{space 3}-710.4339
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2} 13.97344{col 38}{space 2} 12.85142{col 49}{space 1}    1.09{col 58}{space 3}0.277{col 66}{space 4}-11.21985{col 79}{space 3} 39.16673
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2} 5485.492{col 38}{space 2} 19781.38{col 49}{space 1}    0.28{col 58}{space 3}0.782{col 66}{space 4}-33292.95{col 79}{space 3} 44263.94
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2}-14797.26{col 38}{space 2} 32876.07{col 49}{space 1}   -0.45{col 58}{space 3}0.653{col 66}{space 4}-79245.89{col 79}{space 3} 49651.36
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} 92697.42{col 38}{space 2} 20870.61{col 49}{space 1}    4.44{col 58}{space 3}0.000{col 66}{space 4}  51783.7{col 79}{space 3} 133611.1
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
anyloan_am~2 {c |}{res}      2,943    88631.46    144634.3          0    2520000
{txt}(sum of wgt is 5,957.90570878983)

Linear regression                               Number of obs     = {res}     6,142
                                                {txt}F(7, 6134)        =  {res}     5.67
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0062
                                                {txt}Root MSE          =    {res} .47504

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}          credit_index_2{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2}  .028842{col 38}{space 2} .0120395{col 49}{space 1}    2.40{col 58}{space 3}0.017{col 66}{space 4} .0052404{col 79}{space 3} .0524436
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2}-.0000235{col 38}{space 2} .0000404{col 49}{space 1}   -0.58{col 58}{space 3}0.560{col 66}{space 4}-.0001027{col 79}{space 3} .0000556
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} 1.47e-07{col 38}{space 2} 2.45e-07{col 49}{space 1}    0.60{col 58}{space 3}0.549{col 66}{space 4}-3.34e-07{col 79}{space 3} 6.28e-07
{txt}area_business_total_base {c |}{col 26}{res}{space 2}-.0034499{col 38}{space 2} .0012747{col 49}{space 1}   -2.71{col 58}{space 3}0.007{col 66}{space 4}-.0059488{col 79}{space 3} -.000951
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2}-.0000549{col 38}{space 2}  .000037{col 49}{space 1}   -1.48{col 58}{space 3}0.138{col 66}{space 4}-.0001274{col 79}{space 3} .0000176
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2}-.2522681{col 38}{space 2} .0641182{col 49}{space 1}   -3.93{col 58}{space 3}0.000{col 66}{space 4}-.3779624{col 79}{space 3}-.1265739
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2} .2272751{col 38}{space 2} .1077641{col 49}{space 1}    2.11{col 58}{space 3}0.035{col 66}{space 4} .0160197{col 79}{space 3} .4385306
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} .0739559{col 38}{space 2} .0651029{col 49}{space 1}    1.14{col 58}{space 3}0.256{col 66}{space 4}-.0536686{col 79}{space 3} .2015805
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
credit_ind~2 {c |}{res}      2,943   -2.82e-09    .4654905  -.5776622   4.082351
{txt}
{com}. ***Conclusion: Standard errors are notably less when using robust standard errors in the regression, compared to using the cluster standard error (taking into account within cluster correlation)
. ***This means that within-cluster correlation is likely and that clustering should be taken into account when running the regression. 
. 
. *Sensitivity to outliers and influential data point*
. 
. 
. ***Tabel 5: Household Labor Hours***
. ************************************
. // Load the dataset
. use "$datadir/2013-0533_data_endlines1and2.dta", clear
{txt}(Endline data for "The miracle of microfinance?" (Banerjee et al.), AEJ 2014)

{com}. 
. 
. ***PANEL A: ENDLINE 1***
. est clear
{res}{txt}
{com}. 
. foreach var in hours_week_1 hours_week_biz_1 hours_week_outside_1 ///
>                            hours_girl1620_week_1 hours_boy1620_week_1 ///
>                hours_headspouse_week_1 hours_headspouse_biz_1 hours_headspouse_outside_1 labor_index_1 {c -(}
{txt}  2{com}.    reg `var' treatment $area_controls [pweight=w1], cluster(areaid)
{txt}  3{com}.    scalar pval = 2 * ttail(e(df_r), abs(_b[treatment] / _se[treatment]))
{txt}  4{com}.    sum `var' if treatment == 0 & e(sample)
{txt}  5{com}.    scalar mn1 = r(mean)
{txt}  6{com}.    scalar sd1 = r(sd)
{txt}  7{com}.     
.    est store `var'
{txt}  8{com}. {c )-}
{txt}(sum of wgt is 6,667.79646992683)

Linear regression                               Number of obs     = {res}     6,827
                                                {txt}F(7, 103)         =  {res}     0.74
                                                {txt}Prob > F          = {res}    0.6377
                                                {txt}R-squared         = {res}    0.0021
                                                {txt}Root MSE          =    {res}  59.15

{txt}{ralign 90:(Std. err. adjusted for {res:104} clusters in {res:areaid})}
{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}            hours_week_1{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2} .7385057{col 38}{space 2} 2.245346{col 49}{space 1}    0.33{col 58}{space 3}0.743{col 66}{space 4}-3.714609{col 79}{space 3} 5.191621
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2} .0011841{col 38}{space 2} .0088363{col 49}{space 1}    0.13{col 58}{space 3}0.894{col 66}{space 4}-.0163407{col 79}{space 3} .0187089
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} 8.98e-06{col 38}{space 2} .0000414{col 49}{space 1}    0.22{col 58}{space 3}0.829{col 66}{space 4}-.0000732{col 79}{space 3} .0000912
{txt}area_business_total_base {c |}{col 26}{res}{space 2} .3358301{col 38}{space 2} .2139582{col 49}{space 1}    1.57{col 58}{space 3}0.120{col 66}{space 4}-.0885056{col 79}{space 3} .7601658
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2} .0090751{col 38}{space 2} .0069768{col 49}{space 1}    1.30{col 58}{space 3}0.196{col 66}{space 4}-.0047617{col 79}{space 3} .0229119
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2}-2.265888{col 38}{space 2} 12.85038{col 49}{space 1}   -0.18{col 58}{space 3}0.860{col 66}{space 4}-27.75158{col 79}{space 3}  23.2198
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2}-10.67146{col 38}{space 2} 19.19624{col 49}{space 1}   -0.56{col 58}{space 3}0.579{col 66}{space 4}-48.74268{col 79}{space 3} 27.39977
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} 88.86234{col 38}{space 2} 9.791464{col 49}{space 1}    9.08{col 58}{space 3}0.000{col 66}{space 4} 69.44328{col 79}{space 3} 108.2814
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
hours_week_1 {c |}{res}      3,248    92.38023    61.57719          0        710
{txt}(sum of wgt is 6,604.720662117)

Linear regression                               Number of obs     = {res}     6,762
                                                {txt}F(7, 103)         =  {res}     1.64
                                                {txt}Prob > F          = {res}    0.1324
                                                {txt}R-squared         = {res}    0.0036
                                                {txt}Root MSE          =    {res} 62.237

{txt}{ralign 90:(Std. err. adjusted for {res:104} clusters in {res:areaid})}
{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}        hours_week_biz_1{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2} 2.465725{col 38}{space 2} 2.361362{col 49}{space 1}    1.04{col 58}{space 3}0.299{col 66}{space 4} -2.21748{col 79}{space 3}  7.14893
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2}-.0040547{col 38}{space 2}  .007271{col 49}{space 1}   -0.56{col 58}{space 3}0.578{col 66}{space 4}-.0184749{col 79}{space 3} .0103655
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} .0000452{col 38}{space 2} .0000379{col 49}{space 1}    1.19{col 58}{space 3}0.235{col 66}{space 4}-.0000299{col 79}{space 3} .0001204
{txt}area_business_total_base {c |}{col 26}{res}{space 2} .3931474{col 38}{space 2} .2230087{col 49}{space 1}    1.76{col 58}{space 3}0.081{col 66}{space 4}-.0491377{col 79}{space 3} .8354326
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2} .0098114{col 38}{space 2} .0071998{col 49}{space 1}    1.36{col 58}{space 3}0.176{col 66}{space 4}-.0044677{col 79}{space 3} .0240904
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2}-7.213877{col 38}{space 2} 11.52789{col 49}{space 1}   -0.63{col 58}{space 3}0.533{col 66}{space 4}-30.07673{col 79}{space 3} 15.64898
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2}-5.295397{col 38}{space 2}   21.043{col 49}{space 1}   -0.25{col 58}{space 3}0.802{col 66}{space 4}-47.02922{col 79}{space 3} 36.43843
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} 29.39285{col 38}{space 2} 11.63008{col 49}{space 1}    2.53{col 58}{space 3}0.013{col 66}{space 4} 6.327337{col 79}{space 3} 52.45836
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
hours_we~z_1 {c |}{res}      3,209    34.38174    62.72707          0        710
{txt}(sum of wgt is 6,604.720662117)

Linear regression                               Number of obs     = {res}     6,762
                                                {txt}F(7, 103)         =  {res}     0.46
                                                {txt}Prob > F          = {res}    0.8588
                                                {txt}R-squared         = {res}    0.0010
                                                {txt}Root MSE          =    {res} 60.614

{txt}{ralign 90:(Std. err. adjusted for {res:104} clusters in {res:areaid})}
{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}    hours_week_outside_1{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2}-2.033179{col 38}{space 2} 2.741019{col 49}{space 1}   -0.74{col 58}{space 3}0.460{col 66}{space 4}-7.469344{col 79}{space 3} 3.402986
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2} .0057784{col 38}{space 2} .0089468{col 49}{space 1}    0.65{col 58}{space 3}0.520{col 66}{space 4}-.0119655{col 79}{space 3} .0235222
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2}-.0000413{col 38}{space 2} .0000457{col 49}{space 1}   -0.90{col 58}{space 3}0.368{col 66}{space 4}-.0001319{col 79}{space 3} .0000493
{txt}area_business_total_base {c |}{col 26}{res}{space 2}-.0697846{col 38}{space 2} .2746659{col 49}{space 1}   -0.25{col 58}{space 3}0.800{col 66}{space 4}-.6145196{col 79}{space 3} .4749504
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2}-.0007359{col 38}{space 2} .0095437{col 49}{space 1}   -0.08{col 58}{space 3}0.939{col 66}{space 4}-.0196635{col 79}{space 3} .0181918
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2} 3.872285{col 38}{space 2} 14.98661{col 49}{space 1}    0.26{col 58}{space 3}0.797{col 66}{space 4}-25.85013{col 79}{space 3}  33.5947
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2}-4.197468{col 38}{space 2} 25.28098{col 49}{space 1}   -0.17{col 58}{space 3}0.868{col 66}{space 4}-54.33634{col 79}{space 3}  45.9414
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} 59.43322{col 38}{space 2} 14.34216{col 49}{space 1}    4.14{col 58}{space 3}0.000{col 66}{space 4} 30.98892{col 79}{space 3} 87.87752
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
hours_we~e_1 {c |}{res}      3,209    58.00717    62.17166          0        424
{txt}(sum of wgt is 2,125.49227452278)

Linear regression                               Number of obs     = {res}     2,174
                                                {txt}F(7, 102)         =  {res}     1.24
                                                {txt}Prob > F          = {res}    0.2877
                                                {txt}R-squared         = {res}    0.0061
                                                {txt}Root MSE          =    {res} 18.874

{txt}{ralign 90:(Std. err. adjusted for {res:103} clusters in {res:areaid})}
{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}   hours_girl1620_week_1{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2}-2.076419{col 38}{space 2} 1.046215{col 49}{space 1}   -1.98{col 58}{space 3}0.050{col 66}{space 4}-4.151581{col 79}{space 3}-.0012565
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2}-.0031962{col 38}{space 2} .0029989{col 49}{space 1}   -1.07{col 58}{space 3}0.289{col 66}{space 4}-.0091444{col 79}{space 3} .0027521
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} .0000122{col 38}{space 2} .0000135{col 49}{space 1}    0.90{col 58}{space 3}0.371{col 66}{space 4}-.0000147{col 79}{space 3}  .000039
{txt}area_business_total_base {c |}{col 26}{res}{space 2} .0349745{col 38}{space 2} .0837681{col 49}{space 1}    0.42{col 58}{space 3}0.677{col 66}{space 4}-.1311791{col 79}{space 3} .2011281
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2}-.0006829{col 38}{space 2} .0031362{col 49}{space 1}   -0.22{col 58}{space 3}0.828{col 66}{space 4}-.0069035{col 79}{space 3} .0055377
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2}-6.221567{col 38}{space 2} 6.558472{col 49}{space 1}   -0.95{col 58}{space 3}0.345{col 66}{space 4}-19.23027{col 79}{space 3}  6.78713
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2} 4.890534{col 38}{space 2} 9.497351{col 49}{space 1}    0.51{col 58}{space 3}0.608{col 66}{space 4}-13.94742{col 79}{space 3} 23.72849
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} 9.323768{col 38}{space 2}  3.59297{col 49}{space 1}    2.60{col 58}{space 3}0.011{col 66}{space 4} 2.197129{col 79}{space 3} 16.45041
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
hours_girl~1 {c |}{res}      1,037    7.935391    20.37772          0        140
{txt}(sum of wgt is 1,821.56915694475)

Linear regression                               Number of obs     = {res}     1,866
                                                {txt}F(7, 102)         =  {res}     1.01
                                                {txt}Prob > F          = {res}    0.4266
                                                {txt}R-squared         = {res}    0.0044
                                                {txt}Root MSE          =    {res} 35.984

{txt}{ralign 90:(Std. err. adjusted for {res:103} clusters in {res:areaid})}
{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}    hours_boy1620_week_1{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2}-.0260797{col 38}{space 2} 2.065322{col 49}{space 1}   -0.01{col 58}{space 3}0.990{col 66}{space 4}-4.122636{col 79}{space 3} 4.070477
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2}-.0030251{col 38}{space 2} .0071866{col 49}{space 1}   -0.42{col 58}{space 3}0.675{col 66}{space 4}-.0172797{col 79}{space 3} .0112295
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2}-7.59e-06{col 38}{space 2} .0000278{col 49}{space 1}   -0.27{col 58}{space 3}0.785{col 66}{space 4}-.0000628{col 79}{space 3} .0000476
{txt}area_business_total_base {c |}{col 26}{res}{space 2}-.0805683{col 38}{space 2} .1887383{col 49}{space 1}   -0.43{col 58}{space 3}0.670{col 66}{space 4}-.4549299{col 79}{space 3} .2937933
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2}-.0009976{col 38}{space 2} .0053569{col 49}{space 1}   -0.19{col 58}{space 3}0.853{col 66}{space 4}-.0116231{col 79}{space 3} .0096278
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2} 4.084136{col 38}{space 2}  12.3842{col 49}{space 1}    0.33{col 58}{space 3}0.742{col 66}{space 4}-20.47987{col 79}{space 3} 28.64815
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2}-31.78498{col 38}{space 2} 16.35302{col 49}{space 1}   -1.94{col 58}{space 3}0.055{col 66}{space 4}-64.22113{col 79}{space 3} .6511654
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} 47.06108{col 38}{space 2} 10.68265{col 49}{space 1}    4.41{col 58}{space 3}0.000{col 66}{space 4} 25.87209{col 79}{space 3} 68.25008
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
hours_boy1~1 {c |}{res}        876    25.12329    35.82463          0        330
{txt}(sum of wgt is 6,667.79646992683)

Linear regression                               Number of obs     = {res}     6,827
                                                {txt}F(7, 103)         =  {res}     1.44
                                                {txt}Prob > F          = {res}    0.1993
                                                {txt}R-squared         = {res}    0.0042
                                                {txt}Root MSE          =    {res} 36.137

{txt}{ralign 90:(Std. err. adjusted for {res:104} clusters in {res:areaid})}
{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1} hours_headspouse_week_1{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2} 3.176119{col 38}{space 2} 1.421326{col 49}{space 1}    2.23{col 58}{space 3}0.028{col 66}{space 4} .3572529{col 79}{space 3} 5.994984
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2}-.0042734{col 38}{space 2} .0045159{col 49}{space 1}   -0.95{col 58}{space 3}0.346{col 66}{space 4}-.0132297{col 79}{space 3} .0046828
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} 3.03e-06{col 38}{space 2}  .000022{col 49}{space 1}    0.14{col 58}{space 3}0.891{col 66}{space 4}-.0000406{col 79}{space 3} .0000467
{txt}area_business_total_base {c |}{col 26}{res}{space 2} .0997914{col 38}{space 2} .1387688{col 49}{space 1}    0.72{col 58}{space 3}0.474{col 66}{space 4}-.1754238{col 79}{space 3} .3750066
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2} .0024348{col 38}{space 2} .0043542{col 49}{space 1}    0.56{col 58}{space 3}0.577{col 66}{space 4}-.0062008{col 79}{space 3} .0110704
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2} 3.517176{col 38}{space 2} 7.593863{col 49}{space 1}    0.46{col 58}{space 3}0.644{col 66}{space 4}-11.54346{col 79}{space 3} 18.57781
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2}-21.48882{col 38}{space 2} 13.64296{col 49}{space 1}   -1.58{col 58}{space 3}0.118{col 66}{space 4}-48.54641{col 79}{space 3} 5.568776
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} 68.34487{col 38}{space 2} 6.840426{col 49}{space 1}    9.99{col 58}{space 3}0.000{col 66}{space 4} 54.77849{col 79}{space 3} 81.91124
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
hours_he~k_1 {c |}{res}      3,248     57.7911    35.90311          0        238
{txt}(sum of wgt is 6,667.79646992683)

Linear regression                               Number of obs     = {res}     6,827
                                                {txt}F(7, 103)         =  {res}     4.75
                                                {txt}Prob > F          = {res}    0.0001
                                                {txt}R-squared         = {res}    0.0067
                                                {txt}Root MSE          =    {res} 35.791

{txt}{ralign 90:(Std. err. adjusted for {res:104} clusters in {res:areaid})}
{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}  hours_headspouse_biz_1{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2} 2.709758{col 38}{space 2} 1.474219{col 49}{space 1}    1.84{col 58}{space 3}0.069{col 66}{space 4}-.2140069{col 79}{space 3} 5.633523
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2} -.001594{col 38}{space 2} .0046836{col 49}{space 1}   -0.34{col 58}{space 3}0.734{col 66}{space 4}-.0108828{col 79}{space 3} .0076947
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} .0000617{col 38}{space 2} .0000209{col 49}{space 1}    2.95{col 58}{space 3}0.004{col 66}{space 4} .0000203{col 79}{space 3} .0001031
{txt}area_business_total_base {c |}{col 26}{res}{space 2} .1222752{col 38}{space 2} .1400895{col 49}{space 1}    0.87{col 58}{space 3}0.385{col 66}{space 4}-.1555593{col 79}{space 3} .4001096
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2}-.0036093{col 38}{space 2} .0038924{col 49}{space 1}   -0.93{col 58}{space 3}0.356{col 66}{space 4} -.011329{col 79}{space 3} .0041104
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2} 5.026857{col 38}{space 2} 7.510656{col 49}{space 1}    0.67{col 58}{space 3}0.505{col 66}{space 4}-9.868758{col 79}{space 3} 19.92247
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2}-28.11695{col 38}{space 2} 12.50957{col 49}{space 1}   -2.25{col 58}{space 3}0.027{col 66}{space 4}-52.92673{col 79}{space 3}-3.307165
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} 42.73311{col 38}{space 2} 6.249236{col 49}{space 1}    6.84{col 58}{space 3}0.000{col 66}{space 4} 30.33922{col 79}{space 3} 55.12699
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
hours_he~z_1 {c |}{res}      3,248    25.82805    34.57243          0        224
{txt}(sum of wgt is 6,667.79646992683)

Linear regression                               Number of obs     = {res}     6,827
                                                {txt}F(7, 103)         =  {res}     2.01
                                                {txt}Prob > F          = {res}    0.0605
                                                {txt}R-squared         = {res}    0.0032
                                                {txt}Root MSE          =    {res} 34.039

{txt}{ralign 90:(Std. err. adjusted for {res:104} clusters in {res:areaid})}
{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}hours_headspouse_outsi~1{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2} .4663605{col 38}{space 2} 1.418253{col 49}{space 1}    0.33{col 58}{space 3}0.743{col 66}{space 4}-2.346409{col 79}{space 3}  3.27913
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2}-.0026794{col 38}{space 2} .0043948{col 49}{space 1}   -0.61{col 58}{space 3}0.543{col 66}{space 4}-.0113955{col 79}{space 3} .0060367
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2}-.0000587{col 38}{space 2} .0000172{col 49}{space 1}   -3.41{col 58}{space 3}0.001{col 66}{space 4}-.0000927{col 79}{space 3}-.0000246
{txt}area_business_total_base {c |}{col 26}{res}{space 2}-.0224838{col 38}{space 2} .1569184{col 49}{space 1}   -0.14{col 58}{space 3}0.886{col 66}{space 4}-.3336945{col 79}{space 3} .2887269
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2} .0060442{col 38}{space 2} .0041201{col 49}{space 1}    1.47{col 58}{space 3}0.145{col 66}{space 4}-.0021271{col 79}{space 3} .0142154
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2}-1.509681{col 38}{space 2} 6.891755{col 49}{space 1}   -0.22{col 58}{space 3}0.827{col 66}{space 4}-15.17785{col 79}{space 3} 12.15849
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2} 6.628133{col 38}{space 2} 13.26055{col 49}{space 1}    0.50{col 58}{space 3}0.618{col 66}{space 4}-19.67105{col 79}{space 3} 32.92732
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} 25.61176{col 38}{space 2} 7.748218{col 49}{space 1}    3.31{col 58}{space 3}0.001{col 66}{space 4}   10.245{col 79}{space 3} 40.97852
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
hours_he~e_1 {c |}{res}      3,248    31.96305    34.35907          0        216
{txt}(sum of wgt is 6,689.52161359787)

Linear regression                               Number of obs     = {res}     6,849
                                                {txt}F(7, 103)         =  {res}     0.64
                                                {txt}Prob > F          = {res}    0.7192
                                                {txt}R-squared         = {res}    0.0024
                                                {txt}Root MSE          =    {res} .43679

{txt}{ralign 90:(Std. err. adjusted for {res:104} clusters in {res:areaid})}
{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}           labor_index_1{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2} .0064653{col 38}{space 2}  .017867{col 49}{space 1}    0.36{col 58}{space 3}0.718{col 66}{space 4}-.0289696{col 79}{space 3} .0419003
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2}-.0000381{col 38}{space 2} .0000654{col 49}{space 1}   -0.58{col 58}{space 3}0.561{col 66}{space 4}-.0001678{col 79}{space 3} .0000916
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} 6.01e-08{col 38}{space 2} 3.19e-07{col 49}{space 1}    0.19{col 58}{space 3}0.851{col 66}{space 4}-5.73e-07{col 79}{space 3} 6.93e-07
{txt}area_business_total_base {c |}{col 26}{res}{space 2} .0017913{col 38}{space 2} .0016855{col 49}{space 1}    1.06{col 58}{space 3}0.290{col 66}{space 4}-.0015514{col 79}{space 3}  .005134
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2} .0000418{col 38}{space 2} .0000554{col 49}{space 1}    0.75{col 58}{space 3}0.452{col 66}{space 4} -.000068{col 79}{space 3} .0001516
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2} .0103884{col 38}{space 2}  .109486{col 49}{space 1}    0.09{col 58}{space 3}0.925{col 66}{space 4}-.2067512{col 79}{space 3} .2275281
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2}-.2148556{col 38}{space 2} .1732549{col 49}{space 1}   -1.24{col 58}{space 3}0.218{col 66}{space 4}-.5584658{col 79}{space 3} .1287546
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} .0949451{col 38}{space 2} .0822278{col 49}{space 1}    1.15{col 58}{space 3}0.251{col 66}{space 4}-.0681343{col 79}{space 3} .2580245
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
labor_inde~1 {c |}{res}      3,260   -2.13e-09    .4498612  -.8818678    4.07379
{txt}
{com}. 
. estout * using "table5r.tex", drop($area_controls _cons) ///
>     title("Table 5: Time worked by household members, Endline 1") ///
>     prehead("" @title) cells(b(fmt(a3) s) se(fmt(a3) par("="("[" "]")))) ///
>     replace s(r2 mn1 sd1 N pval) starlevels(* .1 ** .05 *** .01) legend ///
>     postfoot("Robust standard errors, clustered at the area level, in brackets.")
{res}{txt}{p 0 4 2}
(file {bf}
table5r.tex{rm}
not found)
{p_end}
(output written to {browse  `"table5r.tex"'})

{com}. 
. ***PANEL B: ENDLINE 2***
. est clear
{res}{txt}
{com}. 
. foreach var in hours_week_2 hours_week_biz_2 hours_week_outside_2 ///
>                            hours_girl1620_week_2 hours_boy1620_week_2 ///
>                 hours_headspouse_week_2 hours_headspouse_biz_2 hours_headspouse_outside_2 labor_index_2 {c -(}
{txt}  2{com}.     reg `var' treatment $area_controls [pweight=w2], cluster(areaid)
{txt}  3{com}.     scalar pval = 2 * ttail(e(df_r), abs(_b[treatment] / _se[treatment]))
{txt}  4{com}.     sum `var' if treatment == 0 & e(sample)
{txt}  5{com}.     scalar mn2 = r(mean)
{txt}  6{com}.     scalar sd2 = r(sd)
{txt}  7{com}.     
.     est store `var'
{txt}  8{com}. {c )-}
{txt}(sum of wgt is 5,957.90570878983)

Linear regression                               Number of obs     = {res}     6,142
                                                {txt}F(7, 103)         =  {res}     5.03
                                                {txt}Prob > F          = {res}    0.0001
                                                {txt}R-squared         = {res}    0.0057
                                                {txt}Root MSE          =    {res} 56.569

{txt}{ralign 90:(Std. err. adjusted for {res:104} clusters in {res:areaid})}
{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}            hours_week_2{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2}-1.237605{col 38}{space 2} 1.544327{col 49}{space 1}   -0.80{col 58}{space 3}0.425{col 66}{space 4}-4.300414{col 79}{space 3} 1.825204
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2}-.0101695{col 38}{space 2} .0054362{col 49}{space 1}   -1.87{col 58}{space 3}0.064{col 66}{space 4}-.0209509{col 79}{space 3}  .000612
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} .0000402{col 38}{space 2} .0000318{col 49}{space 1}    1.27{col 58}{space 3}0.209{col 66}{space 4}-.0000228{col 79}{space 3} .0001033
{txt}area_business_total_base {c |}{col 26}{res}{space 2} .6703784{col 38}{space 2} .1571064{col 49}{space 1}    4.27{col 58}{space 3}0.000{col 66}{space 4} .3587949{col 79}{space 3}  .981962
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2}-.0054206{col 38}{space 2} .0059585{col 49}{space 1}   -0.91{col 58}{space 3}0.365{col 66}{space 4}-.0172379{col 79}{space 3} .0063968
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2}-14.57838{col 38}{space 2}  8.61351{col 49}{space 1}   -1.69{col 58}{space 3}0.094{col 66}{space 4}-31.66124{col 79}{space 3} 2.504488
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2} 12.14311{col 38}{space 2} 13.80612{col 49}{space 1}    0.88{col 58}{space 3}0.381{col 66}{space 4}-15.23806{col 79}{space 3} 39.52429
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} 85.94576{col 38}{space 2} 8.598563{col 49}{space 1}   10.00{col 58}{space 3}0.000{col 66}{space 4} 68.89254{col 79}{space 3}  102.999
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
hours_week_2 {c |}{res}      2,943    83.33945    56.79632          0        570
{txt}(sum of wgt is 5,957.90570878983)

Linear regression                               Number of obs     = {res}     6,142
                                                {txt}F(7, 103)         =  {res}     2.01
                                                {txt}Prob > F          = {res}    0.0614
                                                {txt}R-squared         = {res}    0.0052
                                                {txt}Root MSE          =    {res} 58.362

{txt}{ralign 90:(Std. err. adjusted for {res:104} clusters in {res:areaid})}
{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}        hours_week_biz_2{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2} 1.713274{col 38}{space 2} 2.161982{col 49}{space 1}    0.79{col 58}{space 3}0.430{col 66}{space 4}-2.574508{col 79}{space 3} 6.001056
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2}-.0051972{col 38}{space 2} .0067702{col 49}{space 1}   -0.77{col 58}{space 3}0.444{col 66}{space 4}-.0186243{col 79}{space 3} .0082299
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} .0000584{col 38}{space 2} .0000295{col 49}{space 1}    1.98{col 58}{space 3}0.050{col 66}{space 4}-1.04e-07{col 79}{space 3}  .000117
{txt}area_business_total_base {c |}{col 26}{res}{space 2} .6813675{col 38}{space 2}  .212147{col 49}{space 1}    3.21{col 58}{space 3}0.002{col 66}{space 4} .2606241{col 79}{space 3} 1.102111
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2}-.0154593{col 38}{space 2} .0092446{col 49}{space 1}   -1.67{col 58}{space 3}0.098{col 66}{space 4}-.0337938{col 79}{space 3} .0028753
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2}-1.523396{col 38}{space 2} 11.40197{col 49}{space 1}   -0.13{col 58}{space 3}0.894{col 66}{space 4}-24.13651{col 79}{space 3} 21.08972
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2}-12.67981{col 38}{space 2} 21.35984{col 49}{space 1}   -0.59{col 58}{space 3}0.554{col 66}{space 4}-55.04201{col 79}{space 3} 29.68239
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} 55.95383{col 38}{space 2} 13.64084{col 49}{space 1}    4.10{col 58}{space 3}0.000{col 66}{space 4} 28.90044{col 79}{space 3} 83.00722
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
hours_we~z_2 {c |}{res}      2,943    37.00442    58.46295          0        368
{txt}(sum of wgt is 5,957.90570878983)

Linear regression                               Number of obs     = {res}     6,142
                                                {txt}F(7, 103)         =  {res}     0.75
                                                {txt}Prob > F          = {res}    0.6263
                                                {txt}R-squared         = {res}    0.0024
                                                {txt}Root MSE          =    {res} 56.076

{txt}{ralign 90:(Std. err. adjusted for {res:104} clusters in {res:areaid})}
{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}    hours_week_outside_2{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2}-2.950879{col 38}{space 2}  2.48952{col 49}{space 1}   -1.19{col 58}{space 3}0.239{col 66}{space 4}-7.888255{col 79}{space 3} 1.986497
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2}-.0049722{col 38}{space 2} .0072584{col 49}{space 1}   -0.69{col 58}{space 3}0.495{col 66}{space 4}-.0193676{col 79}{space 3} .0094232
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2}-.0000182{col 38}{space 2} .0000406{col 49}{space 1}   -0.45{col 58}{space 3}0.655{col 66}{space 4}-.0000987{col 79}{space 3} .0000624
{txt}area_business_total_base {c |}{col 26}{res}{space 2}-.0109891{col 38}{space 2} .2510154{col 49}{space 1}   -0.04{col 58}{space 3}0.965{col 66}{space 4}-.5088189{col 79}{space 3} .4868407
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2} .0100387{col 38}{space 2} .0097075{col 49}{space 1}    1.03{col 58}{space 3}0.304{col 66}{space 4}-.0092139{col 79}{space 3} .0292913
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2}-13.05498{col 38}{space 2} 12.78379{col 49}{space 1}   -1.02{col 58}{space 3}0.310{col 66}{space 4}-38.40861{col 79}{space 3} 12.29864
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2} 24.82292{col 38}{space 2} 23.14326{col 49}{space 1}    1.07{col 58}{space 3}0.286{col 66}{space 4}-21.07627{col 79}{space 3} 70.72211
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} 29.99193{col 38}{space 2} 13.76332{col 49}{space 1}    2.18{col 58}{space 3}0.032{col 66}{space 4} 2.695625{col 79}{space 3} 57.28824
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
hours_we~e_2 {c |}{res}      2,943    46.33503    56.90582          0        570
{txt}(sum of wgt is 1,732.37173515558)

Linear regression                               Number of obs     = {res}     1,789
                                                {txt}F(7, 102)         =  {res}     1.14
                                                {txt}Prob > F          = {res}    0.3466
                                                {txt}R-squared         = {res}    0.0062
                                                {txt}Root MSE          =    {res}  16.71

{txt}{ralign 90:(Std. err. adjusted for {res:103} clusters in {res:areaid})}
{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}   hours_girl1620_week_2{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2} .4397742{col 38}{space 2} .9479948{col 49}{space 1}    0.46{col 58}{space 3}0.644{col 66}{space 4}-1.440569{col 79}{space 3} 2.320117
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2}-.0041282{col 38}{space 2} .0028889{col 49}{space 1}   -1.43{col 58}{space 3}0.156{col 66}{space 4}-.0098582{col 79}{space 3} .0016019
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} 3.08e-06{col 38}{space 2} .0000153{col 49}{space 1}    0.20{col 58}{space 3}0.841{col 66}{space 4}-.0000273{col 79}{space 3} .0000335
{txt}area_business_total_base {c |}{col 26}{res}{space 2} .0123339{col 38}{space 2} .0965982{col 49}{space 1}    0.13{col 58}{space 3}0.899{col 66}{space 4}-.1792681{col 79}{space 3} .2039359
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2}-.0020449{col 38}{space 2} .0031585{col 49}{space 1}   -0.65{col 58}{space 3}0.519{col 66}{space 4}-.0083099{col 79}{space 3}   .00422
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2}-9.040554{col 38}{space 2} 4.818086{col 49}{space 1}   -1.88{col 58}{space 3}0.063{col 66}{space 4}-18.59721{col 79}{space 3} .5160965
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2} 5.646944{col 38}{space 2} 7.770441{col 49}{space 1}    0.73{col 58}{space 3}0.469{col 66}{space 4}-9.765689{col 79}{space 3} 21.05958
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} 10.45688{col 38}{space 2} 4.112023{col 49}{space 1}    2.54{col 58}{space 3}0.012{col 66}{space 4} 2.300698{col 79}{space 3} 18.61305
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
hours_girl~2 {c |}{res}        862    5.829466    16.27207          0         96
{txt}(sum of wgt is 1,610.92805677652)

Linear regression                               Number of obs     = {res}     1,665
                                                {txt}F(7, 101)         =  {res}     4.90
                                                {txt}Prob > F          = {res}    0.0001
                                                {txt}R-squared         = {res}    0.0131
                                                {txt}Root MSE          =    {res}  29.93

{txt}{ralign 90:(Std. err. adjusted for {res:102} clusters in {res:areaid})}
{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}    hours_boy1620_week_2{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2}-1.387213{col 38}{space 2} 1.521129{col 49}{space 1}   -0.91{col 58}{space 3}0.364{col 66}{space 4}-4.404723{col 79}{space 3} 1.630296
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2}-.0022538{col 38}{space 2} .0054434{col 49}{space 1}   -0.41{col 58}{space 3}0.680{col 66}{space 4}-.0130521{col 79}{space 3} .0085445
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} .0000151{col 38}{space 2} .0000206{col 49}{space 1}    0.73{col 58}{space 3}0.465{col 66}{space 4}-.0000258{col 79}{space 3} .0000561
{txt}area_business_total_base {c |}{col 26}{res}{space 2} .5706806{col 38}{space 2} .1662747{col 49}{space 1}    3.43{col 58}{space 3}0.001{col 66}{space 4} .2408362{col 79}{space 3}  .900525
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2}-.0076327{col 38}{space 2}  .004486{col 49}{space 1}   -1.70{col 58}{space 3}0.092{col 66}{space 4}-.0165317{col 79}{space 3} .0012663
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2}-2.396193{col 38}{space 2} 8.539489{col 49}{space 1}   -0.28{col 58}{space 3}0.780{col 66}{space 4}-19.33624{col 79}{space 3} 14.54386
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2}-18.44862{col 38}{space 2} 13.69889{col 49}{space 1}   -1.35{col 58}{space 3}0.181{col 66}{space 4}-45.62354{col 79}{space 3} 8.726297
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} 38.31408{col 38}{space 2} 8.007944{col 49}{space 1}    4.78{col 58}{space 3}0.000{col 66}{space 4} 22.42847{col 79}{space 3} 54.19968
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
hours_boy1~2 {c |}{res}        777    20.95109    30.58355          0        162
{txt}(sum of wgt is 5,957.90570878983)

Linear regression                               Number of obs     = {res}     6,142
                                                {txt}F(7, 103)         =  {res}     3.34
                                                {txt}Prob > F          = {res}    0.0030
                                                {txt}R-squared         = {res}    0.0034
                                                {txt}Root MSE          =    {res} 35.818

{txt}{ralign 90:(Std. err. adjusted for {res:104} clusters in {res:areaid})}
{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1} hours_headspouse_week_2{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2} .9909593{col 38}{space 2} 1.176279{col 49}{space 1}    0.84{col 58}{space 3}0.401{col 66}{space 4}-1.341914{col 79}{space 3} 3.323832
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2}-.0041251{col 38}{space 2} .0036536{col 49}{space 1}   -1.13{col 58}{space 3}0.261{col 66}{space 4} -.011371{col 79}{space 3} .0031209
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} .0000404{col 38}{space 2} .0000124{col 49}{space 1}    3.26{col 58}{space 3}0.001{col 66}{space 4} .0000158{col 79}{space 3} .0000649
{txt}area_business_total_base {c |}{col 26}{res}{space 2}  .301955{col 38}{space 2}  .127649{col 49}{space 1}    2.37{col 58}{space 3}0.020{col 66}{space 4} .0487932{col 79}{space 3} .5551167
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2}-.0045629{col 38}{space 2} .0047678{col 49}{space 1}   -0.96{col 58}{space 3}0.341{col 66}{space 4}-.0140186{col 79}{space 3} .0048928
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2}-1.693368{col 38}{space 2} 5.739147{col 49}{space 1}   -0.30{col 58}{space 3}0.769{col 66}{space 4}-13.07561{col 79}{space 3} 9.688876
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2}-5.319874{col 38}{space 2} 9.935219{col 49}{space 1}   -0.54{col 58}{space 3}0.593{col 66}{space 4}-25.02404{col 79}{space 3} 14.38429
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} 57.95092{col 38}{space 2} 7.284965{col 49}{space 1}    7.95{col 58}{space 3}0.000{col 66}{space 4} 43.50292{col 79}{space 3} 72.39893
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
hours_he~k_2 {c |}{res}      2,943    51.31261    35.35814          0        287
{txt}(sum of wgt is 5,957.90570878983)

Linear regression                               Number of obs     = {res}     6,142
                                                {txt}F(7, 103)         =  {res}     2.26
                                                {txt}Prob > F          = {res}    0.0351
                                                {txt}R-squared         = {res}    0.0081
                                                {txt}Root MSE          =    {res} 33.677

{txt}{ralign 90:(Std. err. adjusted for {res:104} clusters in {res:areaid})}
{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}  hours_headspouse_biz_2{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2} 1.703196{col 38}{space 2}  1.58337{col 49}{space 1}    1.08{col 58}{space 3}0.285{col 66}{space 4}-1.437044{col 79}{space 3} 4.843437
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2} .0003421{col 38}{space 2} .0046437{col 49}{space 1}    0.07{col 58}{space 3}0.941{col 66}{space 4}-.0088676{col 79}{space 3} .0095517
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} .0000728{col 38}{space 2} .0000286{col 49}{space 1}    2.54{col 58}{space 3}0.012{col 66}{space 4} .0000161{col 79}{space 3} .0001296
{txt}area_business_total_base {c |}{col 26}{res}{space 2} .1502486{col 38}{space 2} .1605338{col 49}{space 1}    0.94{col 58}{space 3}0.351{col 66}{space 4}-.1681323{col 79}{space 3} .4686296
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2}-.0063402{col 38}{space 2} .0064522{col 49}{space 1}   -0.98{col 58}{space 3}0.328{col 66}{space 4}-.0191365{col 79}{space 3} .0064562
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2} .9184634{col 38}{space 2} 7.569227{col 49}{space 1}    0.12{col 58}{space 3}0.904{col 66}{space 4}-14.09331{col 79}{space 3} 15.93024
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2}-22.43805{col 38}{space 2} 14.14559{col 49}{space 1}   -1.59{col 58}{space 3}0.116{col 66}{space 4} -50.4925{col 79}{space 3} 5.616392
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} 42.30174{col 38}{space 2} 9.618706{col 49}{space 1}    4.40{col 58}{space 3}0.000{col 66}{space 4} 23.22531{col 79}{space 3} 61.37818
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
hours_he~z_2 {c |}{res}      2,943    25.37853    33.40613          0        287
{txt}(sum of wgt is 5,957.90570878983)

Linear regression                               Number of obs     = {res}     6,142
                                                {txt}F(7, 103)         =  {res}     1.38
                                                {txt}Prob > F          = {res}    0.2208
                                                {txt}R-squared         = {res}    0.0040
                                                {txt}Root MSE          =    {res} 31.244

{txt}{ralign 90:(Std. err. adjusted for {res:104} clusters in {res:areaid})}
{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}hours_headspouse_outsi~2{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2}-.7122371{col 38}{space 2} 1.488226{col 49}{space 1}   -0.48{col 58}{space 3}0.633{col 66}{space 4}-3.663783{col 79}{space 3} 2.239308
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2}-.0044671{col 38}{space 2} .0046567{col 49}{space 1}   -0.96{col 58}{space 3}0.340{col 66}{space 4}-.0137025{col 79}{space 3} .0047682
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2}-.0000325{col 38}{space 2}  .000029{col 49}{space 1}   -1.12{col 58}{space 3}0.265{col 66}{space 4}  -.00009{col 79}{space 3}  .000025
{txt}area_business_total_base {c |}{col 26}{res}{space 2} .1517063{col 38}{space 2} .1590902{col 49}{space 1}    0.95{col 58}{space 3}0.343{col 66}{space 4}-.1638115{col 79}{space 3} .4672242
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2} .0017773{col 38}{space 2} .0046444{col 49}{space 1}    0.38{col 58}{space 3}0.703{col 66}{space 4}-.0074338{col 79}{space 3} .0109883
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2}-2.611831{col 38}{space 2} 7.106201{col 49}{space 1}   -0.37{col 58}{space 3}0.714{col 66}{space 4} -16.7053{col 79}{space 3} 11.48164
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2} 17.11818{col 38}{space 2} 12.03717{col 49}{space 1}    1.42{col 58}{space 3}0.158{col 66}{space 4}-6.754697{col 79}{space 3} 40.99106
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} 15.64918{col 38}{space 2} 8.140174{col 49}{space 1}    1.92{col 58}{space 3}0.057{col 66}{space 4}-.4949344{col 79}{space 3} 31.79329
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
hours_he~e_2 {c |}{res}      2,943    25.93408    31.38247          0        149
{txt}(sum of wgt is 5,957.90570878983)

Linear regression                               Number of obs     = {res}     6,142
                                                {txt}F(7, 103)         =  {res}     4.25
                                                {txt}Prob > F          = {res}    0.0004
                                                {txt}R-squared         = {res}    0.0068
                                                {txt}Root MSE          =    {res} .44922

{txt}{ralign 90:(Std. err. adjusted for {res:104} clusters in {res:areaid})}
{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}           labor_index_2{col 26}{c |} Coefficient{col 38}  std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2}-.0055458{col 38}{space 2} .0129552{col 49}{space 1}   -0.43{col 58}{space 3}0.669{col 66}{space 4}-.0312394{col 79}{space 3} .0201478
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2}-.0000857{col 38}{space 2} .0000434{col 49}{space 1}   -1.98{col 58}{space 3}0.051{col 66}{space 4}-.0001718{col 79}{space 3} 2.95e-07
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} 4.36e-07{col 38}{space 2} 2.39e-07{col 49}{space 1}    1.82{col 58}{space 3}0.071{col 66}{space 4}-3.86e-08{col 79}{space 3} 9.11e-07
{txt}area_business_total_base {c |}{col 26}{res}{space 2} .0056348{col 38}{space 2} .0014163{col 49}{space 1}    3.98{col 58}{space 3}0.000{col 66}{space 4} .0028259{col 79}{space 3} .0084437
{txt}{space 3}area_exp_pc_mean_base {c |}{col 26}{res}{space 2} -.000072{col 38}{space 2}  .000055{col 49}{space 1}   -1.31{col 58}{space 3}0.193{col 66}{space 4} -.000181{col 79}{space 3}  .000037
{txt}{space 1}area_literate_head_base {c |}{col 26}{res}{space 2}-.1018098{col 38}{space 2} .0732868{col 49}{space 1}   -1.39{col 58}{space 3}0.168{col 66}{space 4} -.247157{col 79}{space 3} .0435373
{txt}{space 6}area_literate_base {c |}{col 26}{res}{space 2}-.0033025{col 38}{space 2} .1192614{col 49}{space 1}   -0.03{col 58}{space 3}0.978{col 66}{space 4}-.2398294{col 79}{space 3} .2332243
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} .1030672{col 38}{space 2} .0841036{col 49}{space 1}    1.23{col 58}{space 3}0.223{col 66}{space 4}-.0637325{col 79}{space 3} .2698669
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
labor_inde~2 {c |}{res}      2,943   -1.33e-09     .446334  -.8399746   3.217999
{txt}
{com}. 
. // Append the results for Endline 2 to the same table
. estout * using "table5r.tex", drop($area_controls _cons) ///
>     title("Table 5: Time worked by household members, Endline 2") ///
>     prehead("" @title) cells(b(fmt(a3) s) se(fmt(a3) par("="("[" "]")))) ///
>     append s(r2 mn2 sd2 N pval) starlevels(* .1 ** .05 *** .01) legend ///
>     postfoot("Robust standard errors, clustered at the area level, in brackets.")
{res}{txt}(output written to {browse  `"table5r.tex"'})

{com}. 
. 
. 
{txt}end of do-file

{com}. do "/Users/felix/KTH/AppliedEconometrics/Project/Robustness.do"
{txt}
{com}. ********************************************************************************
. ********** Table 1A: Baseline Summary Statistics (Excluding Outliers) ***********
. ********************************************************************************
. 
. * DATA DIRECTORY
. global datadir "/Users/felix/KTH/AppliedEconometrics/Project/DATA"
{txt}
{com}. 
. *OUTPUT DIRECTORY
. global outputdir "/Users/felix/KTH/AppliedEconometrics/Project/Replication"
{txt}
{com}. 
. *LOGFILE*
. capture log close
{smcl}
{com}{sf}{ul off}