{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/felix/KTH/AppliedEconometrics/Project/robustness_log.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}30 Dec 2024, 17:58:04
{txt}
{com}. cd "$outputdir"
{res}/Users/felix/KTH/AppliedEconometrics/Project/Replication
{txt}
{com}. 
. * Load baseline dataset
. use "$datadir/2013-0533_data_baseline.dta", clear
{txt}(Baseline data for "The miracle of microfinance?" (Banerjee et al.), AEJ 2014)

{com}. 
. * Define key variables for summary statistics
. local hh_composition "hh_size adult children male_head head_age head_noeduc"
{txt}
{com}. local credit_access "spandana othermfi bank informal anyloan"
{txt}
{com}. local loan_amt "spandana_amt othermfi_amt bank_amt informal_amt anyloan_amt"
{txt}
{com}. 
. * Exclude outliers (1st and 99th percentiles for numeric variables)
. foreach var of varlist `hh_composition' `credit_access' `loan_amt' {c -(}
{txt}  2{com}.     quietly summarize `var', detail
{txt}  3{com}.     local p1 = r(p1)
{txt}  4{com}.     local p99 = r(p99)
{txt}  5{com}.     drop if `var' < `p1' | `var' > `p99'
{txt}  6{com}. {c )-}
{txt}(23 observations deleted)
(9 observations deleted)
(10 observations deleted)
(10 observations deleted)
(36 observations deleted)
(0 observations deleted)
(19 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(22 observations deleted)
(26 observations deleted)
(26 observations deleted)
(21 observations deleted)

{com}. 
. * Recalculate summary statistics
. summarize `hh_composition' `credit_access' `loan_amt'

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}hh_size {c |}{res}      2,598    4.976905    1.586016          2         10
{txt}{space 6}adults {c |}{res}      2,598    3.328329    1.391284          1          8
{txt}{space 4}children {c |}{res}      2,598    1.648191     1.19916          0          5
{txt}{space 3}male_head {c |}{res}      2,598    .9026174    .2965351          0          1
{txt}{space 4}head_age {c |}{res}      2,598    40.52386    10.27837         22         70
{txt}{hline 13}{c +}{hline 57}
{space 1}head_noeduc {c |}{res}      2,598    .3722094    .4834869          0          1
{txt}{space 4}spandana {c |}{res}      2,598           0           0          0          0
{txt}{space 4}othermfi {c |}{res}      2,598    .0050038    .0705743          0          1
{txt}{space 8}bank {c |}{res}      2,598    .0273287    .1630708          0          1
{txt}{space 4}informal {c |}{res}      2,598    .6289453    .4831801          0          1
{txt}{hline 13}{c +}{hline 57}
{space 5}anyloan {c |}{res}      2,598    .6674365    .4712223          0          1
{txt}spandana_amt {c |}{res}      2,598           0           0          0          0
{txt}othermfi_amt {c |}{res}      2,598    18.47575    278.2815          0       5000
{txt}{space 4}bank_amt {c |}{res}      2,598    825.8276    6406.564          0      96000
{txt}informal_amt {c |}{res}      2,598    20843.41    33522.16          0     200000
{txt}{hline 13}{c +}{hline 57}
{space 1}anyloan_amt {c |}{res}      2,598     22970.2    35344.99          0     200000
{txt}
{com}. 
. * Store summary statistics
. estpost summarize `hh_composition' `credit_access' `loan_amt'

{txt}{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 9:e(count)}{space 1}{space 1}{ralign 9:e(sum_w)}{space 1}{space 1}{ralign 9:e(mean)}{space 1}{space 1}{ralign 9:e(Var)}{space 1}{space 1}{ralign 9:e(sd)}{space 1}{space 1}{ralign 9:e(min)}{space 1}{space 1}{ralign 9:e(max)}{space 1}{space 1}{ralign 9:e(sum)}{space 1}
{space 0}{hline 13}{c   +}{hline 11}{hline 11}{hline 11}{hline 11}{hline 11}{hline 11}{hline 11}{hline 11}
{space 0}{space 0}{ralign 12:hh_size}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     2598}}}{space 1}{space 1}{ralign 9:{res:{sf:     2598}}}{space 1}{space 1}{ralign 9:{res:{sf: 4.976905}}}{space 1}{space 1}{ralign 9:{res:{sf: 2.515446}}}{space 1}{space 1}{ralign 9:{res:{sf: 1.586016}}}{space 1}{space 1}{ralign 9:{res:{sf:        2}}}{space 1}{space 1}{ralign 9:{res:{sf:       10}}}{space 1}{space 1}{ralign 9:{res:{sf:    12930}}}{space 1}
{space 0}{space 0}{ralign 12:adults}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     2598}}}{space 1}{space 1}{ralign 9:{res:{sf:     2598}}}{space 1}{space 1}{ralign 9:{res:{sf: 3.328329}}}{space 1}{space 1}{ralign 9:{res:{sf:  1.93567}}}{space 1}{space 1}{ralign 9:{res:{sf: 1.391284}}}{space 1}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}{space 1}{ralign 9:{res:{sf:        8}}}{space 1}{space 1}{ralign 9:{res:{sf:     8647}}}{space 1}
{space 0}{space 0}{ralign 12:children}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     2598}}}{space 1}{space 1}{ralign 9:{res:{sf:     2598}}}{space 1}{space 1}{ralign 9:{res:{sf: 1.648191}}}{space 1}{space 1}{ralign 9:{res:{sf: 1.437985}}}{space 1}{space 1}{ralign 9:{res:{sf:  1.19916}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        5}}}{space 1}{space 1}{ralign 9:{res:{sf:     4282}}}{space 1}
{space 0}{space 0}{ralign 12:male_head}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     2598}}}{space 1}{space 1}{ralign 9:{res:{sf:     2598}}}{space 1}{space 1}{ralign 9:{res:{sf: .9026174}}}{space 1}{space 1}{ralign 9:{res:{sf: .0879331}}}{space 1}{space 1}{ralign 9:{res:{sf: .2965351}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}{space 1}{ralign 9:{res:{sf:     2345}}}{space 1}
{space 0}{space 0}{ralign 12:head_age}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     2598}}}{space 1}{space 1}{ralign 9:{res:{sf:     2598}}}{space 1}{space 1}{ralign 9:{res:{sf: 40.52386}}}{space 1}{space 1}{ralign 9:{res:{sf:  105.645}}}{space 1}{space 1}{ralign 9:{res:{sf: 10.27837}}}{space 1}{space 1}{ralign 9:{res:{sf:       22}}}{space 1}{space 1}{ralign 9:{res:{sf:       70}}}{space 1}{space 1}{ralign 9:{res:{sf:   105281}}}{space 1}
{space 0}{space 0}{ralign 12:head_noeduc}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     2598}}}{space 1}{space 1}{ralign 9:{res:{sf:     2598}}}{space 1}{space 1}{ralign 9:{res:{sf: .3722094}}}{space 1}{space 1}{ralign 9:{res:{sf: .2337595}}}{space 1}{space 1}{ralign 9:{res:{sf: .4834869}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}{space 1}{ralign 9:{res:{sf:      967}}}{space 1}
{space 0}{space 0}{ralign 12:spandana}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     2598}}}{space 1}{space 1}{ralign 9:{res:{sf:     2598}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:othermfi}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     2598}}}{space 1}{space 1}{ralign 9:{res:{sf:     2598}}}{space 1}{space 1}{ralign 9:{res:{sf: .0050038}}}{space 1}{space 1}{ralign 9:{res:{sf: .0049807}}}{space 1}{space 1}{ralign 9:{res:{sf: .0705743}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}{space 1}{ralign 9:{res:{sf:       13}}}{space 1}
{space 0}{space 0}{ralign 12:bank}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     2598}}}{space 1}{space 1}{ralign 9:{res:{sf:     2598}}}{space 1}{space 1}{ralign 9:{res:{sf: .0273287}}}{space 1}{space 1}{ralign 9:{res:{sf: .0265921}}}{space 1}{space 1}{ralign 9:{res:{sf: .1630708}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}{space 1}{ralign 9:{res:{sf:       71}}}{space 1}
{space 0}{space 0}{ralign 12:informal}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     2598}}}{space 1}{space 1}{ralign 9:{res:{sf:     2598}}}{space 1}{space 1}{ralign 9:{res:{sf: .6289453}}}{space 1}{space 1}{ralign 9:{res:{sf:  .233463}}}{space 1}{space 1}{ralign 9:{res:{sf: .4831801}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}{space 1}{ralign 9:{res:{sf:     1634}}}{space 1}
{space 0}{space 0}{ralign 12:anyloan}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     2598}}}{space 1}{space 1}{ralign 9:{res:{sf:     2598}}}{space 1}{space 1}{ralign 9:{res:{sf: .6674365}}}{space 1}{space 1}{ralign 9:{res:{sf: .2220505}}}{space 1}{space 1}{ralign 9:{res:{sf: .4712223}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}{space 1}{ralign 9:{res:{sf:     1734}}}{space 1}
{space 0}{space 0}{ralign 12:spandana_amt}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     2598}}}{space 1}{space 1}{ralign 9:{res:{sf:     2598}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:othermfi_amt}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     2598}}}{space 1}{space 1}{ralign 9:{res:{sf:     2598}}}{space 1}{space 1}{ralign 9:{res:{sf: 18.47575}}}{space 1}{space 1}{ralign 9:{res:{sf: 77440.57}}}{space 1}{space 1}{ralign 9:{res:{sf: 278.2815}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:     5000}}}{space 1}{space 1}{ralign 9:{res:{sf:    48000}}}{space 1}
{space 0}{space 0}{ralign 12:bank_amt}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     2598}}}{space 1}{space 1}{ralign 9:{res:{sf:     2598}}}{space 1}{space 1}{ralign 9:{res:{sf: 825.8276}}}{space 1}{space 1}{ralign 9:{res:{sf: 4.10e+07}}}{space 1}{space 1}{ralign 9:{res:{sf: 6406.564}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:    96000}}}{space 1}{space 1}{ralign 9:{res:{sf:  2145500}}}{space 1}
{space 0}{space 0}{ralign 12:informal_amt}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     2598}}}{space 1}{space 1}{ralign 9:{res:{sf:     2598}}}{space 1}{space 1}{ralign 9:{res:{sf: 20843.41}}}{space 1}{space 1}{ralign 9:{res:{sf: 1.12e+09}}}{space 1}{space 1}{ralign 9:{res:{sf: 33522.16}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:   200000}}}{space 1}{space 1}{ralign 9:{res:{sf: 5.42e+07}}}{space 1}
{space 0}{space 0}{ralign 12:anyloan_amt}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     2598}}}{space 1}{space 1}{ralign 9:{res:{sf:     2598}}}{space 1}{space 1}{ralign 9:{res:{sf:  22970.2}}}{space 1}{space 1}{ralign 9:{res:{sf: 1.25e+09}}}{space 1}{space 1}{ralign 9:{res:{sf: 35344.99}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:   200000}}}{space 1}{space 1}{ralign 9:{res:{sf: 5.97e+07}}}{space 1}

{com}. 
. * Export summary statistics to a text file
. esttab using table1a_nooutliers.txt, replace cells("mean sd min max") label title("Excluding Outliers")
{res}{txt}(output written to {browse  `"table1a_nooutliers.txt"'})

{com}. 
. ********************************************************************************
. *************         Table 1B: Endline Summary Statistics        **************
. ********************************************************************************
. * ENDLINE 1 *
. * Load baseline dataset
. use "$datadir/2013-0533_data_endlines1and2.dta", clear
{txt}(Endline data for "The miracle of microfinance?" (Banerjee et al.), AEJ 2014)

{com}. 
. * Define key variables for summary statistics
. local hh_composition_1 "hhsize_1 adults_1 children_1 male_head_1 head_age_1 head_noeduc_1"
{txt}
{com}. local credit_access_1 "spandana_1 othermfi_1 anybank_1 anyinformal_1 anyloan_1"
{txt}
{com}. local loan_amt_1 "spandana_amt_1 othermfi_amt_1 bank_amt_1 informal_amt_1 anyloan_amt_1"
{txt}
{com}. 
. 
. * Exclude outliers (1st and 99th percentiles for numeric variables)
. 
. foreach var of varlist `hh_composition_1' `credit_access_1' `loan_amt_1' {c -(}
{txt}  2{com}.     quietly summarize `var', detail
{txt}  3{com}.     local p1 = r(p1)
{txt}  4{com}.     local p99 = r(p99)
{txt}  5{com}.     drop if `var' < `p1' | `var' > `p99'
{txt}  6{com}. {c )-}
{txt}(57 observations deleted)
(118 observations deleted)
(39 observations deleted)
(9 observations deleted)
(78 observations deleted)
(4 observations deleted)
(49 observations deleted)
(142 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(39 observations deleted)
(63 observations deleted)
(62 observations deleted)
(60 observations deleted)
(59 observations deleted)

{com}. 
. * Recalculate summary statistics
. summarize `hh_composition_1' `credit_access_1' `loan_amt_1'

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}hhsize_1 {c |}{res}      6,084    5.465483    1.806056          2         13
{txt}{space 4}adults_1 {c |}{res}      6,084    3.767258    1.536366          2          8
{txt}{space 2}children_1 {c |}{res}      6,084    1.680309    1.208442          0          5
{txt}{space 1}male_head_1 {c |}{res}      6,084    .9051611    .2930164          0          1
{txt}{space 2}head_age_1 {c |}{res}      6,084    40.83679    9.893157         23         70
{txt}{hline 13}{c +}{hline 57}
head_noedu~1 {c |}{res}      6,084     .312952    .4637331          0          1
{txt}{space 2}spandana_1 {c |}{res}      6,084    .1283695    .3345283          0          1
{txt}{space 2}othermfi_1 {c |}{res}      6,084    .1336292    .3402814          0          1
{txt}{space 3}anybank_1 {c |}{res}      6,084    .0721565    .2587681          0          1
{txt}anyinforma~1 {c |}{res}      6,084    .7468771    .4348365          0          1
{txt}{hline 13}{c +}{hline 57}
{space 3}anyloan_1 {c |}{res}      6,084    .8754109    .3302795          0          1
{txt}spandana_a~1 {c |}{res}      6,084    1279.846    3557.149          0      20000
{txt}othermfi_a~1 {c |}{res}      6,084     1411.27    3922.939          0      22750
{txt}{space 2}bank_amt_1 {c |}{res}      6,084    3486.886    15812.33          0     153000
{txt}informal_a~1 {c |}{res}      6,084    33767.67    51290.36          0     350000
{txt}{hline 13}{c +}{hline 57}
anyloan_am~1 {c |}{res}      6,084    47476.87    58565.24          0     325000
{txt}
{com}. 
. * Store summary statistics
. estpost summarize `hh_composition_1' `credit_access_1' `loan_amt_1'

{txt}{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 9:e(count)}{space 1}{space 1}{ralign 9:e(sum_w)}{space 1}{space 1}{ralign 9:e(mean)}{space 1}{space 1}{ralign 9:e(Var)}{space 1}{space 1}{ralign 9:e(sd)}{space 1}{space 1}{ralign 9:e(min)}{space 1}{space 1}{ralign 9:e(max)}{space 1}{space 1}{ralign 9:e(sum)}{space 1}
{space 0}{hline 13}{c   +}{hline 11}{hline 11}{hline 11}{hline 11}{hline 11}{hline 11}{hline 11}{hline 11}
{space 0}{space 0}{ralign 12:hhsize_1}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     6084}}}{space 1}{space 1}{ralign 9:{res:{sf:     6084}}}{space 1}{space 1}{ralign 9:{res:{sf: 5.465483}}}{space 1}{space 1}{ralign 9:{res:{sf: 3.261837}}}{space 1}{space 1}{ralign 9:{res:{sf: 1.806056}}}{space 1}{space 1}{ralign 9:{res:{sf:        2}}}{space 1}{space 1}{ralign 9:{res:{sf:       13}}}{space 1}{space 1}{ralign 9:{res:{sf:    33252}}}{space 1}
{space 0}{space 0}{ralign 12:adults_1}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     6084}}}{space 1}{space 1}{ralign 9:{res:{sf:     6084}}}{space 1}{space 1}{ralign 9:{res:{sf: 3.767258}}}{space 1}{space 1}{ralign 9:{res:{sf:  2.36042}}}{space 1}{space 1}{ralign 9:{res:{sf: 1.536366}}}{space 1}{space 1}{ralign 9:{res:{sf:        2}}}{space 1}{space 1}{ralign 9:{res:{sf:        8}}}{space 1}{space 1}{ralign 9:{res:{sf:    22920}}}{space 1}
{space 0}{space 0}{ralign 12:children_1}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     6084}}}{space 1}{space 1}{ralign 9:{res:{sf:     6084}}}{space 1}{space 1}{ralign 9:{res:{sf: 1.680309}}}{space 1}{space 1}{ralign 9:{res:{sf: 1.460332}}}{space 1}{space 1}{ralign 9:{res:{sf: 1.208442}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        5}}}{space 1}{space 1}{ralign 9:{res:{sf:    10223}}}{space 1}
{space 0}{space 0}{ralign 12:male_head_1}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     6084}}}{space 1}{space 1}{ralign 9:{res:{sf:     6084}}}{space 1}{space 1}{ralign 9:{res:{sf: .9051611}}}{space 1}{space 1}{ralign 9:{res:{sf: .0858586}}}{space 1}{space 1}{ralign 9:{res:{sf: .2930164}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}{space 1}{ralign 9:{res:{sf:     5507}}}{space 1}
{space 0}{space 0}{ralign 12:head_age_1}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     6084}}}{space 1}{space 1}{ralign 9:{res:{sf:     6084}}}{space 1}{space 1}{ralign 9:{res:{sf: 40.83679}}}{space 1}{space 1}{ralign 9:{res:{sf: 97.87456}}}{space 1}{space 1}{ralign 9:{res:{sf: 9.893157}}}{space 1}{space 1}{ralign 9:{res:{sf:       23}}}{space 1}{space 1}{ralign 9:{res:{sf:       70}}}{space 1}{space 1}{ralign 9:{res:{sf:   248451}}}{space 1}
{space 0}{space 0}{ralign 12:head_noedu~1}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     6084}}}{space 1}{space 1}{ralign 9:{res:{sf:     6084}}}{space 1}{space 1}{ralign 9:{res:{sf:  .312952}}}{space 1}{space 1}{ralign 9:{res:{sf: .2150484}}}{space 1}{space 1}{ralign 9:{res:{sf: .4637331}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}{space 1}{ralign 9:{res:{sf:     1904}}}{space 1}
{space 0}{space 0}{ralign 12:spandana_1}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     6084}}}{space 1}{space 1}{ralign 9:{res:{sf:     6084}}}{space 1}{space 1}{ralign 9:{res:{sf: .1283695}}}{space 1}{space 1}{ralign 9:{res:{sf: .1119092}}}{space 1}{space 1}{ralign 9:{res:{sf: .3345283}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}{space 1}{ralign 9:{res:{sf:      781}}}{space 1}
{space 0}{space 0}{ralign 12:othermfi_1}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     6084}}}{space 1}{space 1}{ralign 9:{res:{sf:     6084}}}{space 1}{space 1}{ralign 9:{res:{sf: .1336292}}}{space 1}{space 1}{ralign 9:{res:{sf: .1157915}}}{space 1}{space 1}{ralign 9:{res:{sf: .3402814}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}{space 1}{ralign 9:{res:{sf:      813}}}{space 1}
{space 0}{space 0}{ralign 12:anybank_1}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     6084}}}{space 1}{space 1}{ralign 9:{res:{sf:     6084}}}{space 1}{space 1}{ralign 9:{res:{sf: .0721565}}}{space 1}{space 1}{ralign 9:{res:{sf: .0669609}}}{space 1}{space 1}{ralign 9:{res:{sf: .2587681}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}{space 1}{ralign 9:{res:{sf:      439}}}{space 1}
{space 0}{space 0}{ralign 12:anyinforma~1}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     6084}}}{space 1}{space 1}{ralign 9:{res:{sf:     6084}}}{space 1}{space 1}{ralign 9:{res:{sf: .7468771}}}{space 1}{space 1}{ralign 9:{res:{sf: .1890828}}}{space 1}{space 1}{ralign 9:{res:{sf: .4348365}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}{space 1}{ralign 9:{res:{sf:     4544}}}{space 1}
{space 0}{space 0}{ralign 12:anyloan_1}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     6084}}}{space 1}{space 1}{ralign 9:{res:{sf:     6084}}}{space 1}{space 1}{ralign 9:{res:{sf: .8754109}}}{space 1}{space 1}{ralign 9:{res:{sf: .1090846}}}{space 1}{space 1}{ralign 9:{res:{sf: .3302795}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}{space 1}{ralign 9:{res:{sf:     5326}}}{space 1}
{space 0}{space 0}{ralign 12:spandana_a~1}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     6084}}}{space 1}{space 1}{ralign 9:{res:{sf:     6084}}}{space 1}{space 1}{ralign 9:{res:{sf: 1279.846}}}{space 1}{space 1}{ralign 9:{res:{sf: 1.27e+07}}}{space 1}{space 1}{ralign 9:{res:{sf: 3557.149}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:    20000}}}{space 1}{space 1}{ralign 9:{res:{sf:  7786586}}}{space 1}
{space 0}{space 0}{ralign 12:othermfi_a~1}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     6084}}}{space 1}{space 1}{ralign 9:{res:{sf:     6084}}}{space 1}{space 1}{ralign 9:{res:{sf:  1411.27}}}{space 1}{space 1}{ralign 9:{res:{sf: 1.54e+07}}}{space 1}{space 1}{ralign 9:{res:{sf: 3922.939}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:    22750}}}{space 1}{space 1}{ralign 9:{res:{sf:  8586167}}}{space 1}
{space 0}{space 0}{ralign 12:bank_amt_1}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     6084}}}{space 1}{space 1}{ralign 9:{res:{sf:     6084}}}{space 1}{space 1}{ralign 9:{res:{sf: 3486.886}}}{space 1}{space 1}{ralign 9:{res:{sf: 2.50e+08}}}{space 1}{space 1}{ralign 9:{res:{sf: 15812.33}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:   153000}}}{space 1}{space 1}{ralign 9:{res:{sf: 2.12e+07}}}{space 1}
{space 0}{space 0}{ralign 12:informal_a~1}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     6084}}}{space 1}{space 1}{ralign 9:{res:{sf:     6084}}}{space 1}{space 1}{ralign 9:{res:{sf: 33767.67}}}{space 1}{space 1}{ralign 9:{res:{sf: 2.63e+09}}}{space 1}{space 1}{ralign 9:{res:{sf: 51290.36}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:   350000}}}{space 1}{space 1}{ralign 9:{res:{sf: 2.05e+08}}}{space 1}
{space 0}{space 0}{ralign 12:anyloan_am~1}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     6084}}}{space 1}{space 1}{ralign 9:{res:{sf:     6084}}}{space 1}{space 1}{ralign 9:{res:{sf: 47476.87}}}{space 1}{space 1}{ralign 9:{res:{sf: 3.43e+09}}}{space 1}{space 1}{ralign 9:{res:{sf: 58565.24}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:   325000}}}{space 1}{space 1}{ralign 9:{res:{sf: 2.89e+08}}}{space 1}

{com}. 
. * Export summary statistics to a text file
. esttab using table1b_nooutliers1.txt, replace cells("mean sd min max") label title("Excluding Outliers Endline 1")
{res}{txt}(output written to {browse  `"table1b_nooutliers1.txt"'})

{com}. 
. 
. * ENDLINE 2 *
. use "$datadir/2013-0533_data_endlines1and2.dta", clear
{txt}(Endline data for "The miracle of microfinance?" (Banerjee et al.), AEJ 2014)

{com}. 
. * Define key variables for summary statistics
. local credit_access_2 "spandana_2 othermfi_2 anybank_2 anyinformal_2 anyloan_2"
{txt}
{com}. local loan_amt_2 "spandana_amt_2 othermfi_amt_2 bank_amt_2 informal_amt_2 anyloan_amt_2"
{txt}
{com}. local businesses_2 "bizrev_2 bizexpense_2 bizinvestment_2 bizemployees_2 hours_week_biz_2"
{txt}
{com}. 
. * Exclude outliers (1st and 99th percentiles for numeric variables)
. 
. foreach var of varlist `hh_composition_2' `credit_access_2' `loan_amt_2' `businesses_2' {c -(}
{txt}  2{com}.     quietly summarize `var', detail
{txt}  3{com}.     local p1 = r(p1)
{txt}  4{com}.     local p99 = r(p99)
{txt}  5{com}.     drop if `var' < `p1' | `var' > `p99'
{txt}  6{com}. {c )-}
{txt}(721 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(32 observations deleted)
(60 observations deleted)
(61 observations deleted)
(60 observations deleted)
(57 observations deleted)
(79 observations deleted)
(70 observations deleted)
(57 observations deleted)
(37 observations deleted)
(56 observations deleted)

{com}. 
. * Recalculate summary statistics
. summarize `credit_access_2' `loan_amt_2' `businesses_2'

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 2}spandana_2 {c |}{res}      5,573     .141396    .3484609          0          1
{txt}{space 2}othermfi_2 {c |}{res}      5,573    .2443926    .4297651          0          1
{txt}{space 3}anybank_2 {c |}{res}      5,573     .060829    .2390378          0          1
{txt}anyinforma~2 {c |}{res}      5,573    .5959088    .4907593          0          1
{txt}{space 3}anyloan_2 {c |}{res}      5,573    .8989772    .3013859          0          1
{txt}{hline 13}{c +}{hline 57}
spandana_a~2 {c |}{res}      5,573    1836.425    4897.188          0   24989.37
{txt}othermfi_a~2 {c |}{res}      5,573    3881.374    7955.088          0      46000
{txt}{space 2}bank_amt_2 {c |}{res}      5,573    2506.565    12466.01          0   149936.2
{txt}informal_a~2 {c |}{res}      5,573    24476.68    47922.92          0   368593.2
{txt}anyloan_am~2 {c |}{res}      5,573    68307.64    84900.11          0     500000
{txt}{hline 13}{c +}{hline 57}
{space 4}bizrev_2 {c |}{res}      5,573     3713.43    9112.045          0    82964.7
{txt}bizexpense_2 {c |}{res}      5,573    2373.706    6718.959          0   54143.63
{txt}bizinvestm~2 {c |}{res}      5,573    252.1113    1439.469          0   21824.05
{txt}bizemploye~2 {c |}{res}      5,573    .0687242    .3943878          0          4
{txt}hours_we~z_2 {c |}{res}      5,573    31.64974    50.60248          0        223
{txt}
{com}. 
. * Store summary statistics
. estpost summarize `credit_access_2' `loan_amt_2' `businesses_2'

{txt}{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 9:e(count)}{space 1}{space 1}{ralign 9:e(sum_w)}{space 1}{space 1}{ralign 9:e(mean)}{space 1}{space 1}{ralign 9:e(Var)}{space 1}{space 1}{ralign 9:e(sd)}{space 1}{space 1}{ralign 9:e(min)}{space 1}{space 1}{ralign 9:e(max)}{space 1}{space 1}{ralign 9:e(sum)}{space 1}
{space 0}{hline 13}{c   +}{hline 11}{hline 11}{hline 11}{hline 11}{hline 11}{hline 11}{hline 11}{hline 11}
{space 0}{space 0}{ralign 12:spandana_2}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     5573}}}{space 1}{space 1}{ralign 9:{res:{sf:     5573}}}{space 1}{space 1}{ralign 9:{res:{sf:  .141396}}}{space 1}{space 1}{ralign 9:{res:{sf:  .121425}}}{space 1}{space 1}{ralign 9:{res:{sf: .3484609}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}{space 1}{ralign 9:{res:{sf:      788}}}{space 1}
{space 0}{space 0}{ralign 12:othermfi_2}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     5573}}}{space 1}{space 1}{ralign 9:{res:{sf:     5573}}}{space 1}{space 1}{ralign 9:{res:{sf: .2443926}}}{space 1}{space 1}{ralign 9:{res:{sf:  .184698}}}{space 1}{space 1}{ralign 9:{res:{sf: .4297651}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}{space 1}{ralign 9:{res:{sf:     1362}}}{space 1}
{space 0}{space 0}{ralign 12:anybank_2}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     5573}}}{space 1}{space 1}{ralign 9:{res:{sf:     5573}}}{space 1}{space 1}{ralign 9:{res:{sf:  .060829}}}{space 1}{space 1}{ralign 9:{res:{sf: .0571391}}}{space 1}{space 1}{ralign 9:{res:{sf: .2390378}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}{space 1}{ralign 9:{res:{sf:      339}}}{space 1}
{space 0}{space 0}{ralign 12:anyinforma~2}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     5573}}}{space 1}{space 1}{ralign 9:{res:{sf:     5573}}}{space 1}{space 1}{ralign 9:{res:{sf: .5959088}}}{space 1}{space 1}{ralign 9:{res:{sf: .2408447}}}{space 1}{space 1}{ralign 9:{res:{sf: .4907593}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}{space 1}{ralign 9:{res:{sf:     3321}}}{space 1}
{space 0}{space 0}{ralign 12:anyloan_2}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     5573}}}{space 1}{space 1}{ralign 9:{res:{sf:     5573}}}{space 1}{space 1}{ralign 9:{res:{sf: .8989772}}}{space 1}{space 1}{ralign 9:{res:{sf: .0908335}}}{space 1}{space 1}{ralign 9:{res:{sf: .3013859}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}{space 1}{ralign 9:{res:{sf:     5010}}}{space 1}
{space 0}{space 0}{ralign 12:spandana_a~2}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     5573}}}{space 1}{space 1}{ralign 9:{res:{sf:     5573}}}{space 1}{space 1}{ralign 9:{res:{sf: 1836.425}}}{space 1}{space 1}{ralign 9:{res:{sf: 2.40e+07}}}{space 1}{space 1}{ralign 9:{res:{sf: 4897.188}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf: 24989.37}}}{space 1}{space 1}{ralign 9:{res:{sf: 1.02e+07}}}{space 1}
{space 0}{space 0}{ralign 12:othermfi_a~2}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     5573}}}{space 1}{space 1}{ralign 9:{res:{sf:     5573}}}{space 1}{space 1}{ralign 9:{res:{sf: 3881.374}}}{space 1}{space 1}{ralign 9:{res:{sf: 6.33e+07}}}{space 1}{space 1}{ralign 9:{res:{sf: 7955.088}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:    46000}}}{space 1}{space 1}{ralign 9:{res:{sf: 2.16e+07}}}{space 1}
{space 0}{space 0}{ralign 12:bank_amt_2}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     5573}}}{space 1}{space 1}{ralign 9:{res:{sf:     5573}}}{space 1}{space 1}{ralign 9:{res:{sf: 2506.565}}}{space 1}{space 1}{ralign 9:{res:{sf: 1.55e+08}}}{space 1}{space 1}{ralign 9:{res:{sf: 12466.01}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf: 149936.2}}}{space 1}{space 1}{ralign 9:{res:{sf: 1.40e+07}}}{space 1}
{space 0}{space 0}{ralign 12:informal_a~2}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     5573}}}{space 1}{space 1}{ralign 9:{res:{sf:     5573}}}{space 1}{space 1}{ralign 9:{res:{sf: 24476.68}}}{space 1}{space 1}{ralign 9:{res:{sf: 2.30e+09}}}{space 1}{space 1}{ralign 9:{res:{sf: 47922.92}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf: 368593.2}}}{space 1}{space 1}{ralign 9:{res:{sf: 1.36e+08}}}{space 1}
{space 0}{space 0}{ralign 12:anyloan_am~2}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     5573}}}{space 1}{space 1}{ralign 9:{res:{sf:     5573}}}{space 1}{space 1}{ralign 9:{res:{sf: 68307.64}}}{space 1}{space 1}{ralign 9:{res:{sf: 7.21e+09}}}{space 1}{space 1}{ralign 9:{res:{sf: 84900.11}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:   500000}}}{space 1}{space 1}{ralign 9:{res:{sf: 3.81e+08}}}{space 1}
{space 0}{space 0}{ralign 12:bizrev_2}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     5573}}}{space 1}{space 1}{ralign 9:{res:{sf:     5573}}}{space 1}{space 1}{ralign 9:{res:{sf:  3713.43}}}{space 1}{space 1}{ralign 9:{res:{sf: 8.30e+07}}}{space 1}{space 1}{ralign 9:{res:{sf: 9112.045}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:  82964.7}}}{space 1}{space 1}{ralign 9:{res:{sf: 2.07e+07}}}{space 1}
{space 0}{space 0}{ralign 12:bizexpense_2}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     5573}}}{space 1}{space 1}{ralign 9:{res:{sf:     5573}}}{space 1}{space 1}{ralign 9:{res:{sf: 2373.706}}}{space 1}{space 1}{ralign 9:{res:{sf: 4.51e+07}}}{space 1}{space 1}{ralign 9:{res:{sf: 6718.959}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf: 54143.63}}}{space 1}{space 1}{ralign 9:{res:{sf: 1.32e+07}}}{space 1}
{space 0}{space 0}{ralign 12:bizinvestm~2}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     5573}}}{space 1}{space 1}{ralign 9:{res:{sf:     5573}}}{space 1}{space 1}{ralign 9:{res:{sf: 252.1113}}}{space 1}{space 1}{ralign 9:{res:{sf:  2072072}}}{space 1}{space 1}{ralign 9:{res:{sf: 1439.469}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf: 21824.05}}}{space 1}{space 1}{ralign 9:{res:{sf:  1405016}}}{space 1}
{space 0}{space 0}{ralign 12:bizemploye~2}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     5573}}}{space 1}{space 1}{ralign 9:{res:{sf:     5573}}}{space 1}{space 1}{ralign 9:{res:{sf: .0687242}}}{space 1}{space 1}{ralign 9:{res:{sf: .1555417}}}{space 1}{space 1}{ralign 9:{res:{sf: .3943878}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        4}}}{space 1}{space 1}{ralign 9:{res:{sf:      383}}}{space 1}
{space 0}{space 0}{ralign 12:hours_we~z_2}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     5573}}}{space 1}{space 1}{ralign 9:{res:{sf:     5573}}}{space 1}{space 1}{ralign 9:{res:{sf: 31.64974}}}{space 1}{space 1}{ralign 9:{res:{sf: 2560.611}}}{space 1}{space 1}{ralign 9:{res:{sf: 50.60248}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:      223}}}{space 1}{space 1}{ralign 9:{res:{sf:   176384}}}{space 1}

{com}. 
. * Export summary statistics to a text file
. esttab using table1b_nooutliers2.txt, replace cells("mean sd min max") label title("Excluding Outliers Endline 2")
{res}{txt}(output written to {browse  `"table1b_nooutliers2.txt"'})

{com}. 
. ********************************************************************************
. ********** Regression Robustness: Drop One Control at a Time ********************
. ********************************************************************************
. 
. * Load dataset
. use "$datadir/2013-0533_data_endlines1and2.dta", clear
{txt}(Endline data for "The miracle of microfinance?" (Banerjee et al.), AEJ 2014)

{com}. 
. * Define baseline regression variables 
. local baseline_controls "area_pop_base area_debt_total_base area_business_total_base"
{txt}
{com}. 
. *** Treatment effect on business revenue ***
. regress bizrev_1 treatment `baseline_controls'

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     6,608
{txt}{hline 13}{c +}{hline 34}   F(4, 6603)      = {res}     7.74
{txt}       Model {c |} {res} 3.2068e+10         4  8.0171e+09   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 6.8413e+12     6,603  1.0361e+09   {txt}R-squared       ={res}    0.0047
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0041
{txt}       Total {c |} {res} 6.8734e+12     6,607  1.0403e+09   {txt}Root MSE        =   {res}  32188

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}                bizrev_1{col 26}{c |} Coefficient{col 38}  Std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2} 1084.928{col 38}{space 2} 799.3127{col 49}{space 1}    1.36{col 58}{space 3}0.175{col 66}{space 4}-481.9838{col 79}{space 3} 2651.839
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2}  1.07236{col 38}{space 2} 2.712589{col 49}{space 1}    0.40{col 58}{space 3}0.693{col 66}{space 4}-4.245192{col 79}{space 3} 6.389912
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} .0794313{col 38}{space 2}  .014919{col 49}{space 1}    5.32{col 58}{space 3}0.000{col 66}{space 4} .0501851{col 79}{space 3} .1086774
{txt}area_business_total_base {c |}{col 26}{res}{space 2} 103.2044{col 38}{space 2} 81.35663{col 49}{space 1}    1.27{col 58}{space 3}0.205{col 66}{space 4}-56.28093{col 79}{space 3} 262.6897
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} 861.4124{col 38}{space 2} 1377.829{col 49}{space 1}    0.63{col 58}{space 3}0.532{col 66}{space 4}-1839.579{col 79}{space 3} 3562.404
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. regress bizrev_2 treatment `baseline_controls'

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     6,116
{txt}{hline 13}{c +}{hline 34}   F(4, 6111)      = {res}     0.73
{txt}       Model {c |} {res}  826579837         4   206644959   {txt}Prob > F        ={res}    0.5693
{txt}    Residual {c |} {res} 1.7226e+12     6,111   281888803   {txt}R-squared       ={res}    0.0005
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.0002
{txt}       Total {c |} {res} 1.7234e+12     6,115   281839583   {txt}Root MSE        =   {res}  16790

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}                bizrev_2{col 26}{c |} Coefficient{col 38}  Std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2} 381.2675{col 38}{space 2} 433.1557{col 49}{space 1}    0.88{col 58}{space 3}0.379{col 66}{space 4}-467.8703{col 79}{space 3} 1230.405
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2} -.088989{col 38}{space 2} 1.475848{col 49}{space 1}   -0.06{col 58}{space 3}0.952{col 66}{space 4} -2.98217{col 79}{space 3} 2.804192
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} .0106126{col 38}{space 2} .0076645{col 49}{space 1}    1.38{col 58}{space 3}0.166{col 66}{space 4}-.0044125{col 79}{space 3} .0256378
{txt}area_business_total_base {c |}{col 26}{res}{space 2} 28.80614{col 38}{space 2} 44.45975{col 49}{space 1}    0.65{col 58}{space 3}0.517{col 66}{space 4}-58.35063{col 79}{space 3} 115.9629
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} 5267.039{col 38}{space 2} 745.3872{col 49}{space 1}    7.07{col 58}{space 3}0.000{col 66}{space 4} 3805.818{col 79}{space 3}  6728.26
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. * Loop through controls, excluding one at a time
. foreach var of varlist `baseline_controls' {c -(}
{txt}  2{com}.     display "Running regression without control: `var'"
{txt}  3{com}. 
.     * Build the list of controls excluding `var`
.     local controls_removed ""
{txt}  4{com}.     foreach control of varlist `baseline_controls' {c -(}
{txt}  5{com}.         if "`control'" != "`var'" {c -(}
{txt}  6{com}.             local controls_removed "`controls_removed' `control'"
{txt}  7{com}.         {c )-}
{txt}  8{com}.     {c )-}
{txt}  9{com}.         
.         * Run regression with remaining controls: but regressing on treatment
.     regress bizrev_1 treatment `controls_removed'
{txt} 10{com}.         outreg2 using regression_robustness.txt, append ctitle("Effect of treatment on revenue of old businesses EL1: Excluding `var'")
{txt} 11{com}.         
.         regress bizrev_2 treatment `controls_removed'
{txt} 12{com}.         outreg2 using regression_robustness.txt, append ctitle("Effect of treatment on revenue of old businesses EL2: Excluding `var'")
{txt} 13{com}. 
. {c )-}
Running regression without control: area_pop_base

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     6,608
{txt}{hline 13}{c +}{hline 34}   F(3, 6604)      = {res}    10.27
{txt}       Model {c |} {res} 3.1907e+10         3  1.0636e+10   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 6.8415e+12     6,604  1.0360e+09   {txt}R-squared       ={res}    0.0046
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0042
{txt}       Total {c |} {res} 6.8734e+12     6,607  1.0403e+09   {txt}Root MSE        =   {res}  32186

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}                bizrev_1{col 26}{c |} Coefficient{col 38}  Std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2} 1067.021{col 38}{space 2} 797.9772{col 49}{space 1}    1.34{col 58}{space 3}0.181{col 66}{space 4}-497.2726{col 79}{space 3} 2631.314
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} .0788176{col 38}{space 2} .0148371{col 49}{space 1}    5.31{col 58}{space 3}0.000{col 66}{space 4}  .049732{col 79}{space 3} .1079031
{txt}area_business_total_base {c |}{col 26}{res}{space 2} 100.5104{col 38}{space 2} 81.06556{col 49}{space 1}    1.24{col 58}{space 3}0.215{col 66}{space 4}-58.40426{col 79}{space 3} 259.4251
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} 1242.864{col 38}{space 2}  983.492{col 49}{space 1}    1.26{col 58}{space 3}0.206{col 66}{space 4}-685.0984{col 79}{space 3} 3170.826
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{browse `"/Users/felix/KTH/AppliedEconometrics/Project/Replication"' :dir}{com} : {txt}{stata `"seeout using "regression_robustness.txt""':seeout}

      Source {c |}       SS           df       MS      Number of obs   ={res}     6,116
{txt}{hline 13}{c +}{hline 34}   F(3, 6112)      = {res}     0.98
{txt}       Model {c |} {res}  825554970         3   275184990   {txt}Prob > F        ={res}    0.4028
{txt}    Residual {c |} {res} 1.7226e+12     6,112   281842850   {txt}R-squared       ={res}    0.0005
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.0000
{txt}       Total {c |} {res} 1.7234e+12     6,115   281839583   {txt}Root MSE        =   {res}  16788

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}                bizrev_2{col 26}{c |} Coefficient{col 38}  Std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2} 382.7469{col 38}{space 2}  432.425{col 49}{space 1}    0.89{col 58}{space 3}0.376{col 66}{space 4}-464.9584{col 79}{space 3} 1230.452
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} .0106578{col 38}{space 2} .0076271{col 49}{space 1}    1.40{col 58}{space 3}0.162{col 66}{space 4}-.0042941{col 79}{space 3} .0256097
{txt}area_business_total_base {c |}{col 26}{res}{space 2} 29.04648{col 38}{space 2}  44.2771{col 49}{space 1}    0.66{col 58}{space 3}0.512{col 66}{space 4}-57.75223{col 79}{space 3} 115.8452
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} 5235.508{col 38}{space 2} 531.1304{col 49}{space 1}    9.86{col 58}{space 3}0.000{col 66}{space 4} 4194.305{col 79}{space 3} 6276.711
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{browse `"/Users/felix/KTH/AppliedEconometrics/Project/Replication"' :dir}{com} : {txt}{stata `"seeout using "regression_robustness.txt""':seeout}
Running regression without control: area_debt_total_base

      Source {c |}       SS           df       MS      Number of obs   ={res}     6,608
{txt}{hline 13}{c +}{hline 34}   F(3, 6604)      = {res}     0.86
{txt}       Model {c |} {res} 2.6986e+09         3   899539178   {txt}Prob > F        ={res}    0.4586
{txt}    Residual {c |} {res} 6.8707e+12     6,604  1.0404e+09   {txt}R-squared       ={res}    0.0004
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.0001
{txt}       Total {c |} {res} 6.8734e+12     6,607  1.0403e+09   {txt}Root MSE        =   {res}  32255

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}                bizrev_1{col 26}{c |} Coefficient{col 38}  Std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2} 696.7541{col 38}{space 2}  797.627{col 49}{space 1}    0.87{col 58}{space 3}0.382{col 66}{space 4}-866.8527{col 79}{space 3} 2260.361
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2}-.4303799{col 38}{space 2} 2.703445{col 49}{space 1}   -0.16{col 58}{space 3}0.874{col 66}{space 4}-5.730006{col 79}{space 3} 4.869247
{txt}area_business_total_base {c |}{col 26}{res}{space 2} 112.5662{col 38}{space 2} 81.50586{col 49}{space 1}    1.38{col 58}{space 3}0.167{col 66}{space 4} -47.2116{col 79}{space 3} 272.3441
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} 4150.504{col 38}{space 2} 1234.122{col 49}{space 1}    3.36{col 58}{space 3}0.001{col 66}{space 4} 1731.225{col 79}{space 3} 6569.782
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{browse `"/Users/felix/KTH/AppliedEconometrics/Project/Replication"' :dir}{com} : {txt}{stata `"seeout using "regression_robustness.txt""':seeout}

      Source {c |}       SS           df       MS      Number of obs   ={res}     6,116
{txt}{hline 13}{c +}{hline 34}   F(3, 6112)      = {res}     0.34
{txt}       Model {c |} {res}  286133704         3  95377901.4   {txt}Prob > F        ={res}    0.7976
{txt}    Residual {c |} {res} 1.7232e+12     6,112   281931106   {txt}R-squared       ={res}    0.0002
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.0003
{txt}       Total {c |} {res} 1.7234e+12     6,115   281839583   {txt}Root MSE        =   {res}  16791

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}                bizrev_2{col 26}{c |} Coefficient{col 38}  Std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2} 323.8082{col 38}{space 2} 431.1957{col 49}{space 1}    0.75{col 58}{space 3}0.453{col 66}{space 4}-521.4872{col 79}{space 3} 1169.104
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2}-.2889001{col 38}{space 2} 1.468879{col 49}{space 1}   -0.20{col 58}{space 3}0.844{col 66}{space 4} -3.16842{col 79}{space 3}  2.59062
{txt}area_business_total_base {c |}{col 26}{res}{space 2} 29.24223{col 38}{space 2} 44.46197{col 49}{space 1}    0.66{col 58}{space 3}0.511{col 66}{space 4}-57.91889{col 79}{space 3} 116.4034
{txt}{space 19}_cons {c |}{col 26}{res}{space 2}  5720.11{col 38}{space 2} 669.7774{col 49}{space 1}    8.54{col 58}{space 3}0.000{col 66}{space 4}  4407.11{col 79}{space 3}  7033.11
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{browse `"/Users/felix/KTH/AppliedEconometrics/Project/Replication"' :dir}{com} : {txt}{stata `"seeout using "regression_robustness.txt""':seeout}
Running regression without control: area_business_total_base

      Source {c |}       SS           df       MS      Number of obs   ={res}     6,608
{txt}{hline 13}{c +}{hline 34}   F(3, 6604)      = {res}     9.78
{txt}       Model {c |} {res} 3.0401e+10         3  1.0134e+10   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 6.8430e+12     6,604  1.0362e+09   {txt}R-squared       ={res}    0.0044
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0040
{txt}       Total {c |} {res} 6.8734e+12     6,607  1.0403e+09   {txt}Root MSE        =   {res}  32190

{txt}{hline 21}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            bizrev_1{col 22}{c |} Coefficient{col 34}  Std. err.{col 46}      t{col 54}   P>|t|{col 62}     [95% con{col 75}f. interval]
{hline 21}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 11}treatment {c |}{col 22}{res}{space 2} 1007.864{col 34}{space 2} 797.0376{col 45}{space 1}    1.26{col 54}{space 3}0.206{col 62}{space 4} -554.587{col 75}{space 3} 2570.315
{txt}{space 7}area_pop_base {c |}{col 22}{res}{space 2} .7841392{col 34}{space 2} 2.703182{col 45}{space 1}    0.29{col 54}{space 3}0.772{col 62}{space 4}-4.514971{col 75}{space 3}  6.08325
{txt}area_debt_total_base {c |}{col 22}{res}{space 2} .0798403{col 34}{space 2} .0149162{col 45}{space 1}    5.35{col 54}{space 3}0.000{col 62}{space 4} .0505996{col 75}{space 3} .1090809
{txt}{space 15}_cons {c |}{col 22}{res}{space 2} 1709.596{col 34}{space 2} 1204.775{col 45}{space 1}    1.42{col 54}{space 3}0.156{col 62}{space 4}-652.1532{col 75}{space 3} 4071.345
{txt}{hline 21}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{browse `"/Users/felix/KTH/AppliedEconometrics/Project/Replication"' :dir}{com} : {txt}{stata `"seeout using "regression_robustness.txt""':seeout}

      Source {c |}       SS           df       MS      Number of obs   ={res}     6,116
{txt}{hline 13}{c +}{hline 34}   F(3, 6112)      = {res}     0.84
{txt}       Model {c |} {res}  708244634         3   236081545   {txt}Prob > F        ={res}    0.4730
{txt}    Residual {c |} {res} 1.7227e+12     6,112   281862043   {txt}R-squared       ={res}    0.0004
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.0001
{txt}       Total {c |} {res} 1.7234e+12     6,115   281839583   {txt}Root MSE        =   {res}  16789

{txt}{hline 21}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            bizrev_2{col 22}{c |} Coefficient{col 34}  Std. err.{col 46}      t{col 54}   P>|t|{col 62}     [95% con{col 75}f. interval]
{hline 21}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 11}treatment {c |}{col 22}{res}{space 2} 362.0736{col 34}{space 2}  432.121{col 45}{space 1}    0.84{col 54}{space 3}0.402{col 62}{space 4}-485.0358{col 75}{space 3} 1209.183
{txt}{space 7}area_pop_base {c |}{col 22}{res}{space 2}-.1747181{col 34}{space 2} 1.469835{col 45}{space 1}   -0.12{col 54}{space 3}0.905{col 62}{space 4}-3.056112{col 75}{space 3} 2.706676
{txt}area_debt_total_base {c |}{col 22}{res}{space 2} .0106478{col 34}{space 2}  .007664{col 45}{space 1}    1.39{col 54}{space 3}0.165{col 62}{space 4}-.0043763{col 75}{space 3} .0256719
{txt}{space 15}_cons {c |}{col 22}{res}{space 2} 5507.568{col 34}{space 2} 646.3329{col 45}{space 1}    8.52{col 54}{space 3}0.000{col 62}{space 4} 4240.528{col 75}{space 3} 6774.609
{txt}{hline 21}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{browse `"/Users/felix/KTH/AppliedEconometrics/Project/Replication"' :dir}{com} : {txt}{stata `"seeout using "regression_robustness.txt""':seeout}

{com}. *** Treatment effect on â€° of borrowing from spandana ***
. * Define baseline regression variables 
. local baseline_controls "area_pop_base area_debt_total_base area_business_total_base"
{txt}
{com}. 
. regress spandana_1 treatment `baseline_controls'

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     6,811
{txt}{hline 13}{c +}{hline 34}   F(4, 6806)      = {res}   114.56
{txt}       Model {c |} {res} 49.1794181         4  12.2948545   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 730.423283     6,806  .107320494   {txt}R-squared       ={res}    0.0631
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0625
{txt}       Total {c |} {res} 779.602702     6,810  .114479104   {txt}Root MSE        =   {res}  .3276

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}              spandana_1{col 26}{c |} Coefficient{col 38}  Std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2} .1598333{col 38}{space 2} .0080109{col 49}{space 1}   19.95{col 58}{space 3}0.000{col 66}{space 4} .1441294{col 79}{space 3} .1755372
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2}-1.15e-06{col 38}{space 2} .0000272{col 49}{space 1}   -0.04{col 58}{space 3}0.966{col 66}{space 4}-.0000545{col 79}{space 3} .0000522
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} 1.21e-06{col 38}{space 2} 1.46e-07{col 49}{space 1}    8.30{col 58}{space 3}0.000{col 66}{space 4} 9.27e-07{col 79}{space 3} 1.50e-06
{txt}area_business_total_base {c |}{col 26}{res}{space 2}-.0021803{col 38}{space 2} .0008162{col 49}{space 1}   -2.67{col 58}{space 3}0.008{col 66}{space 4}-.0037804{col 79}{space 3}-.0005803
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} .0227863{col 38}{space 2} .0137743{col 49}{space 1}    1.65{col 58}{space 3}0.098{col 66}{space 4}-.0042157{col 79}{space 3} .0497883
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. regress spandana_2 treatment `baseline_controls'

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     6,142
{txt}{hline 13}{c +}{hline 34}   F(4, 6137)      = {res}    21.64
{txt}       Model {c |} {res} 10.9758446         4  2.74396115   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 778.206832     6,137  .126805741   {txt}R-squared       ={res}    0.0139
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0133
{txt}       Total {c |} {res} 789.182677     6,141  .128510451   {txt}Root MSE        =   {res}  .3561

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}              spandana_2{col 26}{c |} Coefficient{col 38}  Std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2} .0765014{col 38}{space 2} .0091668{col 49}{space 1}    8.35{col 58}{space 3}0.000{col 66}{space 4} .0585312{col 79}{space 3} .0944716
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2}-.0000459{col 38}{space 2} .0000312{col 49}{space 1}   -1.47{col 58}{space 3}0.141{col 66}{space 4}-.0001072{col 79}{space 3} .0000153
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} 3.87e-07{col 38}{space 2} 1.62e-07{col 49}{space 1}    2.38{col 58}{space 3}0.017{col 66}{space 4} 6.88e-08{col 79}{space 3} 7.06e-07
{txt}area_business_total_base {c |}{col 26}{res}{space 2}-.0026014{col 38}{space 2} .0009411{col 49}{space 1}   -2.76{col 58}{space 3}0.006{col 66}{space 4}-.0044464{col 79}{space 3}-.0007565
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} .1310122{col 38}{space 2} .0157801{col 49}{space 1}    8.30{col 58}{space 3}0.000{col 66}{space 4} .1000777{col 79}{space 3} .1619468
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. foreach var of varlist `baseline_controls' {c -(}
{txt}  2{com}.     display "Running regression without control: `var'"
{txt}  3{com}. 
.     * Build the list of controls excluding `var`
.     local controls_removed ""
{txt}  4{com}.     foreach control of varlist `baseline_controls' {c -(}
{txt}  5{com}.         if "`control'" != "`var'" {c -(}
{txt}  6{com}.             local controls_removed "`controls_removed' `control'"
{txt}  7{com}.         {c )-}
{txt}  8{com}.     {c )-}   
{txt}  9{com}.         * Run regression with remaining controls: but regressing on treatment
.     regress spandana_1 treatment `controls_removed'
{txt} 10{com}.         outreg2 using regression_robustness.txt, append ctitle("Effect of treatment on credit EL1: Excluding `var'")
{txt} 11{com}.         
.         regress spandana_2 treatment `controls_removed'
{txt} 12{com}.         outreg2 using regression_robustness.txt, append ctitle("Effect of treatment on credit EL2: Excluding `var'")
{txt} 13{com}. {c )-}
Running regression without control: area_pop_base

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     6,811
{txt}{hline 13}{c +}{hline 34}   F(3, 6807)      = {res}   152.77
{txt}       Model {c |} {res}  49.179226         3  16.3930753   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 730.423475     6,807  .107304756   {txt}R-squared       ={res}    0.0631
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0627
{txt}       Total {c |} {res} 779.602702     6,810  .114479104   {txt}Root MSE        =   {res} .32757

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}              spandana_1{col 26}{c |} Coefficient{col 38}  Std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2} .1598535{col 38}{space 2} .0079962{col 49}{space 1}   19.99{col 58}{space 3}0.000{col 66}{space 4} .1441784{col 79}{space 3} .1755285
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} 1.21e-06{col 38}{space 2} 1.46e-07{col 49}{space 1}    8.35{col 58}{space 3}0.000{col 66}{space 4} 9.29e-07{col 79}{space 3} 1.50e-06
{txt}area_business_total_base {c |}{col 26}{res}{space 2}-.0021775{col 38}{space 2} .0008135{col 49}{space 1}   -2.68{col 58}{space 3}0.007{col 66}{space 4}-.0037723{col 79}{space 3}-.0005828
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} .0223775{col 38}{space 2} .0098167{col 49}{space 1}    2.28{col 58}{space 3}0.023{col 66}{space 4} .0031337{col 79}{space 3} .0416213
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{browse `"/Users/felix/KTH/AppliedEconometrics/Project/Replication"' :dir}{com} : {txt}{stata `"seeout using "regression_robustness.txt""':seeout}

      Source {c |}       SS           df       MS      Number of obs   ={res}     6,142
{txt}{hline 13}{c +}{hline 34}   F(3, 6138)      = {res}    28.13
{txt}       Model {c |} {res} 10.7016669         3  3.56722231   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res}  778.48101     6,138  .126829751   {txt}R-squared       ={res}    0.0136
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0131
{txt}       Total {c |} {res} 789.182677     6,141  .128510451   {txt}Root MSE        =   {res} .35613

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}              spandana_2{col 26}{c |} Coefficient{col 38}  Std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2} .0772676{col 38}{space 2} .0091529{col 49}{space 1}    8.44{col 58}{space 3}0.000{col 66}{space 4} .0593248{col 79}{space 3} .0952105
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} 4.11e-07{col 38}{space 2} 1.62e-07{col 49}{space 1}    2.54{col 58}{space 3}0.011{col 66}{space 4} 9.39e-08{col 79}{space 3} 7.28e-07
{txt}area_business_total_base {c |}{col 26}{res}{space 2}-.0024768{col 38}{space 2} .0009374{col 49}{space 1}   -2.64{col 58}{space 3}0.008{col 66}{space 4}-.0043145{col 79}{space 3}-.0006392
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} .1147292{col 38}{space 2} .0112433{col 49}{space 1}   10.20{col 58}{space 3}0.000{col 66}{space 4} .0926884{col 79}{space 3}   .13677
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{browse `"/Users/felix/KTH/AppliedEconometrics/Project/Replication"' :dir}{com} : {txt}{stata `"seeout using "regression_robustness.txt""':seeout}
Running regression without control: area_debt_total_base

      Source {c |}       SS           df       MS      Number of obs   ={res}     6,811
{txt}{hline 13}{c +}{hline 34}   F(3, 6807)      = {res}   128.53
{txt}       Model {c |} {res} 41.7926534         3  13.9308845   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 737.810048     6,807    .1083899   {txt}R-squared       ={res}    0.0536
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0532
{txt}       Total {c |} {res} 779.602702     6,810  .114479104   {txt}Root MSE        =   {res} .32923

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}              spandana_1{col 26}{c |} Coefficient{col 38}  Std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2} .1537127{col 38}{space 2} .0080165{col 49}{space 1}   19.17{col 58}{space 3}0.000{col 66}{space 4} .1379978{col 79}{space 3} .1694276
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2}-.0000248{col 38}{space 2} .0000272{col 49}{space 1}   -0.91{col 58}{space 3}0.362{col 66}{space 4}-.0000781{col 79}{space 3} .0000285
{txt}area_business_total_base {c |}{col 26}{res}{space 2}-.0020637{col 38}{space 2} .0008202{col 49}{space 1}   -2.52{col 58}{space 3}0.012{col 66}{space 4}-.0036715{col 79}{space 3} -.000456
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} .0737403{col 38}{space 2} .0123905{col 49}{space 1}    5.95{col 58}{space 3}0.000{col 66}{space 4}  .049451{col 79}{space 3} .0980297
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{browse `"/Users/felix/KTH/AppliedEconometrics/Project/Replication"' :dir}{com} : {txt}{stata `"seeout using "regression_robustness.txt""':seeout}

      Source {c |}       SS           df       MS      Number of obs   ={res}     6,142
{txt}{hline 13}{c +}{hline 34}   F(3, 6138)      = {res}    26.94
{txt}       Model {c |} {res} 10.2551958         3  3.41839862   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 778.927481     6,138   .12690249   {txt}R-squared       ={res}    0.0130
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0125
{txt}       Total {c |} {res} 789.182677     6,141  .128510451   {txt}Root MSE        =   {res} .35623

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}              spandana_2{col 26}{c |} Coefficient{col 38}  Std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2}  .074429{col 38}{space 2}  .009129{col 49}{space 1}    8.15{col 58}{space 3}0.000{col 66}{space 4} .0565329{col 79}{space 3}  .092325
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2}-.0000533{col 38}{space 2} .0000311{col 49}{space 1}   -1.71{col 58}{space 3}0.087{col 66}{space 4}-.0001142{col 79}{space 3} 7.67e-06
{txt}area_business_total_base {c |}{col 26}{res}{space 2} -.002584{col 38}{space 2} .0009415{col 49}{space 1}   -2.74{col 58}{space 3}0.006{col 66}{space 4}-.0044296{col 79}{space 3}-.0007384
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} .1475323{col 38}{space 2} .0141825{col 49}{space 1}   10.40{col 58}{space 3}0.000{col 66}{space 4} .1197296{col 79}{space 3}  .175335
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{browse `"/Users/felix/KTH/AppliedEconometrics/Project/Replication"' :dir}{com} : {txt}{stata `"seeout using "regression_robustness.txt""':seeout}
Running regression without control: area_business_total_base

      Source {c |}       SS           df       MS      Number of obs   ={res}     6,811
{txt}{hline 13}{c +}{hline 34}   F(3, 6807)      = {res}   150.24
{txt}       Model {c |} {res} 48.4136267         3  16.1378756   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 731.189075     6,807  .107417229   {txt}R-squared       ={res}    0.0621
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0617
{txt}       Total {c |} {res} 779.602702     6,810  .114479104   {txt}Root MSE        =   {res} .32775

{txt}{hline 21}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          spandana_1{col 22}{c |} Coefficient{col 34}  Std. err.{col 46}      t{col 54}   P>|t|{col 62}     [95% con{col 75}f. interval]
{hline 21}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 11}treatment {c |}{col 22}{res}{space 2} .1613583{col 34}{space 2} .0079941{col 45}{space 1}   20.18{col 54}{space 3}0.000{col 62}{space 4} .1456873{col 75}{space 3} .1770293
{txt}{space 7}area_pop_base {c |}{col 22}{res}{space 2} 4.68e-06{col 34}{space 2} .0000271{col 45}{space 1}    0.17{col 54}{space 3}0.863{col 62}{space 4}-.0000485{col 75}{space 3} .0000579
{txt}area_debt_total_base {c |}{col 22}{res}{space 2} 1.21e-06{col 34}{space 2} 1.46e-07{col 45}{space 1}    8.25{col 54}{space 3}0.000{col 62}{space 4} 9.20e-07{col 75}{space 3} 1.49e-06
{txt}{space 15}_cons {c |}{col 22}{res}{space 2} .0049407{col 34}{space 2} .0120512{col 45}{space 1}    0.41{col 54}{space 3}0.682{col 62}{space 4}-.0186835{col 75}{space 3} .0285649
{txt}{hline 21}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{browse `"/Users/felix/KTH/AppliedEconometrics/Project/Replication"' :dir}{com} : {txt}{stata `"seeout using "regression_robustness.txt""':seeout}

      Source {c |}       SS           df       MS      Number of obs   ={res}     6,142
{txt}{hline 13}{c +}{hline 34}   F(3, 6138)      = {res}    26.28
{txt}       Model {c |} {res}  10.006999         3  3.33566634   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 779.175678     6,138  .126942926   {txt}R-squared       ={res}    0.0127
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0122
{txt}       Total {c |} {res} 789.182677     6,141  .128510451   {txt}Root MSE        =   {res} .35629

{txt}{hline 21}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          spandana_2{col 22}{c |} Coefficient{col 34}  Std. err.{col 46}      t{col 54}   P>|t|{col 62}     [95% con{col 75}f. interval]
{hline 21}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 11}treatment {c |}{col 22}{res}{space 2} .0782383{col 34}{space 2} .0091502{col 45}{space 1}    8.55{col 54}{space 3}0.000{col 62}{space 4} .0603007{col 75}{space 3} .0961759
{txt}{space 7}area_pop_base {c |}{col 22}{res}{space 2}-.0000382{col 34}{space 2} .0000311{col 45}{space 1}   -1.23{col 54}{space 3}0.220{col 62}{space 4}-.0000992{col 75}{space 3} .0000229
{txt}area_debt_total_base {c |}{col 22}{res}{space 2} 3.84e-07{col 34}{space 2} 1.63e-07{col 45}{space 1}    2.36{col 54}{space 3}0.018{col 62}{space 4} 6.52e-08{col 75}{space 3} 7.02e-07
{txt}{space 15}_cons {c |}{col 22}{res}{space 2} .1092788{col 34}{space 2} .0136892{col 45}{space 1}    7.98{col 54}{space 3}0.000{col 62}{space 4} .0824433{col 75}{space 3} .1361143
{txt}{hline 21}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{browse `"/Users/felix/KTH/AppliedEconometrics/Project/Replication"' :dir}{com} : {txt}{stata `"seeout using "regression_robustness.txt""':seeout}

{com}. *** Treatment effect on loan amount from spandana ***
. * Define baseline regression variables 
. local baseline_controls "area_pop_base area_debt_total_base area_business_total_base"
{txt}
{com}. 
. regress spandana_amt_1 treatment `baseline_controls'

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     6,811
{txt}{hline 13}{c +}{hline 34}   F(4, 6806)      = {res}    78.61
{txt}       Model {c |} {res} 5.8693e+09         4  1.4673e+09   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 1.2704e+11     6,806  18665733.8   {txt}R-squared       ={res}    0.0442
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0436
{txt}       Total {c |} {res} 1.3291e+11     6,810  19516633.5   {txt}Root MSE        =   {res} 4320.4

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          spandana_amt_1{col 26}{c |} Coefficient{col 38}  Std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2} 1693.892{col 38}{space 2} 105.6485{col 49}{space 1}   16.03{col 58}{space 3}0.000{col 66}{space 4} 1486.788{col 79}{space 3} 1900.997
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2} .2647641{col 38}{space 2} .3588049{col 49}{space 1}    0.74{col 58}{space 3}0.461{col 66}{space 4}-.4386056{col 79}{space 3} .9681337
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} .0157062{col 38}{space 2} .0019297{col 49}{space 1}    8.14{col 58}{space 3}0.000{col 66}{space 4} .0119234{col 79}{space 3} .0194891
{txt}area_business_total_base {c |}{col 26}{res}{space 2}-26.95815{col 38}{space 2} 10.76434{col 49}{space 1}   -2.50{col 58}{space 3}0.012{col 66}{space 4}-48.05961{col 79}{space 3}-5.856689
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} 140.8999{col 38}{space 2} 181.6567{col 49}{space 1}    0.78{col 58}{space 3}0.438{col 66}{space 4}-215.2041{col 79}{space 3} 497.0038
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. regress spandana_amt_2 treatment `baseline_controls'

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     6,142
{txt}{hline 13}{c +}{hline 34}   F(4, 6137)      = {res}    16.15
{txt}       Model {c |} {res} 2.8039e+09         4   700983069   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 2.6635e+11     6,137  43400249.2   {txt}R-squared       ={res}    0.0104
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0098
{txt}       Total {c |} {res} 2.6915e+11     6,141  43828572.2   {txt}Root MSE        =   {res} 6587.9

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          spandana_amt_2{col 26}{c |} Coefficient{col 38}  Std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2} 1202.183{col 38}{space 2} 169.5882{col 49}{space 1}    7.09{col 58}{space 3}0.000{col 66}{space 4} 869.7306{col 79}{space 3} 1534.635
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2}-.0839841{col 38}{space 2} .5778523{col 49}{space 1}   -0.15{col 58}{space 3}0.884{col 66}{space 4}-1.216777{col 79}{space 3} 1.048809
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} .0069451{col 38}{space 2} .0030054{col 49}{space 1}    2.31{col 58}{space 3}0.021{col 66}{space 4} .0010534{col 79}{space 3} .0128368
{txt}area_business_total_base {c |}{col 26}{res}{space 2}-50.79176{col 38}{space 2} 17.41119{col 49}{space 1}   -2.92{col 58}{space 3}0.004{col 66}{space 4} -84.9238{col 79}{space 3}-16.65971
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} 1715.132{col 38}{space 2} 291.9355{col 49}{space 1}    5.88{col 58}{space 3}0.000{col 66}{space 4} 1142.836{col 79}{space 3} 2287.428
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. foreach var of varlist `baseline_controls' {c -(}
{txt}  2{com}.     display "Running regression without control: `var'"
{txt}  3{com}. 
.     * Build the list of controls excluding `var`
.     local controls_removed ""
{txt}  4{com}.     foreach control of varlist `baseline_controls' {c -(}
{txt}  5{com}.         if "`control'" != "`var'" {c -(}
{txt}  6{com}.             local controls_removed "`controls_removed' `control'"
{txt}  7{com}.         {c )-}
{txt}  8{com}.     {c )-}   
{txt}  9{com}.         * Run regression with remaining controls: but regressing on treatment
.     regress spandana_amt_1 treatment `controls_removed'
{txt} 10{com}.         outreg2 using regression_robustness.txt, append ctitle("Effect of treatment on credit EL1: Excluding `var'")
{txt} 11{com}.         
.         regress spandana_amt_2 treatment `controls_removed'
{txt} 12{com}.         outreg2 using regression_robustness.txt, append ctitle("Effect of treatment on credit EL2: Excluding `var'")
{txt} 13{com}. {c )-}
Running regression without control: area_pop_base

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     6,811
{txt}{hline 13}{c +}{hline 34}   F(3, 6807)      = {res}   104.64
{txt}       Model {c |} {res} 5.8591e+09         3  1.9530e+09   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 1.2705e+11     6,807  18664484.8   {txt}R-squared       ={res}    0.0441
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0437
{txt}       Total {c |} {res} 1.3291e+11     6,810  19516633.5   {txt}Root MSE        =   {res} 4320.2

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          spandana_amt_1{col 26}{c |} Coefficient{col 38}  Std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2} 1689.261{col 38}{space 2} 105.4584{col 49}{space 1}   16.02{col 58}{space 3}0.000{col 66}{space 4}  1482.53{col 79}{space 3} 1895.992
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2}  .015557{col 38}{space 2}  .001919{col 49}{space 1}    8.11{col 58}{space 3}0.000{col 66}{space 4} .0117951{col 79}{space 3} .0193189
{txt}area_business_total_base {c |}{col 26}{res}{space 2}-27.59493{col 38}{space 2} 10.72933{col 49}{space 1}   -2.57{col 58}{space 3}0.010{col 66}{space 4}-48.62777{col 79}{space 3}-6.562085
{txt}{space 19}_cons {c |}{col 26}{res}{space 2}  234.924{col 38}{space 2} 129.4685{col 49}{space 1}    1.81{col 58}{space 3}0.070{col 66}{space 4}-18.87476{col 79}{space 3} 488.7228
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{browse `"/Users/felix/KTH/AppliedEconometrics/Project/Replication"' :dir}{com} : {txt}{stata `"seeout using "regression_robustness.txt""':seeout}

      Source {c |}       SS           df       MS      Number of obs   ={res}     6,142
{txt}{hline 13}{c +}{hline 34}   F(3, 6138)      = {res}    21.53
{txt}       Model {c |} {res} 2.8030e+09         3   934338507   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 2.6635e+11     6,138  43393327.8   {txt}R-squared       ={res}    0.0104
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0099
{txt}       Total {c |} {res} 2.6915e+11     6,141  43828572.2   {txt}Root MSE        =   {res} 6587.4

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          spandana_amt_2{col 26}{c |} Coefficient{col 38}  Std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2} 1203.584{col 38}{space 2} 169.3005{col 49}{space 1}    7.11{col 58}{space 3}0.000{col 66}{space 4} 871.6957{col 79}{space 3} 1535.472
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} .0069882{col 38}{space 2} .0029905{col 49}{space 1}    2.34{col 58}{space 3}0.019{col 66}{space 4} .0011259{col 79}{space 3} .0128506
{txt}area_business_total_base {c |}{col 26}{res}{space 2}-50.56396{col 38}{space 2} 17.33912{col 49}{space 1}   -2.92{col 58}{space 3}0.004{col 66}{space 4}-84.55472{col 79}{space 3} -16.5732
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} 1685.358{col 38}{space 2} 207.9668{col 49}{space 1}    8.10{col 58}{space 3}0.000{col 66}{space 4}  1277.67{col 79}{space 3} 2093.045
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{browse `"/Users/felix/KTH/AppliedEconometrics/Project/Replication"' :dir}{com} : {txt}{stata `"seeout using "regression_robustness.txt""':seeout}
Running regression without control: area_debt_total_base

      Source {c |}       SS           df       MS      Number of obs   ={res}     6,811
{txt}{hline 13}{c +}{hline 34}   F(3, 6807)      = {res}    81.95
{txt}       Model {c |} {res} 4.6328e+09         3  1.5443e+09   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 1.2828e+11     6,807  18844646.9   {txt}R-squared       ={res}    0.0349
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0344
{txt}       Total {c |} {res} 1.3291e+11     6,810  19516633.5   {txt}Root MSE        =   {res}   4341

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          spandana_amt_1{col 26}{c |} Coefficient{col 38}  Std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2} 1614.702{col 38}{space 2} 105.7025{col 49}{space 1}   15.28{col 58}{space 3}0.000{col 66}{space 4} 1407.492{col 79}{space 3} 1821.912
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2}-.0412979{col 38}{space 2}  .358535{col 49}{space 1}   -0.12{col 58}{space 3}0.908{col 66}{space 4}-.7441385{col 79}{space 3} .6615428
{txt}area_business_total_base {c |}{col 26}{res}{space 2}-25.44974{col 38}{space 2}  10.8142{col 49}{space 1}   -2.35{col 58}{space 3}0.019{col 66}{space 4}-46.64895{col 79}{space 3}-4.250529
{txt}{space 19}_cons {c |}{col 26}{res}{space 2}  800.155{col 38}{space 2} 163.3766{col 49}{space 1}    4.90{col 58}{space 3}0.000{col 66}{space 4} 479.8858{col 79}{space 3} 1120.424
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{browse `"/Users/felix/KTH/AppliedEconometrics/Project/Replication"' :dir}{com} : {txt}{stata `"seeout using "regression_robustness.txt""':seeout}

      Source {c |}       SS           df       MS      Number of obs   ={res}     6,142
{txt}{hline 13}{c +}{hline 34}   F(3, 6138)      = {res}    19.74
{txt}       Model {c |} {res} 2.5722e+09         3   857390846   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 2.6658e+11     6,138  43430936.7   {txt}R-squared       ={res}    0.0096
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0091
{txt}       Total {c |} {res} 2.6915e+11     6,141  43828572.2   {txt}Root MSE        =   {res} 6590.2

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          spandana_amt_2{col 26}{c |} Coefficient{col 38}  Std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2} 1165.018{col 38}{space 2} 168.8836{col 49}{space 1}    6.90{col 58}{space 3}0.000{col 66}{space 4} 833.9468{col 79}{space 3} 1496.089
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2}-.2158953{col 38}{space 2} .5752291{col 49}{space 1}   -0.38{col 58}{space 3}0.707{col 66}{space 4}-1.343546{col 79}{space 3} .9117555
{txt}area_business_total_base {c |}{col 26}{res}{space 2}-50.47951{col 38}{space 2} 17.41682{col 49}{space 1}   -2.90{col 58}{space 3}0.004{col 66}{space 4}-84.62259{col 79}{space 3}-16.33643
{txt}{space 19}_cons {c |}{col 26}{res}{space 2}  2011.39{col 38}{space 2} 262.3719{col 49}{space 1}    7.67{col 58}{space 3}0.000{col 66}{space 4} 1497.049{col 79}{space 3} 2525.731
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{browse `"/Users/felix/KTH/AppliedEconometrics/Project/Replication"' :dir}{com} : {txt}{stata `"seeout using "regression_robustness.txt""':seeout}
Running regression without control: area_business_total_base

      Source {c |}       SS           df       MS      Number of obs   ={res}     6,811
{txt}{hline 13}{c +}{hline 34}   F(3, 6807)      = {res}   102.64
{txt}       Model {c |} {res} 5.7522e+09         3  1.9174e+09   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 1.2716e+11     6,807  18680190.3   {txt}R-squared       ={res}    0.0433
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0429
{txt}       Total {c |} {res} 1.3291e+11     6,810  19516633.5   {txt}Root MSE        =   {res} 4322.1

{txt}{hline 21}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      spandana_amt_1{col 22}{c |} Coefficient{col 34}  Std. err.{col 46}      t{col 54}   P>|t|{col 62}     [95% con{col 75}f. interval]
{hline 21}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 11}treatment {c |}{col 22}{res}{space 2} 1712.748{col 34}{space 2} 105.4207{col 45}{space 1}   16.25{col 54}{space 3}0.000{col 62}{space 4}  1506.09{col 75}{space 3} 1919.405
{txt}{space 7}area_pop_base {c |}{col 22}{res}{space 2} .3368017{col 34}{space 2} .3577885{col 45}{space 1}    0.94{col 54}{space 3}0.347{col 62}{space 4}-.3645756{col 75}{space 3} 1.038179
{txt}area_debt_total_base {c |}{col 22}{res}{space 2}  .015623{col 34}{space 2} .0019302{col 45}{space 1}    8.09{col 54}{space 3}0.000{col 62}{space 4} .0118393{col 75}{space 3} .0194068
{txt}{space 15}_cons {c |}{col 22}{res}{space 2}-79.74845{col 34}{space 2} 158.9224{col 45}{space 1}   -0.50{col 54}{space 3}0.616{col 62}{space 4} -391.286{col 75}{space 3} 231.7891
{txt}{hline 21}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{browse `"/Users/felix/KTH/AppliedEconometrics/Project/Replication"' :dir}{com} : {txt}{stata `"seeout using "regression_robustness.txt""':seeout}

      Source {c |}       SS           df       MS      Number of obs   ={res}     6,142
{txt}{hline 13}{c +}{hline 34}   F(3, 6138)      = {res}    18.68
{txt}       Model {c |} {res} 2.4346e+09         3   811532110   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 2.6672e+11     6,138  43453350.5   {txt}R-squared       ={res}    0.0090
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0086
{txt}       Total {c |} {res} 2.6915e+11     6,141  43828572.2   {txt}Root MSE        =   {res} 6591.9

{txt}{hline 21}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      spandana_amt_2{col 22}{c |} Coefficient{col 34}  Std. err.{col 46}      t{col 54}   P>|t|{col 62}     [95% con{col 75}f. interval]
{hline 21}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 11}treatment {c |}{col 22}{res}{space 2} 1236.095{col 34}{space 2} 169.2928{col 45}{space 1}    7.30{col 54}{space 3}0.000{col 62}{space 4} 904.2221{col 75}{space 3} 1567.969
{txt}{space 7}area_pop_base {c |}{col 22}{res}{space 2} .0677615{col 34}{space 2} .5758582{col 45}{space 1}    0.12{col 54}{space 3}0.906{col 62}{space 4}-1.061122{col 75}{space 3} 1.196645
{txt}area_debt_total_base {c |}{col 22}{res}{space 2} .0068771{col 34}{space 2} .0030072{col 45}{space 1}    2.29{col 54}{space 3}0.022{col 62}{space 4}  .000982{col 75}{space 3} .0127722
{txt}{space 15}_cons {c |}{col 22}{res}{space 2} 1290.795{col 34}{space 2} 253.2702{col 45}{space 1}    5.10{col 54}{space 3}0.000{col 62}{space 4} 794.2964{col 75}{space 3} 1787.293
{txt}{hline 21}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{browse `"/Users/felix/KTH/AppliedEconometrics/Project/Replication"' :dir}{com} : {txt}{stata `"seeout using "regression_robustness.txt""':seeout}

{com}. ********************************************************************************
. ********** Regression Robustness: Add Additional Controls ***********************
. ********************************************************************************
. 
. * Load endline dataset
. use "$datadir/2013-0533_data_endlines1and2.dta", clear
{txt}(Endline data for "The miracle of microfinance?" (Banerjee et al.), AEJ 2014)

{com}. 
. *Run regression with baseline + additional controls: treatment effect on total outstanding loan amount from spandana*
. 
. * Baseline and additional control variables
. local baseline_controls "area_pop_base area_debt_total_base area_business_total_base"
{txt}
{com}. local additional_controls "adults_1 children_1 male_head_1 hhsize_1"
{txt}
{com}. 
. regress spandana_amt_1 treatment `baseline_controls' `additional_controls'

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     6,799
{txt}{hline 13}{c +}{hline 34}   F(8, 6790)      = {res}    42.43
{txt}       Model {c |} {res} 6.3079e+09         8   788483916   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 1.2619e+11     6,790  18584991.1   {txt}R-squared       ={res}    0.0476
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0465
{txt}       Total {c |} {res} 1.3250e+11     6,798    19491021   {txt}Root MSE        =   {res}   4311

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          spandana_amt_1{col 26}{c |} Coefficient{col 38}  Std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2}  1700.16{col 38}{space 2} 105.5337{col 49}{space 1}   16.11{col 58}{space 3}0.000{col 66}{space 4} 1493.281{col 79}{space 3} 1907.039
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2} .2082972{col 38}{space 2} .3586056{col 49}{space 1}    0.58{col 58}{space 3}0.561{col 66}{space 4}-.4946822{col 79}{space 3} .9112766
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} .0154871{col 38}{space 2} .0019277{col 49}{space 1}    8.03{col 58}{space 3}0.000{col 66}{space 4} .0117082{col 79}{space 3} .0192661
{txt}area_business_total_base {c |}{col 26}{res}{space 2}-27.87307{col 38}{space 2} 10.75445{col 49}{space 1}   -2.59{col 58}{space 3}0.010{col 66}{space 4}-48.95516{col 79}{space 3}-6.790975
{txt}{space 16}adults_1 {c |}{col 26}{res}{space 2} 211.1379{col 38}{space 2}  265.371{col 49}{space 1}    0.80{col 58}{space 3}0.426{col 66}{space 4}-309.0724{col 79}{space 3} 731.3482
{txt}{space 14}children_1 {c |}{col 26}{res}{space 2} 229.6386{col 38}{space 2} 266.1627{col 49}{space 1}    0.86{col 58}{space 3}0.388{col 66}{space 4}-292.1238{col 79}{space 3} 751.4009
{txt}{space 13}male_head_1 {c |}{col 26}{res}{space 2}  156.152{col 38}{space 2} 175.5077{col 49}{space 1}    0.89{col 58}{space 3}0.374{col 66}{space 4}-187.8981{col 79}{space 3}  500.202
{txt}{space 16}hhsize_1 {c |}{col 26}{res}{space 2}-104.3943{col 38}{space 2} 264.3315{col 49}{space 1}   -0.39{col 58}{space 3}0.693{col 66}{space 4}-622.5668{col 79}{space 3} 413.7782
{txt}{space 19}_cons {c |}{col 26}{res}{space 2}-601.6032{col 38}{space 2} 271.3895{col 49}{space 1}   -2.22{col 58}{space 3}0.027{col 66}{space 4}-1133.612{col 79}{space 3}-69.59474
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. * Export results
. outreg2 using regression_addcontrols.txt, append ctitle("With Additional Controls")
{browse `"/Users/felix/KTH/AppliedEconometrics/Project/Replication"' :dir} : {txt}{stata `"seeout using "regression_addcontrols.txt""':seeout}

{com}. 
. * Baseline and additional control variables
. local baseline_controls "area_pop_base area_debt_total_base area_business_total_base"
{txt}
{com}. local additional_controls "adults_2 children_2 male_head_2 hhsize_2"
{txt}
{com}. 
. regress spandana_amt_2 treatment `baseline_controls' `additional_controls'

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     6,131
{txt}{hline 13}{c +}{hline 34}   F(8, 6122)      = {res}    11.48
{txt}       Model {c |} {res} 3.9774e+09         8   497180671   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 2.6512e+11     6,122  43306254.2   {txt}R-squared       ={res}    0.0148
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0135
{txt}       Total {c |} {res} 2.6910e+11     6,130  43898586.2   {txt}Root MSE        =   {res} 6580.7

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          spandana_amt_2{col 26}{c |} Coefficient{col 38}  Std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2} 1201.678{col 38}{space 2} 169.5872{col 49}{space 1}    7.09{col 58}{space 3}0.000{col 66}{space 4} 869.2278{col 79}{space 3} 1534.129
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2} -.145489{col 38}{space 2} .5780916{col 49}{space 1}   -0.25{col 58}{space 3}0.801{col 66}{space 4}-1.278752{col 79}{space 3} .9877738
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} .0067982{col 38}{space 2} .0030042{col 49}{space 1}    2.26{col 58}{space 3}0.024{col 66}{space 4} .0009088{col 79}{space 3} .0126876
{txt}area_business_total_base {c |}{col 26}{res}{space 2}-51.72613{col 38}{space 2} 17.43505{col 49}{space 1}   -2.97{col 58}{space 3}0.003{col 66}{space 4}-85.90496{col 79}{space 3} -17.5473
{txt}{space 16}adults_2 {c |}{col 26}{res}{space 2} 185.1761{col 38}{space 2} 86.39098{col 49}{space 1}    2.14{col 58}{space 3}0.032{col 66}{space 4} 15.81938{col 79}{space 3} 354.5328
{txt}{space 14}children_2 {c |}{col 26}{res}{space 2} 249.8721{col 38}{space 2} 95.64531{col 49}{space 1}    2.61{col 58}{space 3}0.009{col 66}{space 4} 62.37365{col 79}{space 3} 437.3705
{txt}{space 13}male_head_2 {c |}{col 26}{res}{space 2} 235.9353{col 38}{space 2} 217.7034{col 49}{space 1}    1.08{col 58}{space 3}0.279{col 66}{space 4}-190.8399{col 79}{space 3} 662.7106
{txt}{space 16}hhsize_2 {c |}{col 26}{res}{space 2}-28.31542{col 38}{space 2} 73.48871{col 49}{space 1}   -0.39{col 58}{space 3}0.700{col 66}{space 4}-172.3791{col 79}{space 3} 115.7483
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} 546.8781{col 38}{space 2} 402.1373{col 49}{space 1}    1.36{col 58}{space 3}0.174{col 66}{space 4}-241.4524{col 79}{space 3} 1335.209
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. * Export results
. outreg2 using regression_addcontrols.txt, append ctitle("With Additional Controls")
{browse `"/Users/felix/KTH/AppliedEconometrics/Project/Replication"' :dir} : {txt}{stata `"seeout using "regression_addcontrols.txt""':seeout}

{com}. 
{txt}end of do-file

{com}. 