{smcl}
{txt}{sf}{ul off}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/felix/KTH/AppliedEconometrics/Project/robustness_log.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}27 Dec 2024, 09:38:11
{txt}
{com}. cd "$outputdir"
{res}/Users/felix/KTH/AppliedEconometrics/Project/Replication
{txt}
{com}. 
. * Load baseline dataset
. use "$datadir/2013-0533_data_baseline.dta", clear
{txt}(Baseline data for "The miracle of microfinance?" (Banerjee et al.), AEJ 2014)

{com}. 
. * Define key variables for summary statistics
. local hh_composition "hh_size adult children male_head head_age head_noeduc"
{txt}
{com}. local credit_access "spandana othermfi bank informal anyloan"
{txt}
{com}. local loan_amt "spandana_amt othermfi_amt bank_amt informal_amt anyloan_amt"
{txt}
{com}. 
. * Exclude outliers (1st and 99th percentiles for numeric variables)
. foreach var of varlist `hh_composition' `credit_access' `loan_amt' {c -(}
{txt}  2{com}.     quietly summarize `var', detail
{txt}  3{com}.     local p1 = r(p1)
{txt}  4{com}.     local p99 = r(p99)
{txt}  5{com}.     drop if `var' < `p1' | `var' > `p99'
{txt}  6{com}. {c )-}
{txt}(23 observations deleted)
(9 observations deleted)
(10 observations deleted)
(10 observations deleted)
(36 observations deleted)
(0 observations deleted)
(19 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(22 observations deleted)
(26 observations deleted)
(26 observations deleted)
(21 observations deleted)

{com}. 
. * Recalculate summary statistics
. summarize `hh_composition' `credit_access' `loan_amt'

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}hh_size {c |}{res}      2,598    4.976905    1.586016          2         10
{txt}{space 6}adults {c |}{res}      2,598    3.328329    1.391284          1          8
{txt}{space 4}children {c |}{res}      2,598    1.648191     1.19916          0          5
{txt}{space 3}male_head {c |}{res}      2,598    .9026174    .2965351          0          1
{txt}{space 4}head_age {c |}{res}      2,598    40.52386    10.27837         22         70
{txt}{hline 13}{c +}{hline 57}
{space 1}head_noeduc {c |}{res}      2,598    .3722094    .4834869          0          1
{txt}{space 4}spandana {c |}{res}      2,598           0           0          0          0
{txt}{space 4}othermfi {c |}{res}      2,598    .0050038    .0705743          0          1
{txt}{space 8}bank {c |}{res}      2,598    .0273287    .1630708          0          1
{txt}{space 4}informal {c |}{res}      2,598    .6289453    .4831801          0          1
{txt}{hline 13}{c +}{hline 57}
{space 5}anyloan {c |}{res}      2,598    .6674365    .4712223          0          1
{txt}spandana_amt {c |}{res}      2,598           0           0          0          0
{txt}othermfi_amt {c |}{res}      2,598    18.47575    278.2815          0       5000
{txt}{space 4}bank_amt {c |}{res}      2,598    825.8276    6406.564          0      96000
{txt}informal_amt {c |}{res}      2,598    20843.41    33522.16          0     200000
{txt}{hline 13}{c +}{hline 57}
{space 1}anyloan_amt {c |}{res}      2,598     22970.2    35344.99          0     200000
{txt}
{com}. 
. * Store summary statistics
. estpost summarize `hh_composition' `credit_access' `loan_amt'

{txt}{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 9:e(count)}{space 1}{space 1}{ralign 9:e(sum_w)}{space 1}{space 1}{ralign 9:e(mean)}{space 1}{space 1}{ralign 9:e(Var)}{space 1}{space 1}{ralign 9:e(sd)}{space 1}{space 1}{ralign 9:e(min)}{space 1}{space 1}{ralign 9:e(max)}{space 1}{space 1}{ralign 9:e(sum)}{space 1}
{space 0}{hline 13}{c   +}{hline 11}{hline 11}{hline 11}{hline 11}{hline 11}{hline 11}{hline 11}{hline 11}
{space 0}{space 0}{ralign 12:hh_size}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     2598}}}{space 1}{space 1}{ralign 9:{res:{sf:     2598}}}{space 1}{space 1}{ralign 9:{res:{sf: 4.976905}}}{space 1}{space 1}{ralign 9:{res:{sf: 2.515446}}}{space 1}{space 1}{ralign 9:{res:{sf: 1.586016}}}{space 1}{space 1}{ralign 9:{res:{sf:        2}}}{space 1}{space 1}{ralign 9:{res:{sf:       10}}}{space 1}{space 1}{ralign 9:{res:{sf:    12930}}}{space 1}
{space 0}{space 0}{ralign 12:adults}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     2598}}}{space 1}{space 1}{ralign 9:{res:{sf:     2598}}}{space 1}{space 1}{ralign 9:{res:{sf: 3.328329}}}{space 1}{space 1}{ralign 9:{res:{sf:  1.93567}}}{space 1}{space 1}{ralign 9:{res:{sf: 1.391284}}}{space 1}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}{space 1}{ralign 9:{res:{sf:        8}}}{space 1}{space 1}{ralign 9:{res:{sf:     8647}}}{space 1}
{space 0}{space 0}{ralign 12:children}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     2598}}}{space 1}{space 1}{ralign 9:{res:{sf:     2598}}}{space 1}{space 1}{ralign 9:{res:{sf: 1.648191}}}{space 1}{space 1}{ralign 9:{res:{sf: 1.437985}}}{space 1}{space 1}{ralign 9:{res:{sf:  1.19916}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        5}}}{space 1}{space 1}{ralign 9:{res:{sf:     4282}}}{space 1}
{space 0}{space 0}{ralign 12:male_head}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     2598}}}{space 1}{space 1}{ralign 9:{res:{sf:     2598}}}{space 1}{space 1}{ralign 9:{res:{sf: .9026174}}}{space 1}{space 1}{ralign 9:{res:{sf: .0879331}}}{space 1}{space 1}{ralign 9:{res:{sf: .2965351}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}{space 1}{ralign 9:{res:{sf:     2345}}}{space 1}
{space 0}{space 0}{ralign 12:head_age}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     2598}}}{space 1}{space 1}{ralign 9:{res:{sf:     2598}}}{space 1}{space 1}{ralign 9:{res:{sf: 40.52386}}}{space 1}{space 1}{ralign 9:{res:{sf:  105.645}}}{space 1}{space 1}{ralign 9:{res:{sf: 10.27837}}}{space 1}{space 1}{ralign 9:{res:{sf:       22}}}{space 1}{space 1}{ralign 9:{res:{sf:       70}}}{space 1}{space 1}{ralign 9:{res:{sf:   105281}}}{space 1}
{space 0}{space 0}{ralign 12:head_noeduc}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     2598}}}{space 1}{space 1}{ralign 9:{res:{sf:     2598}}}{space 1}{space 1}{ralign 9:{res:{sf: .3722094}}}{space 1}{space 1}{ralign 9:{res:{sf: .2337595}}}{space 1}{space 1}{ralign 9:{res:{sf: .4834869}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}{space 1}{ralign 9:{res:{sf:      967}}}{space 1}
{space 0}{space 0}{ralign 12:spandana}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     2598}}}{space 1}{space 1}{ralign 9:{res:{sf:     2598}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:othermfi}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     2598}}}{space 1}{space 1}{ralign 9:{res:{sf:     2598}}}{space 1}{space 1}{ralign 9:{res:{sf: .0050038}}}{space 1}{space 1}{ralign 9:{res:{sf: .0049807}}}{space 1}{space 1}{ralign 9:{res:{sf: .0705743}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}{space 1}{ralign 9:{res:{sf:       13}}}{space 1}
{space 0}{space 0}{ralign 12:bank}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     2598}}}{space 1}{space 1}{ralign 9:{res:{sf:     2598}}}{space 1}{space 1}{ralign 9:{res:{sf: .0273287}}}{space 1}{space 1}{ralign 9:{res:{sf: .0265921}}}{space 1}{space 1}{ralign 9:{res:{sf: .1630708}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}{space 1}{ralign 9:{res:{sf:       71}}}{space 1}
{space 0}{space 0}{ralign 12:informal}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     2598}}}{space 1}{space 1}{ralign 9:{res:{sf:     2598}}}{space 1}{space 1}{ralign 9:{res:{sf: .6289453}}}{space 1}{space 1}{ralign 9:{res:{sf:  .233463}}}{space 1}{space 1}{ralign 9:{res:{sf: .4831801}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}{space 1}{ralign 9:{res:{sf:     1634}}}{space 1}
{space 0}{space 0}{ralign 12:anyloan}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     2598}}}{space 1}{space 1}{ralign 9:{res:{sf:     2598}}}{space 1}{space 1}{ralign 9:{res:{sf: .6674365}}}{space 1}{space 1}{ralign 9:{res:{sf: .2220505}}}{space 1}{space 1}{ralign 9:{res:{sf: .4712223}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}{space 1}{ralign 9:{res:{sf:     1734}}}{space 1}
{space 0}{space 0}{ralign 12:spandana_amt}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     2598}}}{space 1}{space 1}{ralign 9:{res:{sf:     2598}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}
{space 0}{space 0}{ralign 12:othermfi_amt}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     2598}}}{space 1}{space 1}{ralign 9:{res:{sf:     2598}}}{space 1}{space 1}{ralign 9:{res:{sf: 18.47575}}}{space 1}{space 1}{ralign 9:{res:{sf: 77440.57}}}{space 1}{space 1}{ralign 9:{res:{sf: 278.2815}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:     5000}}}{space 1}{space 1}{ralign 9:{res:{sf:    48000}}}{space 1}
{space 0}{space 0}{ralign 12:bank_amt}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     2598}}}{space 1}{space 1}{ralign 9:{res:{sf:     2598}}}{space 1}{space 1}{ralign 9:{res:{sf: 825.8276}}}{space 1}{space 1}{ralign 9:{res:{sf: 4.10e+07}}}{space 1}{space 1}{ralign 9:{res:{sf: 6406.564}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:    96000}}}{space 1}{space 1}{ralign 9:{res:{sf:  2145500}}}{space 1}
{space 0}{space 0}{ralign 12:informal_amt}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     2598}}}{space 1}{space 1}{ralign 9:{res:{sf:     2598}}}{space 1}{space 1}{ralign 9:{res:{sf: 20843.41}}}{space 1}{space 1}{ralign 9:{res:{sf: 1.12e+09}}}{space 1}{space 1}{ralign 9:{res:{sf: 33522.16}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:   200000}}}{space 1}{space 1}{ralign 9:{res:{sf: 5.42e+07}}}{space 1}
{space 0}{space 0}{ralign 12:anyloan_amt}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     2598}}}{space 1}{space 1}{ralign 9:{res:{sf:     2598}}}{space 1}{space 1}{ralign 9:{res:{sf:  22970.2}}}{space 1}{space 1}{ralign 9:{res:{sf: 1.25e+09}}}{space 1}{space 1}{ralign 9:{res:{sf: 35344.99}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:   200000}}}{space 1}{space 1}{ralign 9:{res:{sf: 5.97e+07}}}{space 1}

{com}. 
. * Export summary statistics to a text file
. esttab using table1a_nooutliers.txt, replace cells("mean sd min max") label title("Excluding Outliers")
{res}{txt}(output written to {browse  `"table1a_nooutliers.txt"'})

{com}. 
. ********************************************************************************
. *************         Table 1B: Endline Summary Statistics        **************
. ********************************************************************************
. * ENDLINE 1 *
. * Load baseline dataset
. use "$datadir/2013-0533_data_endlines1and2.dta", clear
{txt}(Endline data for "The miracle of microfinance?" (Banerjee et al.), AEJ 2014)

{com}. 
. * Define key variables for summary statistics
. local hh_composition_1 "hhsize_1 adults_1 children_1 male_head_1 head_age_1 head_noeduc_1"
{txt}
{com}. local credit_access_1 "spandana_1 othermfi_1 anybank_1 anyinformal_1 anyloan_1"
{txt}
{com}. local loan_amt_1 "spandana_amt_1 othermfi_amt_1 bank_amt_1 informal_amt_1 anyloan_amt_1"
{txt}
{com}. 
. 
. * Exclude outliers (1st and 99th percentiles for numeric variables)
. 
. foreach var of varlist `hh_composition_1' `credit_access_1' `loan_amt_1' {c -(}
{txt}  2{com}.     quietly summarize `var', detail
{txt}  3{com}.     local p1 = r(p1)
{txt}  4{com}.     local p99 = r(p99)
{txt}  5{com}.     drop if `var' < `p1' | `var' > `p99'
{txt}  6{com}. {c )-}
{txt}(57 observations deleted)
(118 observations deleted)
(39 observations deleted)
(9 observations deleted)
(78 observations deleted)
(4 observations deleted)
(49 observations deleted)
(142 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(39 observations deleted)
(63 observations deleted)
(62 observations deleted)
(60 observations deleted)
(59 observations deleted)

{com}. 
. * Recalculate summary statistics
. summarize `hh_composition_1' `credit_access_1' `loan_amt_1'

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}hhsize_1 {c |}{res}      6,084    5.465483    1.806056          2         13
{txt}{space 4}adults_1 {c |}{res}      6,084    3.767258    1.536366          2          8
{txt}{space 2}children_1 {c |}{res}      6,084    1.680309    1.208442          0          5
{txt}{space 1}male_head_1 {c |}{res}      6,084    .9051611    .2930164          0          1
{txt}{space 2}head_age_1 {c |}{res}      6,084    40.83679    9.893157         23         70
{txt}{hline 13}{c +}{hline 57}
head_noedu~1 {c |}{res}      6,084     .312952    .4637331          0          1
{txt}{space 2}spandana_1 {c |}{res}      6,084    .1283695    .3345283          0          1
{txt}{space 2}othermfi_1 {c |}{res}      6,084    .1336292    .3402814          0          1
{txt}{space 3}anybank_1 {c |}{res}      6,084    .0721565    .2587681          0          1
{txt}anyinforma~1 {c |}{res}      6,084    .7468771    .4348365          0          1
{txt}{hline 13}{c +}{hline 57}
{space 3}anyloan_1 {c |}{res}      6,084    .8754109    .3302795          0          1
{txt}spandana_a~1 {c |}{res}      6,084    1279.846    3557.149          0      20000
{txt}othermfi_a~1 {c |}{res}      6,084     1411.27    3922.939          0      22750
{txt}{space 2}bank_amt_1 {c |}{res}      6,084    3486.886    15812.33          0     153000
{txt}informal_a~1 {c |}{res}      6,084    33767.67    51290.36          0     350000
{txt}{hline 13}{c +}{hline 57}
anyloan_am~1 {c |}{res}      6,084    47476.87    58565.24          0     325000
{txt}
{com}. 
. * Store summary statistics
. estpost summarize `hh_composition_1' `credit_access_1' `loan_amt_1'

{txt}{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 9:e(count)}{space 1}{space 1}{ralign 9:e(sum_w)}{space 1}{space 1}{ralign 9:e(mean)}{space 1}{space 1}{ralign 9:e(Var)}{space 1}{space 1}{ralign 9:e(sd)}{space 1}{space 1}{ralign 9:e(min)}{space 1}{space 1}{ralign 9:e(max)}{space 1}{space 1}{ralign 9:e(sum)}{space 1}
{space 0}{hline 13}{c   +}{hline 11}{hline 11}{hline 11}{hline 11}{hline 11}{hline 11}{hline 11}{hline 11}
{space 0}{space 0}{ralign 12:hhsize_1}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     6084}}}{space 1}{space 1}{ralign 9:{res:{sf:     6084}}}{space 1}{space 1}{ralign 9:{res:{sf: 5.465483}}}{space 1}{space 1}{ralign 9:{res:{sf: 3.261837}}}{space 1}{space 1}{ralign 9:{res:{sf: 1.806056}}}{space 1}{space 1}{ralign 9:{res:{sf:        2}}}{space 1}{space 1}{ralign 9:{res:{sf:       13}}}{space 1}{space 1}{ralign 9:{res:{sf:    33252}}}{space 1}
{space 0}{space 0}{ralign 12:adults_1}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     6084}}}{space 1}{space 1}{ralign 9:{res:{sf:     6084}}}{space 1}{space 1}{ralign 9:{res:{sf: 3.767258}}}{space 1}{space 1}{ralign 9:{res:{sf:  2.36042}}}{space 1}{space 1}{ralign 9:{res:{sf: 1.536366}}}{space 1}{space 1}{ralign 9:{res:{sf:        2}}}{space 1}{space 1}{ralign 9:{res:{sf:        8}}}{space 1}{space 1}{ralign 9:{res:{sf:    22920}}}{space 1}
{space 0}{space 0}{ralign 12:children_1}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     6084}}}{space 1}{space 1}{ralign 9:{res:{sf:     6084}}}{space 1}{space 1}{ralign 9:{res:{sf: 1.680309}}}{space 1}{space 1}{ralign 9:{res:{sf: 1.460332}}}{space 1}{space 1}{ralign 9:{res:{sf: 1.208442}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        5}}}{space 1}{space 1}{ralign 9:{res:{sf:    10223}}}{space 1}
{space 0}{space 0}{ralign 12:male_head_1}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     6084}}}{space 1}{space 1}{ralign 9:{res:{sf:     6084}}}{space 1}{space 1}{ralign 9:{res:{sf: .9051611}}}{space 1}{space 1}{ralign 9:{res:{sf: .0858586}}}{space 1}{space 1}{ralign 9:{res:{sf: .2930164}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}{space 1}{ralign 9:{res:{sf:     5507}}}{space 1}
{space 0}{space 0}{ralign 12:head_age_1}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     6084}}}{space 1}{space 1}{ralign 9:{res:{sf:     6084}}}{space 1}{space 1}{ralign 9:{res:{sf: 40.83679}}}{space 1}{space 1}{ralign 9:{res:{sf: 97.87456}}}{space 1}{space 1}{ralign 9:{res:{sf: 9.893157}}}{space 1}{space 1}{ralign 9:{res:{sf:       23}}}{space 1}{space 1}{ralign 9:{res:{sf:       70}}}{space 1}{space 1}{ralign 9:{res:{sf:   248451}}}{space 1}
{space 0}{space 0}{ralign 12:head_noedu~1}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     6084}}}{space 1}{space 1}{ralign 9:{res:{sf:     6084}}}{space 1}{space 1}{ralign 9:{res:{sf:  .312952}}}{space 1}{space 1}{ralign 9:{res:{sf: .2150484}}}{space 1}{space 1}{ralign 9:{res:{sf: .4637331}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}{space 1}{ralign 9:{res:{sf:     1904}}}{space 1}
{space 0}{space 0}{ralign 12:spandana_1}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     6084}}}{space 1}{space 1}{ralign 9:{res:{sf:     6084}}}{space 1}{space 1}{ralign 9:{res:{sf: .1283695}}}{space 1}{space 1}{ralign 9:{res:{sf: .1119092}}}{space 1}{space 1}{ralign 9:{res:{sf: .3345283}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}{space 1}{ralign 9:{res:{sf:      781}}}{space 1}
{space 0}{space 0}{ralign 12:othermfi_1}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     6084}}}{space 1}{space 1}{ralign 9:{res:{sf:     6084}}}{space 1}{space 1}{ralign 9:{res:{sf: .1336292}}}{space 1}{space 1}{ralign 9:{res:{sf: .1157915}}}{space 1}{space 1}{ralign 9:{res:{sf: .3402814}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}{space 1}{ralign 9:{res:{sf:      813}}}{space 1}
{space 0}{space 0}{ralign 12:anybank_1}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     6084}}}{space 1}{space 1}{ralign 9:{res:{sf:     6084}}}{space 1}{space 1}{ralign 9:{res:{sf: .0721565}}}{space 1}{space 1}{ralign 9:{res:{sf: .0669609}}}{space 1}{space 1}{ralign 9:{res:{sf: .2587681}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}{space 1}{ralign 9:{res:{sf:      439}}}{space 1}
{space 0}{space 0}{ralign 12:anyinforma~1}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     6084}}}{space 1}{space 1}{ralign 9:{res:{sf:     6084}}}{space 1}{space 1}{ralign 9:{res:{sf: .7468771}}}{space 1}{space 1}{ralign 9:{res:{sf: .1890828}}}{space 1}{space 1}{ralign 9:{res:{sf: .4348365}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}{space 1}{ralign 9:{res:{sf:     4544}}}{space 1}
{space 0}{space 0}{ralign 12:anyloan_1}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     6084}}}{space 1}{space 1}{ralign 9:{res:{sf:     6084}}}{space 1}{space 1}{ralign 9:{res:{sf: .8754109}}}{space 1}{space 1}{ralign 9:{res:{sf: .1090846}}}{space 1}{space 1}{ralign 9:{res:{sf: .3302795}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}{space 1}{ralign 9:{res:{sf:     5326}}}{space 1}
{space 0}{space 0}{ralign 12:spandana_a~1}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     6084}}}{space 1}{space 1}{ralign 9:{res:{sf:     6084}}}{space 1}{space 1}{ralign 9:{res:{sf: 1279.846}}}{space 1}{space 1}{ralign 9:{res:{sf: 1.27e+07}}}{space 1}{space 1}{ralign 9:{res:{sf: 3557.149}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:    20000}}}{space 1}{space 1}{ralign 9:{res:{sf:  7786586}}}{space 1}
{space 0}{space 0}{ralign 12:othermfi_a~1}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     6084}}}{space 1}{space 1}{ralign 9:{res:{sf:     6084}}}{space 1}{space 1}{ralign 9:{res:{sf:  1411.27}}}{space 1}{space 1}{ralign 9:{res:{sf: 1.54e+07}}}{space 1}{space 1}{ralign 9:{res:{sf: 3922.939}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:    22750}}}{space 1}{space 1}{ralign 9:{res:{sf:  8586167}}}{space 1}
{space 0}{space 0}{ralign 12:bank_amt_1}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     6084}}}{space 1}{space 1}{ralign 9:{res:{sf:     6084}}}{space 1}{space 1}{ralign 9:{res:{sf: 3486.886}}}{space 1}{space 1}{ralign 9:{res:{sf: 2.50e+08}}}{space 1}{space 1}{ralign 9:{res:{sf: 15812.33}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:   153000}}}{space 1}{space 1}{ralign 9:{res:{sf: 2.12e+07}}}{space 1}
{space 0}{space 0}{ralign 12:informal_a~1}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     6084}}}{space 1}{space 1}{ralign 9:{res:{sf:     6084}}}{space 1}{space 1}{ralign 9:{res:{sf: 33767.67}}}{space 1}{space 1}{ralign 9:{res:{sf: 2.63e+09}}}{space 1}{space 1}{ralign 9:{res:{sf: 51290.36}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:   350000}}}{space 1}{space 1}{ralign 9:{res:{sf: 2.05e+08}}}{space 1}
{space 0}{space 0}{ralign 12:anyloan_am~1}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     6084}}}{space 1}{space 1}{ralign 9:{res:{sf:     6084}}}{space 1}{space 1}{ralign 9:{res:{sf: 47476.87}}}{space 1}{space 1}{ralign 9:{res:{sf: 3.43e+09}}}{space 1}{space 1}{ralign 9:{res:{sf: 58565.24}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:   325000}}}{space 1}{space 1}{ralign 9:{res:{sf: 2.89e+08}}}{space 1}

{com}. 
. * Export summary statistics to a text file
. esttab using table1b_nooutliers1.txt, replace cells("mean sd min max") label title("Excluding Outliers Endline 1")
{res}{txt}(output written to {browse  `"table1b_nooutliers1.txt"'})

{com}. 
. 
. * ENDLINE 2 *
. use "$datadir/2013-0533_data_endlines1and2.dta", clear
{txt}(Endline data for "The miracle of microfinance?" (Banerjee et al.), AEJ 2014)

{com}. 
. * Define key variables for summary statistics
. local hh_composition_2 "hhsize_2 adults_2 children_2 male_head_2 head_age_2 head_noeduc_2"
{txt}
{com}. local credit_access_2 "spandana_2 othermfi_2 anybank_2 anyinformal_2 anyloan_2"
{txt}
{com}. local loan_amt_2 "spandana_amt_2 othermfi_amt_2 bank_amt_2 informal_amt_2 anyloan_amt_2"
{txt}
{com}. 
. * Exclude outliers (1st and 99th percentiles for numeric variables)
. 
. foreach var of varlist `hh_composition_2' `credit_access_2' `loan_amt_2' {c -(}
{txt}  2{com}.     quietly summarize `var', detail
{txt}  3{com}.     local p1 = r(p1)
{txt}  4{com}.     local p99 = r(p99)
{txt}  5{com}.     drop if `var' < `p1' | `var' > `p99'
{txt}  6{com}. {c )-}
{txt}(779 observations deleted)
(85 observations deleted)
(37 observations deleted)
(11 observations deleted)
(96 observations deleted)
(1 observation deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(32 observations deleted)
(55 observations deleted)
(58 observations deleted)
(57 observations deleted)
(54 observations deleted)

{com}. 
. * Recalculate summary statistics
. summarize `hh_composition_2' `credit_access_2' `loan_amt_2'

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}hhsize_2 {c |}{res}      5,598     6.07717    2.194519          2         15
{txt}{space 4}adults_2 {c |}{res}      5,598    3.949804    1.660635          2          9
{txt}{space 2}children_2 {c |}{res}      5,598    1.693283    1.200647          0          5
{txt}{space 1}male_head_2 {c |}{res}      5,598    .8206502    .3836792          0          1
{txt}{space 2}head_age_2 {c |}{res}      5,598    41.95355    9.592277         24         69
{txt}{hline 13}{c +}{hline 57}
head_noedu~2 {c |}{res}      5,598    .2813505    .4496982          0          1
{txt}{space 2}spandana_2 {c |}{res}      5,598    .1473741    .3545101          0          1
{txt}{space 2}othermfi_2 {c |}{res}      5,598    .2491961    .4325862          0          1
{txt}{space 3}anybank_2 {c |}{res}      5,598    .0632369    .2434103          0          1
{txt}anyinforma~2 {c |}{res}      5,598    .5993212    .4900798          0          1
{txt}{hline 13}{c +}{hline 57}
{space 3}anyloan_2 {c |}{res}      5,598    .9040729    .2945176          0          1
{txt}spandana_a~2 {c |}{res}      5,598     1928.99    5009.235          0   24989.37
{txt}othermfi_a~2 {c |}{res}      5,598    3952.019    7958.789          0      44000
{txt}{space 2}bank_amt_2 {c |}{res}      5,598    2591.845    12613.47          0   149936.2
{txt}informal_a~2 {c |}{res}      5,598    25351.84    48517.27          0   358180.9
{txt}{hline 13}{c +}{hline 57}
anyloan_am~2 {c |}{res}      5,598    71407.11    87207.09          0     500000
{txt}
{com}. 
. * Store summary statistics
. estpost summarize `hh_composition_2' `credit_access_2' `loan_amt_2'

{txt}{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 9:e(count)}{space 1}{space 1}{ralign 9:e(sum_w)}{space 1}{space 1}{ralign 9:e(mean)}{space 1}{space 1}{ralign 9:e(Var)}{space 1}{space 1}{ralign 9:e(sd)}{space 1}{space 1}{ralign 9:e(min)}{space 1}{space 1}{ralign 9:e(max)}{space 1}{space 1}{ralign 9:e(sum)}{space 1}
{space 0}{hline 13}{c   +}{hline 11}{hline 11}{hline 11}{hline 11}{hline 11}{hline 11}{hline 11}{hline 11}
{space 0}{space 0}{ralign 12:hhsize_2}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     5598}}}{space 1}{space 1}{ralign 9:{res:{sf:     5598}}}{space 1}{space 1}{ralign 9:{res:{sf:  6.07717}}}{space 1}{space 1}{ralign 9:{res:{sf: 4.815913}}}{space 1}{space 1}{ralign 9:{res:{sf: 2.194519}}}{space 1}{space 1}{ralign 9:{res:{sf:        2}}}{space 1}{space 1}{ralign 9:{res:{sf:       15}}}{space 1}{space 1}{ralign 9:{res:{sf:    34020}}}{space 1}
{space 0}{space 0}{ralign 12:adults_2}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     5598}}}{space 1}{space 1}{ralign 9:{res:{sf:     5598}}}{space 1}{space 1}{ralign 9:{res:{sf: 3.949804}}}{space 1}{space 1}{ralign 9:{res:{sf: 2.757709}}}{space 1}{space 1}{ralign 9:{res:{sf: 1.660635}}}{space 1}{space 1}{ralign 9:{res:{sf:        2}}}{space 1}{space 1}{ralign 9:{res:{sf:        9}}}{space 1}{space 1}{ralign 9:{res:{sf:    22111}}}{space 1}
{space 0}{space 0}{ralign 12:children_2}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     5598}}}{space 1}{space 1}{ralign 9:{res:{sf:     5598}}}{space 1}{space 1}{ralign 9:{res:{sf: 1.693283}}}{space 1}{space 1}{ralign 9:{res:{sf: 1.441552}}}{space 1}{space 1}{ralign 9:{res:{sf: 1.200647}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        5}}}{space 1}{space 1}{ralign 9:{res:{sf:     9479}}}{space 1}
{space 0}{space 0}{ralign 12:male_head_2}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     5598}}}{space 1}{space 1}{ralign 9:{res:{sf:     5598}}}{space 1}{space 1}{ralign 9:{res:{sf: .8206502}}}{space 1}{space 1}{ralign 9:{res:{sf: .1472097}}}{space 1}{space 1}{ralign 9:{res:{sf: .3836792}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}{space 1}{ralign 9:{res:{sf:     4594}}}{space 1}
{space 0}{space 0}{ralign 12:head_age_2}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     5598}}}{space 1}{space 1}{ralign 9:{res:{sf:     5598}}}{space 1}{space 1}{ralign 9:{res:{sf: 41.95355}}}{space 1}{space 1}{ralign 9:{res:{sf: 92.01178}}}{space 1}{space 1}{ralign 9:{res:{sf: 9.592277}}}{space 1}{space 1}{ralign 9:{res:{sf:       24}}}{space 1}{space 1}{ralign 9:{res:{sf:       69}}}{space 1}{space 1}{ralign 9:{res:{sf:   234856}}}{space 1}
{space 0}{space 0}{ralign 12:head_noedu~2}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     5598}}}{space 1}{space 1}{ralign 9:{res:{sf:     5598}}}{space 1}{space 1}{ralign 9:{res:{sf: .2813505}}}{space 1}{space 1}{ralign 9:{res:{sf: .2022285}}}{space 1}{space 1}{ralign 9:{res:{sf: .4496982}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}{space 1}{ralign 9:{res:{sf:     1575}}}{space 1}
{space 0}{space 0}{ralign 12:spandana_2}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     5598}}}{space 1}{space 1}{ralign 9:{res:{sf:     5598}}}{space 1}{space 1}{ralign 9:{res:{sf: .1473741}}}{space 1}{space 1}{ralign 9:{res:{sf: .1256774}}}{space 1}{space 1}{ralign 9:{res:{sf: .3545101}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}{space 1}{ralign 9:{res:{sf:      825}}}{space 1}
{space 0}{space 0}{ralign 12:othermfi_2}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     5598}}}{space 1}{space 1}{ralign 9:{res:{sf:     5598}}}{space 1}{space 1}{ralign 9:{res:{sf: .2491961}}}{space 1}{space 1}{ralign 9:{res:{sf: .1871309}}}{space 1}{space 1}{ralign 9:{res:{sf: .4325862}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}{space 1}{ralign 9:{res:{sf:     1395}}}{space 1}
{space 0}{space 0}{ralign 12:anybank_2}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     5598}}}{space 1}{space 1}{ralign 9:{res:{sf:     5598}}}{space 1}{space 1}{ralign 9:{res:{sf: .0632369}}}{space 1}{space 1}{ralign 9:{res:{sf: .0592486}}}{space 1}{space 1}{ralign 9:{res:{sf: .2434103}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}{space 1}{ralign 9:{res:{sf:      354}}}{space 1}
{space 0}{space 0}{ralign 12:anyinforma~2}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     5598}}}{space 1}{space 1}{ralign 9:{res:{sf:     5598}}}{space 1}{space 1}{ralign 9:{res:{sf: .5993212}}}{space 1}{space 1}{ralign 9:{res:{sf: .2401782}}}{space 1}{space 1}{ralign 9:{res:{sf: .4900798}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}{space 1}{ralign 9:{res:{sf:     3355}}}{space 1}
{space 0}{space 0}{ralign 12:anyloan_2}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     5598}}}{space 1}{space 1}{ralign 9:{res:{sf:     5598}}}{space 1}{space 1}{ralign 9:{res:{sf: .9040729}}}{space 1}{space 1}{ralign 9:{res:{sf: .0867406}}}{space 1}{space 1}{ralign 9:{res:{sf: .2945176}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}{space 1}{ralign 9:{res:{sf:     5061}}}{space 1}
{space 0}{space 0}{ralign 12:spandana_a~2}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     5598}}}{space 1}{space 1}{ralign 9:{res:{sf:     5598}}}{space 1}{space 1}{ralign 9:{res:{sf:  1928.99}}}{space 1}{space 1}{ralign 9:{res:{sf: 2.51e+07}}}{space 1}{space 1}{ralign 9:{res:{sf: 5009.235}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf: 24989.37}}}{space 1}{space 1}{ralign 9:{res:{sf: 1.08e+07}}}{space 1}
{space 0}{space 0}{ralign 12:othermfi_a~2}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     5598}}}{space 1}{space 1}{ralign 9:{res:{sf:     5598}}}{space 1}{space 1}{ralign 9:{res:{sf: 3952.019}}}{space 1}{space 1}{ralign 9:{res:{sf: 6.33e+07}}}{space 1}{space 1}{ralign 9:{res:{sf: 7958.789}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:    44000}}}{space 1}{space 1}{ralign 9:{res:{sf: 2.21e+07}}}{space 1}
{space 0}{space 0}{ralign 12:bank_amt_2}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     5598}}}{space 1}{space 1}{ralign 9:{res:{sf:     5598}}}{space 1}{space 1}{ralign 9:{res:{sf: 2591.845}}}{space 1}{space 1}{ralign 9:{res:{sf: 1.59e+08}}}{space 1}{space 1}{ralign 9:{res:{sf: 12613.47}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf: 149936.2}}}{space 1}{space 1}{ralign 9:{res:{sf: 1.45e+07}}}{space 1}
{space 0}{space 0}{ralign 12:informal_a~2}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     5598}}}{space 1}{space 1}{ralign 9:{res:{sf:     5598}}}{space 1}{space 1}{ralign 9:{res:{sf: 25351.84}}}{space 1}{space 1}{ralign 9:{res:{sf: 2.35e+09}}}{space 1}{space 1}{ralign 9:{res:{sf: 48517.27}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf: 358180.9}}}{space 1}{space 1}{ralign 9:{res:{sf: 1.42e+08}}}{space 1}
{space 0}{space 0}{ralign 12:anyloan_am~2}{space 1}{c |}{space 1}{ralign 9:{res:{sf:     5598}}}{space 1}{space 1}{ralign 9:{res:{sf:     5598}}}{space 1}{space 1}{ralign 9:{res:{sf: 71407.11}}}{space 1}{space 1}{ralign 9:{res:{sf: 7.61e+09}}}{space 1}{space 1}{ralign 9:{res:{sf: 87207.09}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:   500000}}}{space 1}{space 1}{ralign 9:{res:{sf: 4.00e+08}}}{space 1}

{com}. 
. * Export summary statistics to a text file
. esttab using table1b_nooutliers2.txt, replace cells("mean sd min max") label title("Excluding Outliers Endline 2")
{res}{txt}(output written to {browse  `"table1b_nooutliers2.txt"'})

{com}. 
. 
. ********************************************************************************
. ********** Regression Robustness: Drop One Control at a Time ********************
. ********************************************************************************
. 
. * Load dataset
. use "$datadir/2013-0533_data_endlines1and2.dta", clear
{txt}(Endline data for "The miracle of microfinance?" (Banerjee et al.), AEJ 2014)

{com}. 
. * Define baseline regression variables 
. local baseline_controls "area_pop_base area_debt_total_base area_business_total_base"
{txt}
{com}. *local outcome bizrev* *
. 
. *** Treatment effect on business revenue ***
. * Loop through controls, excluding one at a time
. foreach var of varlist `baseline_controls' {c -(}
{txt}  2{com}.     display "Running regression without control: `var'"
{txt}  3{com}. 
.     * Build the list of controls excluding `var`
.     local controls_removed ""
{txt}  4{com}.     foreach control of varlist `baseline_controls' {c -(}
{txt}  5{com}.         if "`control'" != "`var'" {c -(}
{txt}  6{com}.             local controls_removed "`controls_removed' `control'"
{txt}  7{com}.         {c )-}
{txt}  8{com}.     {c )-}
{txt}  9{com}.         
.         * Run regression with remaining controls: but regressing on treatment
.     regress bizrev_1 treatment `controls_removed'
{txt} 10{com}.         outreg2 using regression_robustness.txt, append ctitle("Effect of treatment on revenue of old businesses EL1: Excluding `var'")
{txt} 11{com}.         
.         regress bizrev_2 treatment `controls_removed'
{txt} 12{com}.         outreg2 using regression_robustness.txt, append ctitle("Effect of treatment on revenue of old businesses EL2: Excluding `var'")
{txt} 13{com}. 
. {c )-}
Running regression without control: area_pop_base

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     6,608
{txt}{hline 13}{c +}{hline 34}   F(3, 6604)      = {res}    10.27
{txt}       Model {c |} {res} 3.1907e+10         3  1.0636e+10   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 6.8415e+12     6,604  1.0360e+09   {txt}R-squared       ={res}    0.0046
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0042
{txt}       Total {c |} {res} 6.8734e+12     6,607  1.0403e+09   {txt}Root MSE        =   {res}  32186

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}                bizrev_1{col 26}{c |} Coefficient{col 38}  Std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2} 1067.021{col 38}{space 2} 797.9772{col 49}{space 1}    1.34{col 58}{space 3}0.181{col 66}{space 4}-497.2726{col 79}{space 3} 2631.314
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} .0788176{col 38}{space 2} .0148371{col 49}{space 1}    5.31{col 58}{space 3}0.000{col 66}{space 4}  .049732{col 79}{space 3} .1079031
{txt}area_business_total_base {c |}{col 26}{res}{space 2} 100.5104{col 38}{space 2} 81.06556{col 49}{space 1}    1.24{col 58}{space 3}0.215{col 66}{space 4}-58.40426{col 79}{space 3} 259.4251
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} 1242.864{col 38}{space 2}  983.492{col 49}{space 1}    1.26{col 58}{space 3}0.206{col 66}{space 4}-685.0984{col 79}{space 3} 3170.826
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{browse `"/Users/felix/KTH/AppliedEconometrics/Project/Replication"' :dir}{com} : {txt}{stata `"seeout using "regression_robustness.txt""':seeout}

      Source {c |}       SS           df       MS      Number of obs   ={res}     6,116
{txt}{hline 13}{c +}{hline 34}   F(3, 6112)      = {res}     0.98
{txt}       Model {c |} {res}  825554970         3   275184990   {txt}Prob > F        ={res}    0.4028
{txt}    Residual {c |} {res} 1.7226e+12     6,112   281842850   {txt}R-squared       ={res}    0.0005
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.0000
{txt}       Total {c |} {res} 1.7234e+12     6,115   281839583   {txt}Root MSE        =   {res}  16788

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}                bizrev_2{col 26}{c |} Coefficient{col 38}  Std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2} 382.7469{col 38}{space 2}  432.425{col 49}{space 1}    0.89{col 58}{space 3}0.376{col 66}{space 4}-464.9584{col 79}{space 3} 1230.452
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} .0106578{col 38}{space 2} .0076271{col 49}{space 1}    1.40{col 58}{space 3}0.162{col 66}{space 4}-.0042941{col 79}{space 3} .0256097
{txt}area_business_total_base {c |}{col 26}{res}{space 2} 29.04648{col 38}{space 2}  44.2771{col 49}{space 1}    0.66{col 58}{space 3}0.512{col 66}{space 4}-57.75223{col 79}{space 3} 115.8452
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} 5235.508{col 38}{space 2} 531.1304{col 49}{space 1}    9.86{col 58}{space 3}0.000{col 66}{space 4} 4194.305{col 79}{space 3} 6276.711
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{browse `"/Users/felix/KTH/AppliedEconometrics/Project/Replication"' :dir}{com} : {txt}{stata `"seeout using "regression_robustness.txt""':seeout}
Running regression without control: area_debt_total_base

      Source {c |}       SS           df       MS      Number of obs   ={res}     6,608
{txt}{hline 13}{c +}{hline 34}   F(3, 6604)      = {res}     0.86
{txt}       Model {c |} {res} 2.6986e+09         3   899539178   {txt}Prob > F        ={res}    0.4586
{txt}    Residual {c |} {res} 6.8707e+12     6,604  1.0404e+09   {txt}R-squared       ={res}    0.0004
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.0001
{txt}       Total {c |} {res} 6.8734e+12     6,607  1.0403e+09   {txt}Root MSE        =   {res}  32255

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}                bizrev_1{col 26}{c |} Coefficient{col 38}  Std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2} 696.7541{col 38}{space 2}  797.627{col 49}{space 1}    0.87{col 58}{space 3}0.382{col 66}{space 4}-866.8527{col 79}{space 3} 2260.361
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2}-.4303799{col 38}{space 2} 2.703445{col 49}{space 1}   -0.16{col 58}{space 3}0.874{col 66}{space 4}-5.730006{col 79}{space 3} 4.869247
{txt}area_business_total_base {c |}{col 26}{res}{space 2} 112.5662{col 38}{space 2} 81.50586{col 49}{space 1}    1.38{col 58}{space 3}0.167{col 66}{space 4} -47.2116{col 79}{space 3} 272.3441
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} 4150.504{col 38}{space 2} 1234.122{col 49}{space 1}    3.36{col 58}{space 3}0.001{col 66}{space 4} 1731.225{col 79}{space 3} 6569.782
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{browse `"/Users/felix/KTH/AppliedEconometrics/Project/Replication"' :dir}{com} : {txt}{stata `"seeout using "regression_robustness.txt""':seeout}

      Source {c |}       SS           df       MS      Number of obs   ={res}     6,116
{txt}{hline 13}{c +}{hline 34}   F(3, 6112)      = {res}     0.34
{txt}       Model {c |} {res}  286133704         3  95377901.4   {txt}Prob > F        ={res}    0.7976
{txt}    Residual {c |} {res} 1.7232e+12     6,112   281931106   {txt}R-squared       ={res}    0.0002
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.0003
{txt}       Total {c |} {res} 1.7234e+12     6,115   281839583   {txt}Root MSE        =   {res}  16791

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}                bizrev_2{col 26}{c |} Coefficient{col 38}  Std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2} 323.8082{col 38}{space 2} 431.1957{col 49}{space 1}    0.75{col 58}{space 3}0.453{col 66}{space 4}-521.4872{col 79}{space 3} 1169.104
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2}-.2889001{col 38}{space 2} 1.468879{col 49}{space 1}   -0.20{col 58}{space 3}0.844{col 66}{space 4} -3.16842{col 79}{space 3}  2.59062
{txt}area_business_total_base {c |}{col 26}{res}{space 2} 29.24223{col 38}{space 2} 44.46197{col 49}{space 1}    0.66{col 58}{space 3}0.511{col 66}{space 4}-57.91889{col 79}{space 3} 116.4034
{txt}{space 19}_cons {c |}{col 26}{res}{space 2}  5720.11{col 38}{space 2} 669.7774{col 49}{space 1}    8.54{col 58}{space 3}0.000{col 66}{space 4}  4407.11{col 79}{space 3}  7033.11
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{browse `"/Users/felix/KTH/AppliedEconometrics/Project/Replication"' :dir}{com} : {txt}{stata `"seeout using "regression_robustness.txt""':seeout}
Running regression without control: area_business_total_base

      Source {c |}       SS           df       MS      Number of obs   ={res}     6,608
{txt}{hline 13}{c +}{hline 34}   F(3, 6604)      = {res}     9.78
{txt}       Model {c |} {res} 3.0401e+10         3  1.0134e+10   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 6.8430e+12     6,604  1.0362e+09   {txt}R-squared       ={res}    0.0044
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0040
{txt}       Total {c |} {res} 6.8734e+12     6,607  1.0403e+09   {txt}Root MSE        =   {res}  32190

{txt}{hline 21}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            bizrev_1{col 22}{c |} Coefficient{col 34}  Std. err.{col 46}      t{col 54}   P>|t|{col 62}     [95% con{col 75}f. interval]
{hline 21}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 11}treatment {c |}{col 22}{res}{space 2} 1007.864{col 34}{space 2} 797.0376{col 45}{space 1}    1.26{col 54}{space 3}0.206{col 62}{space 4} -554.587{col 75}{space 3} 2570.315
{txt}{space 7}area_pop_base {c |}{col 22}{res}{space 2} .7841392{col 34}{space 2} 2.703182{col 45}{space 1}    0.29{col 54}{space 3}0.772{col 62}{space 4}-4.514971{col 75}{space 3}  6.08325
{txt}area_debt_total_base {c |}{col 22}{res}{space 2} .0798403{col 34}{space 2} .0149162{col 45}{space 1}    5.35{col 54}{space 3}0.000{col 62}{space 4} .0505996{col 75}{space 3} .1090809
{txt}{space 15}_cons {c |}{col 22}{res}{space 2} 1709.596{col 34}{space 2} 1204.775{col 45}{space 1}    1.42{col 54}{space 3}0.156{col 62}{space 4}-652.1532{col 75}{space 3} 4071.345
{txt}{hline 21}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{browse `"/Users/felix/KTH/AppliedEconometrics/Project/Replication"' :dir}{com} : {txt}{stata `"seeout using "regression_robustness.txt""':seeout}

      Source {c |}       SS           df       MS      Number of obs   ={res}     6,116
{txt}{hline 13}{c +}{hline 34}   F(3, 6112)      = {res}     0.84
{txt}       Model {c |} {res}  708244634         3   236081545   {txt}Prob > F        ={res}    0.4730
{txt}    Residual {c |} {res} 1.7227e+12     6,112   281862043   {txt}R-squared       ={res}    0.0004
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.0001
{txt}       Total {c |} {res} 1.7234e+12     6,115   281839583   {txt}Root MSE        =   {res}  16789

{txt}{hline 21}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            bizrev_2{col 22}{c |} Coefficient{col 34}  Std. err.{col 46}      t{col 54}   P>|t|{col 62}     [95% con{col 75}f. interval]
{hline 21}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 11}treatment {c |}{col 22}{res}{space 2} 362.0736{col 34}{space 2}  432.121{col 45}{space 1}    0.84{col 54}{space 3}0.402{col 62}{space 4}-485.0358{col 75}{space 3} 1209.183
{txt}{space 7}area_pop_base {c |}{col 22}{res}{space 2}-.1747181{col 34}{space 2} 1.469835{col 45}{space 1}   -0.12{col 54}{space 3}0.905{col 62}{space 4}-3.056112{col 75}{space 3} 2.706676
{txt}area_debt_total_base {c |}{col 22}{res}{space 2} .0106478{col 34}{space 2}  .007664{col 45}{space 1}    1.39{col 54}{space 3}0.165{col 62}{space 4}-.0043763{col 75}{space 3} .0256719
{txt}{space 15}_cons {c |}{col 22}{res}{space 2} 5507.568{col 34}{space 2} 646.3329{col 45}{space 1}    8.52{col 54}{space 3}0.000{col 62}{space 4} 4240.528{col 75}{space 3} 6774.609
{txt}{hline 21}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{browse `"/Users/felix/KTH/AppliedEconometrics/Project/Replication"' :dir}{com} : {txt}{stata `"seeout using "regression_robustness.txt""':seeout}

{com}. *** Treatment effect on business revenue ***
. * Define baseline regression variables 
. local baseline_controls "area_pop_base area_debt_total_base area_business_total_base"
{txt}
{com}. foreach var of varlist `baseline_controls' {c -(}
{txt}  2{com}.     display "Running regression without control: `var'"
{txt}  3{com}. 
.     * Build the list of controls excluding `var`
.     local controls_removed ""
{txt}  4{com}.     foreach control of varlist `baseline_controls' {c -(}
{txt}  5{com}.         if "`control'" != "`var'" {c -(}
{txt}  6{com}.             local controls_removed "`controls_removed' `control'"
{txt}  7{com}.         {c )-}
{txt}  8{com}.     {c )-}   
{txt}  9{com}.         * Run regression with remaining controls: but regressing on treatment
.     regress spandana_1 treatment `controls_removed'
{txt} 10{com}.         outreg2 using regression_robustness.txt, append ctitle("Effect of treatment on credit EL1: Excluding `var'")
{txt} 11{com}.         
.         regress spandana_2 treatment `controls_removed'
{txt} 12{com}.         outreg2 using regression_robustness.txt, append ctitle("Effect of treatment on credit EL2: Excluding `var'")
{txt} 13{com}. {c )-}
Running regression without control: area_pop_base

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     6,811
{txt}{hline 13}{c +}{hline 34}   F(3, 6807)      = {res}   152.77
{txt}       Model {c |} {res}  49.179226         3  16.3930753   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 730.423475     6,807  .107304756   {txt}R-squared       ={res}    0.0631
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0627
{txt}       Total {c |} {res} 779.602702     6,810  .114479104   {txt}Root MSE        =   {res} .32757

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}              spandana_1{col 26}{c |} Coefficient{col 38}  Std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2} .1598535{col 38}{space 2} .0079962{col 49}{space 1}   19.99{col 58}{space 3}0.000{col 66}{space 4} .1441784{col 79}{space 3} .1755285
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} 1.21e-06{col 38}{space 2} 1.46e-07{col 49}{space 1}    8.35{col 58}{space 3}0.000{col 66}{space 4} 9.29e-07{col 79}{space 3} 1.50e-06
{txt}area_business_total_base {c |}{col 26}{res}{space 2}-.0021775{col 38}{space 2} .0008135{col 49}{space 1}   -2.68{col 58}{space 3}0.007{col 66}{space 4}-.0037723{col 79}{space 3}-.0005828
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} .0223775{col 38}{space 2} .0098167{col 49}{space 1}    2.28{col 58}{space 3}0.023{col 66}{space 4} .0031337{col 79}{space 3} .0416213
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{browse `"/Users/felix/KTH/AppliedEconometrics/Project/Replication"' :dir}{com} : {txt}{stata `"seeout using "regression_robustness.txt""':seeout}

      Source {c |}       SS           df       MS      Number of obs   ={res}     6,142
{txt}{hline 13}{c +}{hline 34}   F(3, 6138)      = {res}    28.13
{txt}       Model {c |} {res} 10.7016669         3  3.56722231   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res}  778.48101     6,138  .126829751   {txt}R-squared       ={res}    0.0136
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0131
{txt}       Total {c |} {res} 789.182677     6,141  .128510451   {txt}Root MSE        =   {res} .35613

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}              spandana_2{col 26}{c |} Coefficient{col 38}  Std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2} .0772676{col 38}{space 2} .0091529{col 49}{space 1}    8.44{col 58}{space 3}0.000{col 66}{space 4} .0593248{col 79}{space 3} .0952105
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} 4.11e-07{col 38}{space 2} 1.62e-07{col 49}{space 1}    2.54{col 58}{space 3}0.011{col 66}{space 4} 9.39e-08{col 79}{space 3} 7.28e-07
{txt}area_business_total_base {c |}{col 26}{res}{space 2}-.0024768{col 38}{space 2} .0009374{col 49}{space 1}   -2.64{col 58}{space 3}0.008{col 66}{space 4}-.0043145{col 79}{space 3}-.0006392
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} .1147292{col 38}{space 2} .0112433{col 49}{space 1}   10.20{col 58}{space 3}0.000{col 66}{space 4} .0926884{col 79}{space 3}   .13677
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{browse `"/Users/felix/KTH/AppliedEconometrics/Project/Replication"' :dir}{com} : {txt}{stata `"seeout using "regression_robustness.txt""':seeout}
Running regression without control: area_debt_total_base

      Source {c |}       SS           df       MS      Number of obs   ={res}     6,811
{txt}{hline 13}{c +}{hline 34}   F(3, 6807)      = {res}   128.53
{txt}       Model {c |} {res} 41.7926534         3  13.9308845   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 737.810048     6,807    .1083899   {txt}R-squared       ={res}    0.0536
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0532
{txt}       Total {c |} {res} 779.602702     6,810  .114479104   {txt}Root MSE        =   {res} .32923

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}              spandana_1{col 26}{c |} Coefficient{col 38}  Std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2} .1537127{col 38}{space 2} .0080165{col 49}{space 1}   19.17{col 58}{space 3}0.000{col 66}{space 4} .1379978{col 79}{space 3} .1694276
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2}-.0000248{col 38}{space 2} .0000272{col 49}{space 1}   -0.91{col 58}{space 3}0.362{col 66}{space 4}-.0000781{col 79}{space 3} .0000285
{txt}area_business_total_base {c |}{col 26}{res}{space 2}-.0020637{col 38}{space 2} .0008202{col 49}{space 1}   -2.52{col 58}{space 3}0.012{col 66}{space 4}-.0036715{col 79}{space 3} -.000456
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} .0737403{col 38}{space 2} .0123905{col 49}{space 1}    5.95{col 58}{space 3}0.000{col 66}{space 4}  .049451{col 79}{space 3} .0980297
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{browse `"/Users/felix/KTH/AppliedEconometrics/Project/Replication"' :dir}{com} : {txt}{stata `"seeout using "regression_robustness.txt""':seeout}

      Source {c |}       SS           df       MS      Number of obs   ={res}     6,142
{txt}{hline 13}{c +}{hline 34}   F(3, 6138)      = {res}    26.94
{txt}       Model {c |} {res} 10.2551958         3  3.41839862   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 778.927481     6,138   .12690249   {txt}R-squared       ={res}    0.0130
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0125
{txt}       Total {c |} {res} 789.182677     6,141  .128510451   {txt}Root MSE        =   {res} .35623

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}              spandana_2{col 26}{c |} Coefficient{col 38}  Std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2}  .074429{col 38}{space 2}  .009129{col 49}{space 1}    8.15{col 58}{space 3}0.000{col 66}{space 4} .0565329{col 79}{space 3}  .092325
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2}-.0000533{col 38}{space 2} .0000311{col 49}{space 1}   -1.71{col 58}{space 3}0.087{col 66}{space 4}-.0001142{col 79}{space 3} 7.67e-06
{txt}area_business_total_base {c |}{col 26}{res}{space 2} -.002584{col 38}{space 2} .0009415{col 49}{space 1}   -2.74{col 58}{space 3}0.006{col 66}{space 4}-.0044296{col 79}{space 3}-.0007384
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} .1475323{col 38}{space 2} .0141825{col 49}{space 1}   10.40{col 58}{space 3}0.000{col 66}{space 4} .1197296{col 79}{space 3}  .175335
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{browse `"/Users/felix/KTH/AppliedEconometrics/Project/Replication"' :dir}{com} : {txt}{stata `"seeout using "regression_robustness.txt""':seeout}
Running regression without control: area_business_total_base

      Source {c |}       SS           df       MS      Number of obs   ={res}     6,811
{txt}{hline 13}{c +}{hline 34}   F(3, 6807)      = {res}   150.24
{txt}       Model {c |} {res} 48.4136267         3  16.1378756   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 731.189075     6,807  .107417229   {txt}R-squared       ={res}    0.0621
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0617
{txt}       Total {c |} {res} 779.602702     6,810  .114479104   {txt}Root MSE        =   {res} .32775

{txt}{hline 21}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          spandana_1{col 22}{c |} Coefficient{col 34}  Std. err.{col 46}      t{col 54}   P>|t|{col 62}     [95% con{col 75}f. interval]
{hline 21}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 11}treatment {c |}{col 22}{res}{space 2} .1613583{col 34}{space 2} .0079941{col 45}{space 1}   20.18{col 54}{space 3}0.000{col 62}{space 4} .1456873{col 75}{space 3} .1770293
{txt}{space 7}area_pop_base {c |}{col 22}{res}{space 2} 4.68e-06{col 34}{space 2} .0000271{col 45}{space 1}    0.17{col 54}{space 3}0.863{col 62}{space 4}-.0000485{col 75}{space 3} .0000579
{txt}area_debt_total_base {c |}{col 22}{res}{space 2} 1.21e-06{col 34}{space 2} 1.46e-07{col 45}{space 1}    8.25{col 54}{space 3}0.000{col 62}{space 4} 9.20e-07{col 75}{space 3} 1.49e-06
{txt}{space 15}_cons {c |}{col 22}{res}{space 2} .0049407{col 34}{space 2} .0120512{col 45}{space 1}    0.41{col 54}{space 3}0.682{col 62}{space 4}-.0186835{col 75}{space 3} .0285649
{txt}{hline 21}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{browse `"/Users/felix/KTH/AppliedEconometrics/Project/Replication"' :dir}{com} : {txt}{stata `"seeout using "regression_robustness.txt""':seeout}

      Source {c |}       SS           df       MS      Number of obs   ={res}     6,142
{txt}{hline 13}{c +}{hline 34}   F(3, 6138)      = {res}    26.28
{txt}       Model {c |} {res}  10.006999         3  3.33566634   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 779.175678     6,138  .126942926   {txt}R-squared       ={res}    0.0127
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0122
{txt}       Total {c |} {res} 789.182677     6,141  .128510451   {txt}Root MSE        =   {res} .35629

{txt}{hline 21}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          spandana_2{col 22}{c |} Coefficient{col 34}  Std. err.{col 46}      t{col 54}   P>|t|{col 62}     [95% con{col 75}f. interval]
{hline 21}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 11}treatment {c |}{col 22}{res}{space 2} .0782383{col 34}{space 2} .0091502{col 45}{space 1}    8.55{col 54}{space 3}0.000{col 62}{space 4} .0603007{col 75}{space 3} .0961759
{txt}{space 7}area_pop_base {c |}{col 22}{res}{space 2}-.0000382{col 34}{space 2} .0000311{col 45}{space 1}   -1.23{col 54}{space 3}0.220{col 62}{space 4}-.0000992{col 75}{space 3} .0000229
{txt}area_debt_total_base {c |}{col 22}{res}{space 2} 3.84e-07{col 34}{space 2} 1.63e-07{col 45}{space 1}    2.36{col 54}{space 3}0.018{col 62}{space 4} 6.52e-08{col 75}{space 3} 7.02e-07
{txt}{space 15}_cons {c |}{col 22}{res}{space 2} .1092788{col 34}{space 2} .0136892{col 45}{space 1}    7.98{col 54}{space 3}0.000{col 62}{space 4} .0824433{col 75}{space 3} .1361143
{txt}{hline 21}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{browse `"/Users/felix/KTH/AppliedEconometrics/Project/Replication"' :dir}{com} : {txt}{stata `"seeout using "regression_robustness.txt""':seeout}

{com}. ********************************************************************************
. ********** Regression Robustness: Add Additional Controls ***********************
. ********************************************************************************
. 
. * Load endline dataset
. use "$datadir/2013-0533_data_endlines1and2.dta", clear
{txt}(Endline data for "The miracle of microfinance?" (Banerjee et al.), AEJ 2014)

{com}. 
. * Baseline and additional control variables
. local baseline_controls "area_pop_base area_debt_total_base area_business_total_base"
{txt}
{com}. local additional_controls "adult* children* male_head* hhsize*"
{txt}
{com}. *local outcome bizrev* *
. 
. * Run regression with baseline + additional controls: treatment effect on business revenue*
. *regress `outcome' `baseline_controls' `additional_controls'*
. 
. regress bizrev_1 treatment `baseline_controls' `additional_controls'

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     5,898
{txt}{hline 13}{c +}{hline 34}   F(14, 5883)     = {res}     5.14
{txt}       Model {c |} {res} 6.8334e+10        14  4.8810e+09   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 5.5884e+12     5,883   949920662   {txt}R-squared       ={res}    0.0121
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0097
{txt}       Total {c |} {res} 5.6567e+12     5,897   959253464   {txt}Root MSE        =   {res}  30821

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}                bizrev_1{col 26}{c |} Coefficient{col 38}  Std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2} 1129.462{col 38}{space 2} 810.1156{col 49}{space 1}    1.39{col 58}{space 3}0.163{col 66}{space 4}-458.6618{col 79}{space 3} 2717.587
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2} .9635526{col 38}{space 2}  2.75969{col 49}{space 1}    0.35{col 58}{space 3}0.727{col 66}{space 4}-4.446453{col 79}{space 3} 6.373558
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2}  .079651{col 38}{space 2}  .014651{col 49}{space 1}    5.44{col 58}{space 3}0.000{col 66}{space 4} .0509297{col 79}{space 3} .1083723
{txt}area_business_total_base {c |}{col 26}{res}{space 2} 79.17539{col 38}{space 2} 83.15203{col 49}{space 1}    0.95{col 58}{space 3}0.341{col 66}{space 4}-83.83313{col 79}{space 3} 242.1839
{txt}{space 16}adults_1 {c |}{col 26}{res}{space 2} 2773.211{col 38}{space 2} 2062.116{col 49}{space 1}    1.34{col 58}{space 3}0.179{col 66}{space 4}-1269.293{col 79}{space 3} 6815.715
{txt}{space 16}adults_2 {c |}{col 26}{res}{space 2} 1343.489{col 38}{space 2} 1489.531{col 49}{space 1}    0.90{col 58}{space 3}0.367{col 66}{space 4}-1576.539{col 79}{space 3} 4263.516
{txt}{space 14}children_1 {c |}{col 26}{res}{space 2} 2706.856{col 38}{space 2} 2160.585{col 49}{space 1}    1.25{col 58}{space 3}0.210{col 66}{space 4}-1528.684{col 79}{space 3} 6942.395
{txt}{space 14}children_2 {c |}{col 26}{res}{space 2} 1197.623{col 38}{space 2} 1041.942{col 49}{space 1}    1.15{col 58}{space 3}0.250{col 66}{space 4}-844.9648{col 79}{space 3} 3240.211
{txt}{space 13}male_head_1 {c |}{col 26}{res}{space 2} 1272.366{col 38}{space 2} 1616.868{col 49}{space 1}    0.79{col 58}{space 3}0.431{col 66}{space 4}-1897.289{col 79}{space 3} 4442.022
{txt}{space 13}male_head_2 {c |}{col 26}{res}{space 2} 1821.629{col 38}{space 2} 1257.572{col 49}{space 1}    1.45{col 58}{space 3}0.148{col 66}{space 4}-643.6739{col 79}{space 3} 4286.931
{txt}{space 16}hhsize_1 {c |}{col 26}{res}{space 2}-2484.857{col 38}{space 2} 2511.631{col 49}{space 1}   -0.99{col 58}{space 3}0.323{col 66}{space 4}-7408.576{col 79}{space 3} 2438.863
{txt}{space 12}hhsize_adj_1 {c |}{col 26}{res}{space 2} 372.5254{col 38}{space 2} 1508.099{col 49}{space 1}    0.25{col 58}{space 3}0.805{col 66}{space 4}-2583.903{col 79}{space 3} 3328.954
{txt}{space 16}hhsize_2 {c |}{col 26}{res}{space 2} 442.6131{col 38}{space 2} 494.0623{col 49}{space 1}    0.90{col 58}{space 3}0.370{col 66}{space 4}-525.9305{col 79}{space 3} 1411.157
{txt}{space 12}hhsize_adj_2 {c |}{col 26}{res}{space 2}-1633.535{col 38}{space 2} 1527.414{col 49}{space 1}   -1.07{col 58}{space 3}0.285{col 66}{space 4}-4627.828{col 79}{space 3} 1360.758
{txt}{space 19}_cons {c |}{col 26}{res}{space 2}-7487.559{col 38}{space 2} 2124.254{col 49}{space 1}   -3.52{col 58}{space 3}0.000{col 66}{space 4}-11651.88{col 79}{space 3}-3323.241
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. * Export results
. outreg2 using regression_addcontrols.txt, append ctitle("With Additional Controls")
{browse `"/Users/felix/KTH/AppliedEconometrics/Project/Replication"' :dir} : {txt}{stata `"seeout using "regression_addcontrols.txt""':seeout}

{com}. regress bizrev_2 treatment `baseline_controls' `additional_controls'

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     6,070
{txt}{hline 13}{c +}{hline 34}   F(14, 6055)     = {res}     7.47
{txt}       Model {c |} {res} 2.8885e+10        14  2.0632e+09   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 1.6719e+12     6,055   276124898   {txt}R-squared       ={res}    0.0170
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0147
{txt}       Total {c |} {res} 1.7008e+12     6,069   280247345   {txt}Root MSE        =   {res}  16617

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}                bizrev_2{col 26}{c |} Coefficient{col 38}  Std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2} 360.1444{col 38}{space 2} 430.5793{col 49}{space 1}    0.84{col 58}{space 3}0.403{col 66}{space 4}-483.9442{col 79}{space 3} 1204.233
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2}-.2580532{col 38}{space 2}  1.46834{col 49}{space 1}   -0.18{col 58}{space 3}0.861{col 66}{space 4}-3.136523{col 79}{space 3} 2.620416
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} .0098912{col 38}{space 2} .0076079{col 49}{space 1}    1.30{col 58}{space 3}0.194{col 66}{space 4}-.0050229{col 79}{space 3} .0248053
{txt}area_business_total_base {c |}{col 26}{res}{space 2}  34.5947{col 38}{space 2} 44.23107{col 49}{space 1}    0.78{col 58}{space 3}0.434{col 66}{space 4}-52.11395{col 79}{space 3} 121.3033
{txt}{space 16}adults_1 {c |}{col 26}{res}{space 2} 1159.949{col 38}{space 2}  1106.46{col 49}{space 1}    1.05{col 58}{space 3}0.295{col 66}{space 4}-1009.105{col 79}{space 3} 3329.003
{txt}{space 16}adults_2 {c |}{col 26}{res}{space 2} 477.2649{col 38}{space 2} 785.4942{col 49}{space 1}    0.61{col 58}{space 3}0.543{col 66}{space 4}-1062.583{col 79}{space 3} 2017.113
{txt}{space 14}children_1 {c |}{col 26}{res}{space 2} 2098.514{col 38}{space 2} 1158.378{col 49}{space 1}    1.81{col 58}{space 3}0.070{col 66}{space 4}-172.3202{col 79}{space 3} 4369.348
{txt}{space 14}children_2 {c |}{col 26}{res}{space 2} 371.4965{col 38}{space 2} 550.4713{col 49}{space 1}    0.67{col 58}{space 3}0.500{col 66}{space 4}-707.6231{col 79}{space 3} 1450.616
{txt}{space 13}male_head_1 {c |}{col 26}{res}{space 2} 1409.901{col 38}{space 2} 858.5716{col 49}{space 1}    1.64{col 58}{space 3}0.101{col 66}{space 4}-273.2046{col 79}{space 3} 3093.007
{txt}{space 13}male_head_2 {c |}{col 26}{res}{space 2}   1501.6{col 38}{space 2} 669.1127{col 49}{space 1}    2.24{col 58}{space 3}0.025{col 66}{space 4} 189.9007{col 79}{space 3} 2813.299
{txt}{space 16}hhsize_1 {c |}{col 26}{res}{space 2}-2144.028{col 38}{space 2} 1342.865{col 49}{space 1}   -1.60{col 58}{space 3}0.110{col 66}{space 4}-4776.521{col 79}{space 3} 488.4658
{txt}{space 12}hhsize_adj_1 {c |}{col 26}{res}{space 2} 1304.426{col 38}{space 2} 801.0005{col 49}{space 1}    1.63{col 58}{space 3}0.103{col 66}{space 4}-265.8197{col 79}{space 3} 2874.672
{txt}{space 16}hhsize_2 {c |}{col 26}{res}{space 2}-14.53844{col 38}{space 2} 258.9566{col 49}{space 1}   -0.06{col 58}{space 3}0.955{col 66}{space 4}-522.1854{col 79}{space 3} 493.1086
{txt}{space 12}hhsize_adj_2 {c |}{col 26}{res}{space 2} 62.66036{col 38}{space 2} 808.1626{col 49}{space 1}    0.08{col 58}{space 3}0.938{col 66}{space 4}-1521.626{col 79}{space 3} 1646.947
{txt}{space 19}_cons {c |}{col 26}{res}{space 2}-2165.867{col 38}{space 2} 1128.639{col 49}{space 1}   -1.92{col 58}{space 3}0.055{col 66}{space 4}-4378.402{col 79}{space 3} 46.66733
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. * Export results
. outreg2 using regression_addcontrols.txt, append ctitle("With Additional Controls")
{browse `"/Users/felix/KTH/AppliedEconometrics/Project/Replication"' :dir} : {txt}{stata `"seeout using "regression_addcontrols.txt""':seeout}

{com}. 
. * Baseline and additional control variables
. local baseline_controls "area_pop_base area_debt_total_base area_business_total_base"
{txt}
{com}. local additional_controls "adult* children* male_head* hhsize*"
{txt}
{com}. *local outcome bizrev* *
. 
. * Run regression with baseline + additional controls: treatment effect on credit*
. *regress `outcome' `baseline_controls' `additional_controls'*
. 
. regress spandana_1 treatment `baseline_controls' `additional_controls'

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     6,054
{txt}{hline 13}{c +}{hline 34}   F(14, 6039)     = {res}    34.02
{txt}       Model {c |} {res} 52.1414617        14  3.72439012   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 661.160157     6,039  .109481728   {txt}R-squared       ={res}    0.0731
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0709
{txt}       Total {c |} {res} 713.301619     6,053   .11784266   {txt}Root MSE        =   {res} .33088

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}              spandana_1{col 26}{c |} Coefficient{col 38}  Std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2} .1662748{col 38}{space 2} .0085836{col 49}{space 1}   19.37{col 58}{space 3}0.000{col 66}{space 4}  .149448{col 79}{space 3} .1831017
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2}-6.91e-06{col 38}{space 2} .0000293{col 49}{space 1}   -0.24{col 58}{space 3}0.813{col 66}{space 4}-.0000643{col 79}{space 3} .0000505
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} 1.24e-06{col 38}{space 2} 1.52e-07{col 49}{space 1}    8.19{col 58}{space 3}0.000{col 66}{space 4} 9.44e-07{col 79}{space 3} 1.54e-06
{txt}area_business_total_base {c |}{col 26}{res}{space 2}  -.00259{col 38}{space 2} .0008814{col 49}{space 1}   -2.94{col 58}{space 3}0.003{col 66}{space 4}-.0043179{col 79}{space 3}-.0008622
{txt}{space 16}adults_1 {c |}{col 26}{res}{space 2} .0235265{col 38}{space 2} .0220339{col 49}{space 1}    1.07{col 58}{space 3}0.286{col 66}{space 4}-.0196678{col 79}{space 3} .0667208
{txt}{space 16}adults_2 {c |}{col 26}{res}{space 2}-.0133033{col 38}{space 2} .0156689{col 49}{space 1}   -0.85{col 58}{space 3}0.396{col 66}{space 4}  -.04402{col 79}{space 3} .0174133
{txt}{space 14}children_1 {c |}{col 26}{res}{space 2} .0339403{col 38}{space 2} .0230679{col 49}{space 1}    1.47{col 58}{space 3}0.141{col 66}{space 4} -.011281{col 79}{space 3} .0791616
{txt}{space 14}children_2 {c |}{col 26}{res}{space 2}-.0078423{col 38}{space 2} .0109868{col 49}{space 1}   -0.71{col 58}{space 3}0.475{col 66}{space 4}-.0293803{col 79}{space 3} .0136956
{txt}{space 13}male_head_1 {c |}{col 26}{res}{space 2} .0206728{col 38}{space 2} .0171134{col 49}{space 1}    1.21{col 58}{space 3}0.227{col 66}{space 4}-.0128755{col 79}{space 3} .0542211
{txt}{space 13}male_head_2 {c |}{col 26}{res}{space 2}-.0209895{col 38}{space 2} .0133259{col 49}{space 1}   -1.58{col 58}{space 3}0.115{col 66}{space 4}-.0471131{col 79}{space 3} .0051341
{txt}{space 16}hhsize_1 {c |}{col 26}{res}{space 2} -.040659{col 38}{space 2} .0267389{col 49}{space 1}   -1.52{col 58}{space 3}0.128{col 66}{space 4}-.0930768{col 79}{space 3} .0117588
{txt}{space 12}hhsize_adj_1 {c |}{col 26}{res}{space 2} .0205044{col 38}{space 2} .0159472{col 49}{space 1}    1.29{col 58}{space 3}0.199{col 66}{space 4}-.0107578{col 79}{space 3} .0517666
{txt}{space 16}hhsize_2 {c |}{col 26}{res}{space 2} .0004579{col 38}{space 2} .0051786{col 49}{space 1}    0.09{col 58}{space 3}0.930{col 66}{space 4}-.0096941{col 79}{space 3} .0106098
{txt}{space 12}hhsize_adj_2 {c |}{col 26}{res}{space 2} .0226218{col 38}{space 2} .0161179{col 49}{space 1}    1.40{col 58}{space 3}0.161{col 66}{space 4} -.008975{col 79}{space 3} .0542187
{txt}{space 19}_cons {c |}{col 26}{res}{space 2}-.0352378{col 38}{space 2} .0225119{col 49}{space 1}   -1.57{col 58}{space 3}0.118{col 66}{space 4}-.0793692{col 79}{space 3} .0088936
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. * Export results
. outreg2 using regression_addcontrols.txt, append ctitle("With Additional Controls")
{browse `"/Users/felix/KTH/AppliedEconometrics/Project/Replication"' :dir} : {txt}{stata `"seeout using "regression_addcontrols.txt""':seeout}

{com}. regress spandana_2 treatment `baseline_controls' `additional_controls'

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     6,096
{txt}{hline 13}{c +}{hline 34}   F(14, 6081)     = {res}     9.73
{txt}       Model {c |} {res} 17.2022978        14  1.22873556   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 768.135629     6,081  .126317321   {txt}R-squared       ={res}    0.0219
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0197
{txt}       Total {c |} {res} 785.337927     6,095  .128849537   {txt}Root MSE        =   {res} .35541

{txt}{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}              spandana_2{col 26}{c |} Coefficient{col 38}  Std. err.{col 50}      t{col 58}   P>|t|{col 66}     [95% con{col 79}f. interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}treatment {c |}{col 26}{res}{space 2} .0783606{col 38}{space 2} .0091884{col 49}{space 1}    8.53{col 58}{space 3}0.000{col 66}{space 4}  .060348{col 79}{space 3} .0963732
{txt}{space 11}area_pop_base {c |}{col 26}{res}{space 2}-.0000537{col 38}{space 2} .0000313{col 49}{space 1}   -1.71{col 58}{space 3}0.087{col 66}{space 4}-.0001151{col 79}{space 3} 7.77e-06
{txt}{space 4}area_debt_total_base {c |}{col 26}{res}{space 2} 3.81e-07{col 38}{space 2} 1.63e-07{col 49}{space 1}    2.35{col 58}{space 3}0.019{col 66}{space 4} 6.27e-08{col 79}{space 3} 7.00e-07
{txt}area_business_total_base {c |}{col 26}{res}{space 2}-.0027223{col 38}{space 2} .0009442{col 49}{space 1}   -2.88{col 58}{space 3}0.004{col 66}{space 4}-.0045732{col 79}{space 3}-.0008714
{txt}{space 16}adults_1 {c |}{col 26}{res}{space 2} .0397877{col 38}{space 2} .0236636{col 49}{space 1}    1.68{col 58}{space 3}0.093{col 66}{space 4}-.0066013{col 79}{space 3} .0861768
{txt}{space 16}adults_2 {c |}{col 26}{res}{space 2}-.0311667{col 38}{space 2}  .016752{col 49}{space 1}   -1.86{col 58}{space 3}0.063{col 66}{space 4}-.0640066{col 79}{space 3} .0016731
{txt}{space 14}children_1 {c |}{col 26}{res}{space 2} .0469136{col 38}{space 2} .0247691{col 49}{space 1}    1.89{col 58}{space 3}0.058{col 66}{space 4}-.0016426{col 79}{space 3} .0954698
{txt}{space 14}children_2 {c |}{col 26}{res}{space 2}-.0243704{col 38}{space 2} .0117399{col 49}{space 1}   -2.08{col 58}{space 3}0.038{col 66}{space 4}-.0473848{col 79}{space 3} -.001356
{txt}{space 13}male_head_1 {c |}{col 26}{res}{space 2} .0119919{col 38}{space 2} .0183367{col 49}{space 1}    0.65{col 58}{space 3}0.513{col 66}{space 4}-.0239545{col 79}{space 3} .0479384
{txt}{space 13}male_head_2 {c |}{col 26}{res}{space 2}-.0073359{col 38}{space 2} .0142637{col 49}{space 1}   -0.51{col 58}{space 3}0.607{col 66}{space 4}-.0352979{col 79}{space 3}  .020626
{txt}{space 16}hhsize_1 {c |}{col 26}{res}{space 2}-.0240857{col 38}{space 2}  .028694{col 49}{space 1}   -0.84{col 58}{space 3}0.401{col 66}{space 4} -.080336{col 79}{space 3} .0321646
{txt}{space 12}hhsize_adj_1 {c |}{col 26}{res}{space 2}-.0227202{col 38}{space 2} .0170837{col 49}{space 1}   -1.33{col 58}{space 3}0.184{col 66}{space 4}-.0562103{col 79}{space 3} .0107698
{txt}{space 16}hhsize_2 {c |}{col 26}{res}{space 2} .0042473{col 38}{space 2} .0055303{col 49}{space 1}    0.77{col 58}{space 3}0.443{col 66}{space 4} -.006594{col 79}{space 3} .0150886
{txt}{space 12}hhsize_adj_2 {c |}{col 26}{res}{space 2} .0442187{col 38}{space 2} .0172356{col 49}{space 1}    2.57{col 58}{space 3}0.010{col 66}{space 4} .0104309{col 79}{space 3} .0780065
{txt}{space 19}_cons {c |}{col 26}{res}{space 2} .0644798{col 38}{space 2} .0240927{col 49}{space 1}    2.68{col 58}{space 3}0.007{col 66}{space 4} .0172495{col 79}{space 3} .1117101
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. * Export results
. outreg2 using regression_addcontrols.txt, append ctitle("With Additional Controls")
{browse `"/Users/felix/KTH/AppliedEconometrics/Project/Replication"' :dir} : {txt}{stata `"seeout using "regression_addcontrols.txt""':seeout}

{com}. 
{txt}end of do-file

{com}. 